[
	{
		"année": 1,
		"blocs": [
			{
				"nom": "Mathématiques et informatique",
				"ratio": 40,
				"matières": [
					{
						"nom": "Algèbre générale",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 60,
						"resume": "Apprendre à argumenter en s'appuyant sur un raisonnement logique formalisé. Introduire les opérations ensemblistes de base, les notions de relations binaires et d’applications entre ensembles. Introduire les concepts de base du dénombrement, de l’abalyse combinatoire et des probabilités discrètes. Pratiquer l’arithmétique dans l’ensemble des entiers relatifs et dans l’ensemble des polynômes à coefficients dans R ou dans C.",
						"contenu": "Raisonnements logiques, dénombrement, analyse combinatoire, lois discrètes usuelles.\nIntroduire les opérations ensemblistes de base, les notions de relation binaires, applications, arithmétique et polynômes.\n Des exemples concrets seront présentés pour illustrer et/ou modéliser certaines situations liées aux concepts présentés.",
						"objectifs/situations": [
							{
								"obj": "Défendre une argumentation en s'appuyant sur un raisonnement logique formalisé.\nIdentifier, reconnaître les différents raisonnements.\nConstruire un raisonnement mathématique en utilisant les quantificateurs.",
								"sit": "Traduire et reformuler par écrit des propositions à l'aide des quantificateurs et des connecteurs logiques.\nConstruire des démonstrations en choisissant le raisonnement adéquat"
							},
							{
								"obj": "Décrire et expliquer les concepts de base du dénombrement et de l’analyse combinatoire",
								"sit": "Faire le lien entre les propositions logiques, la théorie des ensembles et les principes du dénombrement : union, union disjointe, inclusion, ensemble fini, partition d’un ensemble"
							},
							{
								"obj": "Décrire et expliquer les concepts de base des probabilités",
								"sit": "Définir l’ensemble des résultats possibles d’une expérience aléatoire.\nDonner la définition d’un événement, d’un événement élémentaire, d’un événement contraire, d’un événement impossible, d’événements incompatibles, d’un système complet d’événements."
							},
							{
								"obj": "Décrire les lois discrètes usuelles, savoir reconnaître la loi à utiliser en fonction des données de l’énoncé",
								"sit": "Travailler sur des situations concrètes mettant en jeu les lois de probabilités discrètes usuelles."
							},
							{
								"obj": "Enumérer et expliquer les propriétés usuelles d'une relation binaire.",
								"sit": "Traduire les propriétés usuelles d'une relation binaire à l'aide de quantificateurs.\nDéterminer le graphe d'une relation binaire.\nReconnaître les propriétés d'une relation binaire à partir de son graphe.\nDémontrer qu'une relation binaire possède une propriété donnée.\nAppliquer les définitions sur des exemples concrets."
							},
							{
								"obj": "Décrire, énumérer et expliciter les propriétés usuelles d'une application, les mettre en œuvre sur des exemples simples, les représenter sur un graphe.",
								"sit": "Traduire les propriétés usuelles d'une relation à l'aide de quantificateurs.\nDémontrer qu'une application possède une propriété donnée.\nAppliquer les définitions sur des exemples concrets.\nReconnaître graphiquement une application injective, surjective et bijective.\nIllustrer graphiquement les notions d'application injective, surjective et bijective."
							},
							{
								"obj": "Décrire les notions liées à la division euclidienne dans Z.\nAlgorithme d'Euclide et ses applications Résoudre des équations à inconnues entières",
								"sit": ""
							},
							{
								"obj": "Décrire les notions liées à la division euclidienne dans K[X] où K=R ou K=C.",
								"sit": ""
							}
						]
					},
					{
						"nom": "Suites, fonctions d’une variable réelle et approximation",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 52,
						"resume": "Introduire les outils mathématiques pour modéliser des phénomènes discrets ou continus.\nOn étudiera aussi quelques méthodes pour déterminer les solutions approchées d'équations et modéliseret résoudre certains problèmes d'optimisation",
						"contenu": "- Inégalités dans R et valeur absolue d'un réel\n- Ensembles majorés, minorés, bornés, majorant, minorant, bornes supérieures et inférieures, éléments minimal, maximal\n- Suites numériques: suites extraites, suites convergentes, suites divergentes, suites majorées,minorées, bornées, suites monotones\n- Propriétés des suites monotones\n- Comparaison des suites, théorème du “gendarme”\n- Suites adjacentes, fonctions monotones, périodiques, paires, majorées, minorées, bornées\n- Définition de la continuité, continuité à droite et à gauche, opérations sur les fonctions continues\n- Théorème de la valeur intermédiaire, continuité et monotonie\n- Dérivabilité opérations sur les fonctions dérivables\n- Extremum Local, théorèmes de Rolle et des accroissements finis\n- Application à des problèmes d'optimisation\n- Suites récurrentes, monotonie d'une suite récurrente, point fixe\n- Localisation des zéros d'une fonction: Méthode de la Dichotomie, Méthode de la Sécante et estimation de l'erreur",
						"objectifs/situations": [
							{
								"obj": "Déterminer et calculer des solutions approchées d'équations\nEstimer les erreurs d'approximation\nDifférencier les phénomènes discrets des phénomènes continus\nModéliser les phénomènes discrets et continus",
								"sit": "Résoudre des équations\nRésoudre des problèmes à l'aide de logiciels formels Mathematica (en binôme)"
							},
							{
								"obj": "Interpréter et illustrer géométriquement les énoncés mathématiques",
								"sit": "Illustrer à l'aide des logiciels formels (Mathematica) les concepts et résultats mathématiques (par binôme)"
							},
							{
								"obj": "Modéliser un problème d'optimisation et appliquer les techniques de recherche d'extrema",
								"sit": "Modéliser et résoudre des problèmes d'une seule variable"
							}
						]
					},
					{
						"nom": "Bases de l’informatique et de la programmation",
						"semestre": 1,
						"coeff": 5,
						"nb_heures": 72,
						"resume": "L’objectif de ce module est l’apprentissage des bases de la programmation en C ainsi que les bases de l’algorithmique. L’étudiant doit être capable à la fin du module de rédiger un algorithme simple de résolution à un problème afin de l’implémenter en langage C. Les étudiants sont encouragés à acquérir de l’autonomie afin d’aller chercher l'information nécessaire à la réalisation d'une des tâches précédentes si l'élève ne la connaît pas. Les messages d'erreurs du compilateur doivent être compris afin de les utiliser pour corriger un programme. Enfin, les étudiants doivent être capables de dérouler et corriger des algorithmes et programmes simples.",
						"contenu": "- Introduction au système Unix, ligne de commande.\n- Compilation sans Warning ni erreurs avec gcc, débogage avec gdb.\n- Types de base du C, représentation des données en machine, notions d’adresses et de pointeurs.\n- Structures de contrôle, fonctions, passages par valeur et par adresse.\n- Tableaux et matrices statiques et décalage d’adresse.\n- Algorithmes gloutons.\n- Algorithmes de tri quadratiques (bulles, insertion, sélection…)",
						"objectifs/situations": [
							{
								"obj": "Décrire l'architecture générale matérielle et logicielle (i.e. système d'exploitation) d'un ordinateur.",
								"sit": "Montage et démontage un ordinateur. Enumération des principaux composants et leur fonctionnalité. Maîtrise des commandes Unix usuelles. "
							},
							{
								"obj": "Concevoir, écrire, compiler et exécuter un programme C en environnement ligne de commandes.",
								"sit": "Utilisation d'un éditeur de code basique (gedit ou vi) et compilation en ligne de commandes via gcc.\nCompilation sans erreur ni warning exigée."
							},
							{
								"obj": "Concevoir des algorithmes élémentaires et évaluer leur complexité.",
								"sit": "Ecriture d’algorithmes simples en pseudo-code puis implémentation en langage C. Prévision de leur temps d’exécution puis mesure de ce dernier."
							},
							{
								"obj": "Maîtriser les types d’algorithmes basiques",
								"sit": "Déroulement et rédactions d’algorithmes gloutons et des algorithmes de tri quadratiques."
							},
							{
								"obj": "Maîtriser les types élémentaires de données en C.",
								"sit": "Choix du type, déclaration et affectation des variables. Connaissance des tailles des différents types de données."
							},
							{
								"obj": "Manipuler les pointeurs",
								"sit": "Description de l’état de la mémoire à la fin d’un programme C. Compréhension des notions d’adresses et de déréférencement."
							},
							{
								"obj": "Maîtriser les structures de contrôles en C (if/else, for, while …) et les fonctions.",
								"sit": "Association d’un diagramme de flux à une structure de contrôle. Manipulation des arguments de la ligne de commande (argc, argv) aux travers de fonctions, en maîtrisant les types de retour et les passages par adresse."
							},
							{
								"obj": "Manipuler les tableaux et les chaines de caractères.",
								"sit": "Déclaration, initialisation, manipulation et accès en lecture/écriture à des tableaux statiques et chaînes de caractères en C."
							},
							{
								"obj": "Déboguer et optimiser un code",
								"sit": "Analyse des erreurs d’exécution à l’aide de GDB. Mesure du temps d’exécution d’un programme."
							}
						]
					},
					{
						"nom": "Atelier de renforcement numérique",
						"semestre": 1,
						"coeff": 1,
						"nb_heures": 12,
						"resume": "Ce module permet de renforcer les notions mathématiques de base et de développer l'agilité au calcul",
						"contenu": "Ce module permet de renforcer les notions mathématiques de base et de développer l'agilité au calcul",
						"objectifs/situations": [
							{
								"obj": "Réviser le calcul algébrique",
								"sit": "Factoriser une expression\nEncadrer une expression\nSigne d’un trinôme et signe d’une expression\nRésoudre une équation\nRésoudre une inéquation"
							},
							{
								"obj": "Réviser le calcul trigonométrique et applications géométriques",
								"sit": "Déterminer le Cosinus, le Sinus et la tangente d’un angle\nRésoudre des équations trigonométriques\nDéterminer la projection orthogonale d’un vecteur sur une droite"
							},
							{
								"obj": "Réviser le calcul dans C et application à linéarisation",
								"sit": "Déterminer le module et un argument d’un complexe\nDéterminer la forme algébrique et trigonométrique d’un complexe\nLinéariser une expression trigonométrique\nDéterminer une racine carrée d’un complexe\nRésoudre quelques équation en utilisant les racines nième d’un complexe"
							},
							{
								"obj": "Réviser le calcul de dérivée d’une fonction\nRappeler le calcul de primitive et calcul d’intégral de fonctions simples\nRésoudre une équation différentielle linéaire d’ordre 1 et d’ordre 2 à coefficients constants",
								"sit": ""
							}
						]
					},
					{
						"nom": "Algèbre linéaire",
						"semestre": 2,
						"coeff": 2.5,
						"nb_heures": 0,
						"resume": "Le module vise à acquérir les notions élémentaires relatives à l'algèbre linéaire, qui interviennent dans un grand nombre de domaines : transformations géométriques, problèmes d’optimisation, résolution de systèmes linéaires, calculs statistiques, théorie des graphes, etc. Il importe de maîtriser parfaitement les notions matricielles, dont notamment le vocabulaire lié aux matrices remarquables, une bonne pratique du calcul matriciel, la sensibilisation à la noncommutativité du produit. La méthode du pivot de Gauss est un outil essentiel qui permet de répondre à de nombreuses questions : calcul du rang, du déterminant et de l’inverse d’une matrice ; résolution d’un système linéaire. La description algorithmique de la méthode ainsi que son utilisation sont un objectif incontournable du module ; on pourra également envisager sa programmation. Les notions élémentaires sur les espaces vectoriels réels doivent être connues : le cas de l’espace R^n est incontournable, mais on présentera également des espaces de polynômes, des espaces de suites et de fonctions, des espaces de matrices. La notion d’application linéaire doit être travaillée en lien avec sa représentation matricielle dans une base donnée. Dès que possible, on veillera à apporter une interprétation géométrique à chacune des notions abordées.",
						"contenu": "Calculs dans R^n : cas particuliers de R^2 et de R^3.\nNotion d'espace vectoriel réel : cas particulier de R^n.\nNotion de sous-espace vectoriel : cas particulier des sous-espaces vectoriels de R^n.\nÉquations cartésiennes et équations paramétriques d'un sous-espace vectoriel.\nFamilles de vecteurs : famille libre, famille liée, famille génératrice, base.\nCombinaison linéaire d'une famille de vecteurs, rang d'une famille de vecteurs.\nSous-espace vectoriel engendré par une famille de vecteurs, notation Vect.\nComposantes d'un vecteur dans une base donnée.\nDimension d'un espace vectoriel, dimension d'un sousespace vectoriel.\nOpérations sur les matrices : somme, multiplication externe, multiplication interne, puissances d'une matrice carrée, inverse d'une matrice carrée.\nDéterminant d'une matrice carrée : cas particulier des matrices d’ordre 2 et d’ordre 3.\nMéthode du pivot de Gauss : opérations élémentaires, aspect algorithmique, résolution de systèmes avec plusieurs seconds membres, calcul de l’inverse d’une matrice carrée.\nNotion de systèmes linéaires : systèmes homogènes et systèmes avec second membre, résolution par la méthode de substitution pour les systèmes simples\nÉtude de systèmes linéaires simples avec choix d'inconnues principales.\nInterprétation matricielle des systèmes linéaires.\nApplications linéaires entre deux espaces vectoriels réels : cas particulier des applications linéaires de R^p dans R^n.\nNoyau et image d'une application linéaire.\nThéorème du rang pour les applications linéaires.\nMatrice associée à une application linéaire dans des bases données.",
						"objectifs/situations": [
							{
								"obj": "Pratiquer le calcul vectoriel dans R^n et le calcul matriciel.",
								"sit": "Opérations sur les vecteurs et interprétation géométrique.\nOpérations sur les matrices.\nCalcul de l'inverse d'une matrice par la méthode de Gauss, lien avec l’informatique.\nÉtude de suites récurrentes linéaires (suite de Fibonacci) et de systèmes différentiels linéaires."
							},
							{
								"obj": "Déterminer des relations entre les vecteurs, déterminer les composantes d’un vecteur dans une base donnée.",
								"sit": "Résolution de systèmes linéaires"
							},
							{
								"obj": "Manipuler les sous-espaces vectoriels de R^n.",
								"sit": "Écrire un sous-espace vectoriel défini par un système linéaire homogène comme sous-espace vectoriel engendré.\nTrouver une famille génératrice d’un sous-espace vectoriel.\nTrouver une base d’un sous-espace vectoriel.\nSimplifier un système de générateurs."
							},
							{
								"obj": "Résoudre un système linéaire.",
								"sit": "Maîtriser la méthode du pivot de Gauss.\nOrganiser rationnellement les calculs permettant la résolution d’un système linéaire.\nUtiliser le théorème du rang et la forme de la solution d’un système linéaire."
							},
							{
								"obj": "Reconnaître une application linéaire, déterminer la matrice d’une application linéaire dans une base donnée.",
								"sit": "Déterminer la matrice associée à une application linéaire.\nEffectuer la composition de deux applications linéaires.\nDéterminer la dimension de l’image et la dimension du noyau d’une application linéaire."
							}
						]
					},
					{
						"nom": "Etude locale de fonctions et intégration",
						"semestre": 2,
						"coeff": 3,
						"nb_heures": 60,
						"resume": "On introduit dans ce module les notions qui permettent l'étude locale d'une fonction et on décrit le concept de l'intégrale utilisé dans le calcul d'une aire.",
						"contenu": "On introduit dans ce module les notions qui permettent l'étude locale d'une fonction et on décrit le concept de l'intégrale utilisé dans le calcul d'une aire.",
						"objectifs/situations": [
							{
								"obj": "Etudier localement une fonction",
								"sit": "Déterminer le développement limité d'une fonction.\nCalculer des limites.\nEffectuer un calcul numérique approché à la main.\nEtudier la position relative d'une courbe et de sa tangente.\nDéterminer l'asymptote éventuelle de la courbe représentative d'une fonction."
							},
							{
								"obj": "Décrire le concept de l'intégrale.\nCalculer une intégrale/une primitive.",
								"sit": "Calculer une aire à l'aide d'une intégrale.\nInterpréter géométriquement une intégrale.\nCalculer une valeur approchée d'une intégrale par des méthodes numériques (rectangle, trapèze,...) et estimation de l'erreur"
							},
							{
								"obj": "Décrire les lois continues usuelles et connaître les paramètres usuels de position et de dispersion",
								"sit": "Travailler sur des situations concrètes mettant en jeu les lois de probabilités continues usuelles.
"
							}
						]
					},
					{
						"nom": "Atelier de renforcement numérique 2",
						"semestre": 2,
						"coeff": 1,
						"nb_heures": 12,
						"resume": "- Renforcer les notions de base\n- Développer l'agilité au calcul\n- Développer le bon sens",
						"contenu": "- Décomposition en éléments simples et application au calcul intégration\n- Intégration numérique: Méthodes de trapèzes et des rectangles",
						"objectifs/situations": [
							{
								"obj": "Définir la décomposition d’une fraction rationnelle en élément simples dans le cas où les pôles sont simples",
								"sit": "Déterminer les pôles d’une fraction rationnelle\nDécomposer en éléments simples une fraction rationnelle dans le cas où les pôles sont simples"
							},
							{
								"obj": "Définir la décomposition d’une fraction rationnelle en élément simples dans le cas général",
								"sit": "Décomposer un polynôme à coefficients réels en produits de polynômes irréductibles\nDécomposer en éléments simples une fraction rationnelle"
							},
							{
								"obj": "Calcul d’intégral et calcul de primitive de fraction rationnelle",
								"sit": "Utiliser la formule de changement de variables pour le calcul d’intégral et le calcul de primitive.\nCalculer une intégrale et calculer une primitive d’une fraction rationnelle"
							}
						]
					},
					{
						"nom": "Bases de l'algorithme et de la programmation 2",
						"semestre": 2,
						"coeff": 4.5,
						"nb_heures": 72,
						"resume": "L’objectif de ce module est d’approfondir les acquis du premier semestre concernant l’algorithmique et la programmation en C. L'accent est donc mis sur les méthodes de conception d'algorithmes ainsi que leurs implémentations plutôt que de présenter un catalogue d'algorithmes. On présente de nombreux exemples illustrant les méthodes suivantes: diviser pour régner, programmation dynamique ou encore récursivité. D'autres notions de langage C comme l'allocation dynamique de mémoire ou le traitement de fichiers sont également étudiées. Tous les algorithmes sont programmés par les étudiants en C. L'objectif est de rendre l'étudiant créatif devant un problème.",
						"contenu": "- Définition des parties d'un algorithme\n- Récursivité\n- Méthodes diviser pour régner\n- Programmation dynamique\n- Allocation dynamique de mémoire\n- Algorithmes : exponentiation rapide, tri rapide, problème du sac à dos\n- Langage C : structures, fichiers et représentation des données.",
						"objectifs/situations": [
							{
								"obj": "Comprendre et maîtriser la programmation récursive.",
								"sit": "Rédactions d’algorithmes courts manipulant tous les types de récursivité. Transformation d’un programme itératif en récursif et vice-versa"
							},
							{
								"obj": "Choisir le meilleur type d’allocation en fonction d’un problème donné.",
								"sit": "Rédaction de programmes manipulant l’allocation dynamique et statique. Decription de l’état de la mémoire à la fin de l’exécution d’un programme. Débogage à l’aide de Valgrind."
							},
							{
								"obj": "Optimiser un programme afin d’améliorer la performance.",
								"sit": "Simplification d’un code existant.\nAmélioration d’un code / algorithme fourni."
							},
							{
								"obj": "Structurer un code C et le rendre plus lisible.",
								"sit": "Manipulation des types structurés (struct, union, enum) et des redéfinitions de type."
							},
							{
								"obj": "Lire et écrire des données dans un fichier sur le disque.",
								"sit": "Manipulation des fonctions et structures de fichiers en C."
							},
							{
								"obj": "Représenter les variables de types entiers et flottants en mémoire.",
								"sit": "Conversion d’entiers et de décimaux d’une base à une autre (bases hexa, décimale, octale, binaire)."
							},
							{
								"obj": "Connaitre quelques algorithmes standards.",
								"sit": "Implémentation des algorithmes d’exponentiation rapide, de tri rapide, de problème du sac à dos …"
							},
							{
								"obj": "Choisir l’algorithme le plus adapté à un problème donné.",
								"sit": "Choix et mise en pratique d’un algorithme : tri, glouton ou de type diviser pour régner, répondant au mieux à un problème concret."
							}
						]
					},
					{
						"nom": "Introduction au langage Python",
						"semestre": 2,
						"coeff": 1,
						"nb_heures": 12,
						"resume": "L’objectif de ce module est de poser les bases de la programmation en python.",
						"contenu": "",
						"objectifs/situations": []
					}
				]
			},
			{
				"nom": "Physique, électronique et systèmes",
				"ratio": 32,
				"matières": [
					{
						"nom": "Mécanique du point et trajectographie spatiale",
						"semestre": 1,
						"coeff": 4,
						"nb_heures": 48,
						"resume": "Ce module présente les lois générales de la cinématique et de la dynamique du point matériel. Son objectif est d’établir et d’utiliser les principes fondamentaux nécessaires à la description des mouvements que nous observons autour de nous.\n
Pour chaque objectif d’apprentissage la méthodologie est toujours la même :\n
- Mémoriser les nouvelles notions, les comprendre ensuite et les appliquer à bon escient.
- Lister les hypothèses du problème après avoir lu l’énoncé.
- Discriminer le problème posé entre un problème de cinématique du point et un problème de dynamique du point.
- Reproduire la méthodologie de résolution d’exercice de physique appliqué à la cinématique du point ou à la dynamique du point.
- Reconnaître puis identifier les pré-requis mathématiques utiles à la résolution analytiques des équations obtenues en utilisant les théorèmes fondamentaux de la mécanique.
- Choisir l’outil adéquat et permis pour calculer numériquement le résultat ; calcul mental, calculatrice, Scilab.
- Après la résolution interpréter et questionner les résultats obtenus.
- Si besoin, estimer alors en justifiant les éventuelles erreurs commises lors de la résolution.
- Prédire enfin le comportement futur du système.",
						"contenu": "Concept 1 : Se réperer dans l’espace
	1. Repérage dans l’espace et Cinématique du point
	2. Description du mouvement et référentiel
	3. Application à l’étude de quelques mouvements particuliers
	4. Changements de référentiels\n
Concept 2 : Décrire et quantifier un mouvement
	1. Définition des quantités cinématiques de base (position, vitesse et accelération).
	2. Définition des différents types de mouvement ; savoir les calculer et les reconnaitre.\n
Concept 3 : Utiliser l’approche énergétique pour le prévision d’un mouvement
	1. Définition et interprétation des 3 différentes énergies.
	2. Définition du travail et de la puissance.
	3. Téorèmes fondamentaux : énergie cinétique, énergie mécanique.
	4. Utilisation de l’énergie dans les problèmes de mécanique lorsque ces théorèmes facilitent les calculs qui pourraient aussi être faits grâce à l’approche dynamique dans les cas suivants:
		a. mouvement sur la Terre,
		b. la chute libre,
		c. les mouvements oscillatoires,
		d. les mouvements des satellites.\n
Concept 4 : Relier les interactions mécaniques au déplacement
	1. Principes et théorèmes de la dynamique du point
	2. Référentiels galiléens et lois de Newton
	3. Théorèmes fondamentaux : principe fondamental de la dynamique et changements de référentiels, quantité de mouvement, moment cinétique.
	4. Utilisation du PFD avec tout type de forces classiques (poids,réaction du support, frottements dur et fluide, pseudo-forces, etc.) dans les cas suivants :
		a. mouvement sur la Terre,
		b. la chute libre en prenant en compte la rotation de la Terre.
		c. les mouvements oscillatoires,
			i. Oscillateur harmonique et oscillations libres : étude sans et avec amortissement du système masse-ressort et analogies électromécaniques.
			ii. Oscillations forcées ou entretenues : exemple du système masse-ressort soumis à une excitation de forme sinusoïdale et analogies électro-mécaniques, phénomène de résonance.
		d. Application à la trajectographie spatiale.
			i. Etude du mouvement des astres, planètes, étoiles, comètes, fusées, satellites
			ii. Exemple des trajectoires possibles d’un engin spatial lancé à partir de la Terre, vitesse de satellisation, vitesse de libération, changement d’orbite, état d’apesanteur.\n
Il est aussi possible d’ordonner ce même contenu par thématique et non par concepts physiques, comme suit :
	1. Le repérage dans l’espace et la cinématique.
	2. La chute d’un corps.
	3. Les mouvements oscillatoires.
	4. La trajectographie spatiale.",
						"objectifs/situations": [
							{
								"obj": "Se repérer dans l’espace au travers des systèmes de coordonnées usuels et y traduire les caractéristiques cinématiques d’un point objet (vecteurs position, vitesse et accélération).",
								"sit": "Etude des éléments cinématiques d’un mouvement dans les bases usuelles de repérage (cartésienne, cylindrique, polaire et sphérique) au travers d’exemples simples de translation et/ou de rotation."
							},
							{
								"obj": "Modéliser le mouvement d’un objet ponctuel soumis à un ensemble d’interactions mécaniques à partir des lois de la Dynamique.",
								"sit": "Utilisation du Principe Fondamental de la Dynamique pour l’étude dynamique de systèmes mécaniques simples (chute libre d’un corps, chute dans un milieu visqueux, oscillations d’un pendule pensant ou d’un ressort harmonique, particules chargées dans un champ électromagnétique…)."
							},
							{
								"obj": "Interpréter le concept d’énergie (énergies cinématique, potentielle, mécanique) et appliquer la notion de conservation de l’énergie pour les systèmes isolés.",
								"sit": "Application de la conservation de l’énergie mécanique pour l’étude du mouvement des planètes autour du soleil ou des satellites terrestres autour de la Terre."
							}
						]
					},
					{
						"nom": "Base de l'électronique analogique",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 42,
						"resume": "- Acquérir les notions de base en électronique analogique.\n- Savoir analyser un circuit électronique. Déterminer son rôle.",
						"contenu": "Chapitre 1: Les lois générales de l’électrocinétique\n	1. Grandeurs électriques - Loi d’ohm\n	2. Dipôle électrique\n	3. Lois de Kirchhoff\n	4. Théorèmes de Thévenin et de Norton\n	5. Principe de superposition\n	6. Théorème de Millman\n\nChapitre 2: Les diodes\n	1. La diode redresseuse et son utilisation\n	2. La diode Zener et son utilisation\n\nChapitre 3: Les transistors bipolaires\n	1. Structure du transistor\n	2. Fonctionnement de base du transistor\n	3. Caractéristiques et paramètres du transistor\n	4. Le Transistor comme amplificateur\n	5. Le transistor comme interrupteur\n	6. Circuits de polarisation du transistor\n	7. Amplificateurs bipolaires à faibles signaux\n	8. Amplificateurs de puissance",
						"objectifs/situations": [
							{
								"obj": "Enumérer et identifier les différents types de structures élémentaires analogiques d’un circuit (Identifier les composants de base, reconnaitre les différentes associations de composants)",
								"sit": "Identifier une structure à partir d’un schéma en évaluation individuelle"
							},
							{
								"obj": "Analyser et modéliser la fonction de transfert statique et dynamique d’un circuit analogique pour déterminer ses caractéristiques d’entrées et de sorties (Appliquer les lois fondamentales de l’électronique pour calculer des courants et des tensions dans des circuits électroniques constitués de composants analogiques passifs : redressement de tension, régulation, amplification par transistor bipolaire,….)",
								"sit": "Calculer les tensions et courants d’un circuit électrique en évaluation individuelle"
							}
						]
					},
					{
						"nom": "Mesures, composants électroniques et robotique",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 36,
						"resume": "Ce module comporte deux parties distinctes :\n- Une initiation à la robotique basée sur le kit didactique LEGO Mindstorms\n- Des études, simulations et mesures sur les composants et montages électroniques de base.",
						"contenu": "TP d’initiation à la robotique\n- Imaginer et réaliser un robot répondant à un cahier des charges donné.\n- Travailler en groupe et dans un temps limité.\n\nTP mesure et composants électroniques\n- Prise en main des appareils de mesure du laboratoire (oscilloscope, générateur basse fréquence, multimètre)\n- Prise en main d'un logiciel de simulation de circuits électronique (type SPICE).\n- Application des théorèmes de THEVENIN, de NORTON et de MILLMAN.\n- Diode à jonction : Redressement et filtrage.\n- Diode Zener.\n- LED.\n- Transistor NPN et PNP.\n- Régulateur de tension linéaire intégré.",
						"objectifs/situations": [
							{
								"obj": "Expérimenter en un temps court les missions d’un ingénieur : Réalisation d’un produit répondant à un cahier des charges précis, travail en équipe, présentation du projet",
								"sit": "Participation au concours robotique en 1A : Concevoir en équipe un robot Lego Mindstorm répondant à un cahier des charges"
							},
							{
								"obj": "Analyser des montages utilisant des structure et composants d’électronique analogiques de base.",
								"sit": "Analyser et tester des structures élémentaires d’électrocinétique. Reconnaître les structures élémentaires sur un schéma électronique complet. Analyser et expliquer l’utilisation de chaque sousfonction. Mesurer les différents signaux et comparer les résultats."
							},
							{
								"obj": "Réaliser des montages utilisant des structure et composants d’électronique analogiques de base.",
								"sit": "Analyser et expliquer l’utilisation de chaque sousfonction."
							},
							{
								"obj": "Réaliser des montages utilisant des amplificateurs opérationnels. Analyser et concevoir des filtres analogiques.",
								"sit": "Mesurer les différents signaux et comparer les résultats."
							}
						]
					},
					{
						"nom": "Electronique analogique",
						"semestre": 2,
						"coeff": 3,
						"nb_heures": 36,
						"resume": "- Maîtrise (analyse et conception) des montages à base d'amplificateurs linéaires intégrés)\n- Introduction à la représentation fréquentielle des systèmes (approche fonction de transfert)",
						"contenu": "Chapitre I. Amplificateur Linéaire Intégré\n	1. L’amplificateur Linéaire Intégré\n	2. Montages Linéaires\n	3. Montages Non Linéaires\n	4. Oscillateurs\nChapitre II. Le régime sinusoïdal\n	1. Notations complexes\n	2. Loi d’Ohm généralisée\nChapitre III. Fonction de transfert des circuits linéaires\n	1. Notion de filtrage\n	2. Fonction de transfert\n	3. Ordre d’un circuit\n	4. Fonction de transfert d’un circuit linéaire\n	5. Propriétés des fonctions de transfert\n	6. Nature des fonctions de transfert\n	7. Les diagrammes de Bode\nChapitre IV. Filtres analogiques\n	1. Filtre Passif du 1er ordre\n	2. Filtre Passif du 2nd ordre\n	3. Filtre Actif du 1er ordre\n	4. Filtre Atif du 2nd ordre",
						"objectifs/situations": [
							{
								"obj": "Analyser et concevoir des structures électroniques à base d’amplificateurs opérationnels.\nAnalyser et concevoir des filtres analogiques.",
								"sit": "Analyser et calculer des structures élémentaires à amplificateur opérationnel.\nReconnaitre les structures élémentaires sur un schéma électronique complet.\nAnalyser des filtres analogiques à partir de schéma ou diagrammes de Bode.\nDe concevoir des filtres analogiques à partir de cahier des charges."
							}
						]
					},
					{
						"nom": "Projet d'électronique analogique",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 27,
						"resume": "Etude de l'amplificateur opérationnel (A.O.) et application des notions fondamentales des circuits électriques à la mesure des caractéristiques et à l'analyse des circuits utilisant des A.O. tels que amplificateur de tension, de courant, inverseur, non inverseur, suiveur, sommateur, intégrateur, dérivateur, filtre, comparateur, etc.",
						"contenu": "Partie projet : les élèves réalisent une carte électronique complète en partant du routage ( ex: amplificateur audio , electromyographe, ...)\n\nPartie TP : Amplificateur opérationnel\n- Etude des montages, suiveur de tension, sommateur et soustracteur.\n- Etude, du montage dérivateur (filtre passe haut du 1er ordre), du comparateur et du Trigger de Schmitt.\n- Etude, du montage intégrateur (filtre passe bas du 1er ordre), d'un multivibrateur astable et d'un générateur de signaux sinusoîdaux.",
						"objectifs/situations": [
							{
								"obj": "Analyser un schéma et produire une carte électronique architecturée autour de montages à amplificateurs opérationnels.",
								"sit": "Analyser et tester des structures élémentaires à amplificateur opérationnel.\nReconnaitre les structures élémentaires sur un schéma électronique complet.\nAnalyser et expliquer l’utilisation de chaque sousfonction.\nConstruire une carte électronique.\nMesurer les différents signaux et comparer les résultats."
							}
						]
					},
					{
						"nom": "Projet fil rouge",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 24,
						"resume": "Ce module propose une mise en situation mobilisant les matières scientifiques (Mathématiques, Physique, Electronique, Informatique) dans le cadre d’une démarche projet",
						"contenu": "Le thème de l’année est « Lanceur de projectiles».\nLes étudiants par groupe, vont calculer, simuler, tester la trajectoire d'un projectile.\nIl réaliseront un montage permettant de tester leur modélisation.\nIls assisteront au lancer « grandeur nature » de leur réalisation lors d’un évènement organisé en mai.",
						"objectifs/situations": [
							{
								"obj": "Modéliser la trajectoire d'un projectile",
								"sit": "Mobiliser les connaissances de Physique et Mathématiques pour calculer et élaborer un modèle. Tester le modèle."
							},
							{
								"obj": "Réaliser un dispositif mécanique ou électronique permettant de lancer le projectile.",
								"sit": "Réalisation en laboratoire"
							},
							{
								"obj": "Travailler en équipe",
								"sit": "Mode projet"
							}
						]
					},
					{
						"nom": "Physique des composants électroniques de base",
						"semestre": 2,
						"coeff": 3,
						"nb_heures": 36,
						"resume": "Ce module aborde les bases de l'Electromagnétisme en régime permanent (électrostatique et Magnétostatique) et en régime lentement variable (Induction électromagnétique) au travers de l’étude des composants analogiques de base de l’électronique que sont le condensateur, la résistance et l’inductance. L’accent est mis sur les phénomènes physiques – champ électrique, champ magnétique, effet Joule - dont ils sont le siège.\nPour chaque objectif d’apprentissage la méthodologie est toujours la même :\n- Mémoriser les nouvelles notions, les comprendre ensuite et les appliquer à bon escient.\n- Lister les hypothèses du problème après avoir lu l’énoncé.\n- Discriminer le problème posé entre un problème d’électrostatique et un problème de magnétostatique.\n- Reproduire la méthodologie de résolution d’exercice de physique appliqué à l’électrostatique ou à la magnétostatique.\n- Reconnaître puis identifier les prérequis mathématiques utiles à la résolution analytiques des équations obtenues en utilisant les théorèmes fondamentaux de l’électromagnétostatique.\n- Choisir l’outil adéquat et permis pour calculer numériquement le résultat ; calcul mental, calculatrice, Scilab.\n- Après la résolution interpréter et questionner les résultats obtenus.\n- Si besoin, estimer alors en justifiant les éventuelles erreurs commises lors de la résolution.\n- Prédire enfin le comportement futur du système.",
						"contenu": "Thème 1. Le condensateur\n	1. Étude pratique d’un condensateur.\n	2. Principe et comportement d’un condensateur dans un circuit électrique.\n	3. Caractéristiques et technologie des condensateurs.\n	4. Étude théorique d’un condensateur.\n	5. Calcul du champ électrostatique par calcul direct et théorème de Gauss.\n	6. Calcul du potentiel par les opérateurs et énergie électrostatique.\n	7. Conducteurs en équilibre électrostatique.\n	8. Condensateurs.\n	9. Applications à d’autres distributions.\n	10. Approfondissement: le dipôle électrostatique\n	11. Potentiel et champ créés à grande distance par un dipôle.\n	12. Action d'un champ électrostatique extérieur sur un dipôle.\n	13. Approximation dipolaire du potentiel.\n\nThème 2. La résistance\n	1. Étude pratique d’une résistance.\n	2. Principe et comportement d’une résistance dans un circuit électrique.\n	3. Caractéristiques et technologie des résistances.\n	4. Etude théorique de la résistance.\n	5. Caractérisation d’un courant électrique.\n	6. Loi d'Ohm. Résistivité.\n	7. Applications.\n\nThème 3. L’inductance\n	1. Étude pratique d’une inductance.\n	2. Principe et comportement d’une inductance dans un circuit électrique.\n	3. Caractéristiques et technologie des inductances.\n	4. Étude théorique d’une inductance.\n	5. Champ magnétostatique.\n	6. Electrodynamique des régimes stationnaires.\n	7. Phénomène d'induction électromagnétique.\n	8. Énergie potentielle magnétostatique d'un système de courant.\n	9. Applications (systèmes électromécaniques : hautparleur, moteur, transformateur).\n	10. Approfondissement en magnétostatique : le dipôle magnétique.\n	11. Définition du moment magnétique d’un circuit.\n	12. Couple agissant sur le circuit sous l’action d’un champ extérieur B:\n		a. Énergie potentielle du dipôle dans un champ extérieur B\n		b. Champ d’un dipôle magnétique",
						"objectifs/situations": [
							{
								"obj": "Différentier les composants analogiques de base de l’Electronique que sont le condensateur, le conducteur ohmique et l’inductance analogique et comprendre leurs rôles dans les circuits électriques. ",
								"sit": "Savoir utiliser à bon escient le type de composants selon le résultat recherché.\nReconnaitre les valeurs nominales des composants"
							},
							{
								"obj": "Aborder les bases de l'Electrostatique au travers de l’étude physique d’un condensateur",
								"sit": "Application à des formes simples de répartition de charges (linéique, surfacique ou volumique).\nEtude du condensateur plan, cylindrique ou sphérique.\nAssociation de plusieurs condensateurs : équivalence."
							},
							{
								"obj": "Introduire les notions de courants de charges électriques au travers de l’étude physique du conducteur ohmique ",
								"sit": "Application à des formes simples de conducteurs ohmiques (parallélépipédique, cylindrique, plan…).\nAssociation de plusieurs conducteurs : résistance équivalente
"
							},
							{
								"obj": "Présenter les fondements de la Magnétostatique en régime permanent ou faiblement variable au travers de l’étude physique d’une inductance.",
								"sit": "Appliquer les résultats à des cas simples de conducteurs (rectiligne, cylindrique, spire carrée ou circulaire, nappe de courant…).\nExpliquer le fonctionnement d’une bobine, d’un solénoïde;\nEtudier des systèmes électromécaniques simples tels que le haut-parleur, le moteur, le transformateur.
"
							}
						]
					}
				]
			},
			{
				"nom": "Formation humaine",
				"ratio": 28,
				"matières": [
					{
						"nom": "Projet de formation humaine : Lancement",
						"semestre": 1,
						"coeff": 2,
						"nb_heures": 21,
						"resume": "Lancer un projet de formation humaine (responsable et citoyen, ancré dans le réel et le possible, idéaliste, rationnel, humaniste). Lancer un projet d'étude, de recherche de l'information, documentaire ou de terrain autour d'un sujet imposé.",
						"contenu": "- Initiation à la conduite de projet (lancer, réaliser, transmettre)\n- Apprendre à formuler une problématique, à se donner des objectifs, à élaborer un plan de recherche...\n- Apprendre à analyser une situation (externe et interne)\n- Apprendre à réaliser une étude, à rechercher l'information\n- Rédiger un rapport\n- Organiser des réunions\n- Organiser un suivi, le partage de l'information",
						"objectifs/situations": [
							{
								"obj": "Lancer un projet",
								"sit": "Analyser un environnement : faire le diagnostic externe (opportunités/menaces) et interne (forces/faiblesses) d’une situation. Mener une étude de faisabilité.\nFormuler une problématique et se donner des objectifs pour la résoudre. Les objectifs doivent être Spécifiques, Mesurables, Ambitieux, Réalistes, Temporels (SMART).\nPlanifier : établir un plan d’actions (savoir différencier « actions » et « objectifs ») et un plan de financement (à partir de la deuxième année).\nSe donner des objectifs personnels de progression."
							}
						]
					},
					{
						"nom": "Techniques d’expression 1",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 27,
						"resume": "Les modules de techniques d’expression permettent d’acquérir et de développer les compétences de communication indispensables à tout ingénieur ;\nDe consolider la pratique de la langue française et découvrir des méthodes pour apprendre à rédiger, et à présenter oralement devant un public,
											 participer à des entretiens et animer des réunions.",
						"contenu": "- Langues et langages : donner à l'étudiant des outils pour qu'il évalue de lui même ses compétences en matière d'orthographe, de grammaire, de syntaxe... et lui permettre de s'améliorer ; lui apprendre à lire un texte et à le résumer ; approche de la synthèse de textes (articles de journaux...) et de documents.\n- Méthodologie : initier l'étudiant à la rédaction d'un rapport de recherche (technique,scientifique, de formation humaine...)\n- Créativité, connaissance et conceptualisation : permettre à l'étudiant d'explorer différentes manières d'écrire et de penser (exploration de savoirs non scientifiques, textes littéraires...) ; lui permettre de libérer et de maîtriser sa créativité par l'écriture (écriture de poèmes, de nouvelles...) ; lui permettre de conceptualiser et d'inventer à partir d'un contexte et d'un champs de connaissance (écrire à partir d'une thématique ; formuler une problématique et y répondre en rédigeant un document original, en créant une forme nouvelle...)...\n- Mise en relief des trois moyens d'expression orale : Expression physique ou attitude, expression vocale ou voix, expression verbale ou langage.\nA travers l'analyse de présentations individuelles, l'étudiant est invité à prendre conscience des 'vrais' et 'faux' le concernant dans le domaine de l’expression orale ainsi que de ses qualités et difficultés personnelles.\n- Quatre directions d'amélioration : Eclairer, Intéresser, s'Ouvrir, s'Affirmer\nProposition de quatre voies d'amélioration pour chacun des trois moyens d'expression. Mise en pratique à travers des exercices de créativité.\nEtablissement et utilisation de grilles d'analyse.",
						"objectifs/situations": [
							{
								"obj": "Présenter en groupe un sujet / projet",
								"sit": "Réalisation d’un plan de communication"
							},
							{
								"obj": "Adapter son discours à son public",
								"sit": "Simulations"
							},
							{
								"obj": "Identifier les clés et enjeux des différentes étapes d’une présentation",
								"sit": "Analyse de situations, débats"
							},
							{
								"obj": "Structurer sa prise de parole / présentation",
								"sit": "Mises en situation"
							},
							{
								"obj": "Découvrir des outils de créativité et de gestion de soi au service de la communication orale",
								"sit": "Exercices basés sur des techniques théâtrales"
							},
							{
								"obj": "(Se) Présenter individuellement et en groupe un sujet",
								"sit": "Rédaction d’un CV, lettre ou mail de motivation. Débat sur l’actualité."
							},
							{
								"obj": "Structurer sa présentation écrite",
								"sit": "Exercices grammaire et orthographe (pour être lisible). Exercices rédactionnels : Rédaction mail, rapport, plans détaillés."
							},
							{
								"obj": "Analyser un document / une présentation écrite",
								"sit": "Lecture d’un ouvrage littéraire et test de connaissance et de réflexion. Présentation et analyse d’article de presse à chaque séance."
							},
							{
								"obj": "Synthétiser des sujets",
								"sit": "Réduction et reformulation d’un texte."
							},
							{
								"obj": "Concevoir des supports de présentation",
								"sit": "Réalisation un power-point. Apprendre à titrer et à problématiser."
							}
						]
					},
					{
						"nom": "Anglais",
						"semestre": 1,
						"coeff": 2,
						"nb_heures": 21,
						"resume": "Introduction to methods of learning English and expectations within the framework of higher education, focusing on the tools and methods of autonomous lifelong language learning.\nReview and introduction of new notions regarding the English language (verb tenses, work on clear pronunciation,…). Giving students a first experience of public speaking in English.\nAcquisition of TOEIC language: Can easily recognize language structures and vocabulary frequently used in the TOEIC. ",
						"contenu": "Presentation of the different parts of the TOEIC.\nTest-taking strategies for the TOEIC\nWork on language of TOEIC\nPronunciation work on specific phonemes that are problematic for native speakers of French\nSystematic revision of grammatical structures that are problematic for native speakers of French\nPresentation and exploration of language-learning tools (learner’s dictionary, websites for language learners…)",
						"objectifs/situations": [
							{
								"obj": "Identify the different parts of the TOEIC and develop strategies for improving their performance in each section ",
								"sit": "Analysis of written and audio texts in class."
							},
							{
								"obj": "Recognise and use the language commonly found in the TOEIC",
								"sit": "In-class dictionary practice, exposure to periodicals, exercises developing learning reflexes"
							},
							{
								"obj": "Effectively use traditional tools as well as those afforded by NTIC (learner’s dictionaries, television series, websites dedicated to learning the English language) to improve and strengthen their mastery of the language, its structures, its pronunciation",
								"sit": "Recorded discrimination exercises, In-class preparation and recording of student production, with extensive teacher feedback."
							},
							{
								"obj": "Make themselves understood by those who do not speak French (clear, unambiguous pronunciation)",
								"sit": ""
							},
							{
								"obj": "Express themselves in written and oral English with a higher level of grammatical accuracy, with the aim of making themselves better understood",
								"sit": ""
							}
						]
					},
					{
						"nom": "LV2, FLE, anglais renforcé",
						"semestre": 1,
						"coeff": 0,
						"nb_heures": 15,
						"resume": "Langues : Allemand - Chinois - Espagnol - Japonais - Italien\n\n- Acquérir les compétences communicatives et interculturelles dans la langue choisie\n- Préparer des tests de niveau certifiants (TOEIC, Goethe Zertifikat, Cervantes, …)\n- Acquérir un niveau de maîtrise des structures grammaticales de la langue choisie permettant une communication simple mais non ambiguë",
						"contenu": "A la discrétion de l’enseignant. Peut inclure :\n- Etude de textes d’actualité\n- Ecoute d’enregistrements audiovisuels\n- Expression orale sur des sujets personnels ou professionnels\n- Expression écrite sur des sujets personnels ou professionnels\n- Exercices de grammaire\n- Apprentissage de vocabulaire\n- Présentation d’exposés\n- Expression interactive/ débats",
						"objectifs/situations": [
							{
								"obj": "Etre capable, à l’aide d’un dictionnaire, de comprendre des textes dans la langue cible.",
								"sit": "Lecture de textes authentiques dans la langue cible, que cela soit en classe ou à la maison. Des textes peuvent également être publiés sur le Moodle ou envoyés par une plateforme d'apprentissage en ligne. A la discrétion de l'enseignant, certaines de ces lectures peuvent être accompagnées d'une évaluation de compréhension donnant lieu à une note."
							},
							{
								"obj": "Etre capable, à l’aide d’un dictionnaire, d’écrire des textes compréhensibles dans la langue cible (email, CV, lettre de motivation...)",
								"sit": "Rédaction de textes dans la langue cible, dans la langue cible, que cela soit en classe ou à la maison. A la discrétion de l'enseignant, certaines de ces rédactions peuvent donner lieu à une note."
							},
							{
								"obj": "Etre capable de suivre une conversation ou un document audio-visuel bref, dans la langue cible.",
								"sit": "Ecoute de documents authentiques dans la langue cible, que cela soit en classe ou à la maison. Des textes peuvent également être publiés sur le Moodle ou envoyés par une plateforme d'apprentissage en ligne. A la discrétion de l'enseignant, certaines de ces documents audio ou audio-visuel peuvent être accompagnés d'une évaluation de compréhension donnant lieu à une note."
							},
							{
								"obj": "Etre capable de se faire comprendre dans la langue cible de façon non ambiguë",
								"sit": ""
							}
						]
					},
					{
						"nom": "APIC: Activité information-communication",
						"semestre": 1,
						"coeff": 1,
						"nb_heures": 4.5,
						"resume": "L’époque où l’ingénieur n’était qu’un très bon spécialiste technique est révolue. Désormais, pour réussir son parcours professionnel il doit également être un 'Homme de communication'.\n\nAu cours de votre vie étudiante et professionnelle, vous serez amené à exercer vos talents de communicant. Que ce soit pour valoriser un projet associatif, convaincre un jury, faire un exposé devant vos professeurs, décrocher un stage puis un emploi, mener à bien une mission professionnelle, etc.\n\nVous aurez besoin de communiquer et d’être capable:\n- De promouvoir une idée, une réalisation ou un produit ;\n- De travailler en équipe, d’argumenter, de négocier pour arriver à un accord ;\n- D’informer et convaincre de multiples interlocuteurs dont certains, étrangers à votre univers et sa technicité.\n\nL'APIC (Actions de Promotion Information et Communication) est un des modules vous permettant de mieux communiquer. Il se fixe un triple objectif.\n1. Donner une vision d’ensemble, à la fois théorique et fonctionnelle des aspects liés à la communication persuasive, interpersonnelle et stratégique : construire un message et le délivrer au bon moment, renforcer son argumentation et savoir l’adapter à ses interlocuteurs pour un démultiplier l’impact.\n2. Mettre en pratique les connaissances acquises afin de contribuer à la notoriété et à la réputation de l’école lors des manifestations organisées par le service communication.\n3. Aider par des conseils pratiques, à la valorisation des actions des différentes associations de l’école et des projets pédagogiques réalisés par les étudiants (scientifiques ou de formation humaine).",
						"contenu": "Notions abordées :\n- Approche théorique des techniques de communication.\n- Principes de base de la Programmation Neurolinguistique.\n- Modèle de la probabilité d’élaboration, pyramide de Maslow, théorie cognitiviste, les voies de la perception (émotionnelle et rationnelle).\n- Principes fondamentaux, méthodes et procédés de la rhétorique et de la communication persuasive : construction du discours rhétorique, facteurs qui augmentent la crédibilité, principes de formulation, lois de l’influence, etc.\n- La dimension non verbale de la communication : attitude, langage corporel et synchronisation.\n- Conseils pratiques et facteurs généraux intervenant dans les situations de communication d’un « esiearque ».\n\nEvaluation semestrielle : l’évaluation sera à la fois quantitative et qualitative (bonus/malus).\n- Assiduité et participation en cours (20%)\n- Actions de communication (80%)\n\nChaque étudiant devra réaliser au moins une action de communication par semestre au service de son école lui permettant de mettre en pratique les techniques et conseils donnés:\n- Présence au forum d’orientation de son lycée ou d’un lycée proche de son établissement ;\n- Intervention en classe dans un établissement scolaire pour présenter le métier d’ingénieur;\n- Participation aux journées portes ouvertes ou journées de concours ;\n- Participation active à l’un des salons ou l’école sera présente ;\n- Rédaction d’articles (correspondant communication), reportage photo ou vidéo, participation à la web team de l’école ;\n- Aide à l’organisation de tout événement engageant l’image de l’école organisé par la Direction de la Communication.",
						"objectifs/situations": []
					},
					{
						"nom": "Projet de formation humaine : Réalisation",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 21,
						"resume": "Réaliser son projet et présenter son travail de recherche sous la forme d'un rapport original, dans le cadre d'une soutenance devant un jury et dans le cadre du salon des projets de formation humaine.",
						"contenu": "Cette activité permet de développer sa curiosité, son sens critique, de s’entraîner aux méthodes du travail de groupe, de la prise de notes et du rapport écrit, d’acquérir de l’assurance dans des situations de prise de parole devant un public.",
						"objectifs/situations": [
							{
								"obj": "Réaliser un projet",
								"sit": "Agir sur une période déterminée (un an, deux ans…), dans une situation complexe, résoudre des problèmes : être proactif\nCommuniquer autour de son action (à l’écrit, à l’oral, en réunion…).\nEvaluer son action et mesurer l’atteinte de ses objectifs avec des indicateurs de performance adaptés et cohérents. Travailler en équipe. Porter la responsabilité d’une action collective. Exercer une responsabilité : responsable de projet, responsable de la logistique, responsable technique, responsable de la communication, responsable de la diffusion, responsable financier, responsable des partenariats, responsable de l’action internationale, responsable de l’action culturelle, responsable «Solidarités»"
							},
							{
								"obj": "Transmettre un projet",
								"sit": "Synthétiser ses résultats, faire le bilan de son action (par rapport aux objectifs souhaités au moment du lancement du projet).\nValoriser et transmettre son expérience (capitalisation des acquis d’apprentissage) : recruter d’éventuels repreneurs du projet, rédiger son C.V.,..."
							}
						]
					},
					{
						"nom": "Techniques d'expression 2",
						"semestre": 2,
						"coeff": 3,
						"nb_heures": 28.5,
						"resume": "Les modules de techniques d’expression vous permettront d’acquérir et de développer les compétences de communication indispensables à tout ingénieur.\nVous consoliderez la pratique de la langue française et vous découvrirez des méthodes pour apprendre à rédiger, et réussir vos présentations orales devant un public, pour participer à des entretiens et pour animer des réunions.\nInitiation aux techniques de base de la communication écrite, aussi bien dans la transmission - rédaction et conception de supports visuels - que dans la réception – lecture - de l'information.",
						"contenu": "Approches de la communication écrite\n- Autoportrait et CV\n- La lettre\n- Approche de l'écriture journalistique\n- Entraînement au rapport écrit\n- Techniques de rédaction de messages courts",
						"objectifs/situations": [
							{
								"obj": "Analyser un document / une présentation orale/écrite",
								"sit": "Exercices d’analyse en groupe ; Lecture d’un ouvrage littéraire et test de connaissance et de réflexion. Présentation et analyse d’article de presse."
							},
							{
								"obj": "Synthétiser des sujets à l’oral/à l’écrit",
								"sit": "Réaliser un clip publicitaire ; Rédaction d’une revue de presse ; Rédaction de résumés"
							},
							{
								"obj": "Réaliser des présentations originales et créatives",
								"sit": "Exercices s’appuyant sur des techniques d’improvisation, la musique, le cinéma … Réalisation d’une nouvelle, d’une vidéo, d’un « papier » radio."
							},
							{
								"obj": "S’entrainer à transmettre et recevoir des informations explicites",
								"sit": "Improvisation"
							},
							{
								"obj": "Argumenter ses propos / opinions",
								"sit": "Vivre et mener des débats contradictoires"
							},
							{
								"obj": "Présenter une expérience",
								"sit": "Présenter son rapport de PFH. Critique et mise en perspective d’articles."
							},
							{
								"obj": "Concevoir des supports de présentation type poster sur un sujet donné",
								"sit": "Réaliser une étude comparative (benchmark) ; Rédiger une synthèse ; Référencer ses sources\nRéaliser un schéma fonctionnel et technique\nRéaliser un poster technico-scientifique : Apprendre les règles de la PAO ; Décrypter l’information, l’analyser pour la synthétiser visuellement."
							}
						]
					},
					{
						"nom": "Anglais 2",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 21,
						"resume": "Providing students a cognitive model for the use of television series, films and other media to improve language competency. Introduction to and acquisition of the vocabulary surrounding the entertainment industry. Listening and reading practice: exposure to sophisticated texts containing rich, descriptive language and value judgments. Speaking and writing practice: expressing opinions, brief presentations. Pronunciation practice, recalling and strengthening notions seen in LAN1081AN.",
						"contenu": "Vocabulary of the entertainment industry: presentation and practice\nWork on extracts from films and television series\nReading film reviews or other texts from the print media\nPractice of speaking skills for explaining and describing generally and in detail.\nPractice of clear pronunciation\nPractice of writing skills for explaining and describing generally and in detail",
						"objectifs/situations": [
							{
								"obj": "Use media (TV series, film, etc.) to improve and strengthen their listening comprehension, their mastery of the language’s structures and pronunciation,in the aim of lifelong language learning",
								"sit": "Practice answering TOEIC questions in class, with teacher feedback"
							},
							{
								"obj": "Describe and discuss in clear unambiguous language",
								"sit": "Attentive listening to film dialogues or audio texts Reproduction of all aspects of speech production from texts"
							},
							{
								"obj": "Speak English in public with confidence",
								"sit": "Attentive listening to multiple sources. General comprehension exercises, Cloze passages."
							},
							{
								"obj": "Make themselves understood through clear, unambiguous pronunciation",
								"sit": ""
							},
							{
								"obj": "Work in English in a group towards a common aim",
								"sit": ""
							}
						]
					},
					{
						"nom": "APIC 2",
						"semestre": 2,
						"coeff": 1,
						"nb_heures": 4.5,
						"resume": "Suite ou approfondissement des notions abordées au premier semestre",
						"contenu": "",
						"objectifs/situations": []
					}
				]
			}
		]
	},
	{
		"année": 2,
		"blocs": [
			{
				"nom": "Mathématiques et informatique",
				"ratio": 39,
				"matières": [
					{
						"nom": "Transformations géométriques",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Courbes et surfaces",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Séries, approximation et probabilités",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Algorithmique et programmation",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Algorithmique avancée",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Mathématiques et cryptographie",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Travaux pratiques logiciel",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			},
			{
				"nom": "Physique, électronique et systèmes",
				"ratio": 31,
				"matières": [
					{
						"nom": "Électronique numérique",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Production, propagation et transmission des ondes et des signaux",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Systèmes",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Projet robotique et techniques numériques",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Projet Scientifique et Technique : réalisation",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			},
			{
				"nom": "Formation humaine",
				"ratio": 30,
				"matières": [
					{
						"nom": "Projet de formation humaine",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Techniques d’expression orales et écrites",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Projet Scientifique et Technique : définition du projet",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Projet professionnel",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Anglais",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "LV2, FLE, anglais renforcé",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Activité information-communication (APIC)",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			}
		]
	},
	{
		"année": 3,
		"blocs": [
			{
				"nom": "Mathématiques et informatique",
				"ratio": 38,
				"matières": [
					{
						"nom": "Probabilités, statistiques",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Algorithmique, calculabilité et complexité",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Génie logiciel + Projet",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Programmation orientée objet (POO) + Projet",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Programmation WEB et mobile",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Bases de Données + Travaux Pratiques",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Systèmes d’exploitation et réseaux IP",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Administration systèmes",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Introduction à la cybersécurité",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			},
			{
				"nom": "Physique, électronique et systèmes",
				"ratio": 34,
				"matières": [
					{
						"nom": "Signal déterministe et analyse de Fourier",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Traitement numérique du signal",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Architecture d’un système à microprocesseur",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Microprocesseur - périphériques et applications",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Gestion de processus par microcontrôleur",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Automatique",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Asservissement d’un moteur",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "De l’atome aux composants électroniques, physique quantique",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Physique et informatique quantique",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Projet Scientifique et Technique",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			},
			{
				"nom": "Formation humaine",
				"ratio": 28,
				"matières": [
					{
						"nom": "Projet de formation humaine",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Macro Économie et Économie industrielle",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Séminaire Projet professionnel",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Management de Projet",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Être et s’affirmer en relation",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Anglais",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "LV2, FLE, anglais renforcé",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Activité information-communication (APIC)",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			}
		]
	},
	{
		"année": 4,
		"blocs": [
			{
				"nom": "Tronc commun technique",
				"ratio": 0,
				"matières": [
					{
						"nom": "Estimation et analyse de données",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Optimisation numérique et combinatoire",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Réseaux IP",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Programmation système",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Réalité virtuelle",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Imagerie numérique",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Réseaux de neurones",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Cryptologie",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Projet Scientifique et Technique",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			},
			{
				"nom": "Filière systèmes embarqués",
				"ratio": 0,
				"matières": [
					{
						"nom": "Robotique",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "OS Temps réel",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Bus de terrain",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Communication sans fil",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Commande des systèmes",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Programmation VHDL et conception de composants programmables",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			},
			{
				"nom": "Filière systèmes d'information",
				"ratio": 0,
				"matières": [
					{
						"nom": "Programmation WEB avancée",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Programmation Mobile",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Système de Gestion de Bases de Données",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Datamining et applications",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Architecture logicielle",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Programmation distribuée",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Réseaux de neurones",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Introduction au reverse engineering",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			},
			{
				"nom": "Formation humaine et culture de l'entreprise",
				"ratio": 0,
				"matières": [
					{
						"nom": "Connaissance des entreprises",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Management de projets",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Projet Professionnel : Colloque",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Dynamique des relations",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Anglais",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "LV2, FLE, anglais renforcé",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			}
		]
	},
	{
		"année": 5,
		"blocs": [
			{
				"nom": "Majeure au choix",
				"ratio": 0,
				"matières": [
					{
						"nom": "Parcours cybersécurité",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Data science for solutions engineering",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Data science for solutions management",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Systèmes embarqués",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Architecture et Ingénierie du logiciel",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Cloud computing",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Réalité virtuelle et augmentée",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Véhicules autonomes",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			},
			{
				"nom": "Mineure technique au choix",
				"ratio": 0,
				"matières": [
					{
						"nom": "Parcours cybersécurité",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Images numériques",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Architecture Big Data",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Objets connectés",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Robotique & Systèmes autonomes",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Smart Cities - Maisons et villes intelligentes",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			},
			{
				"nom": "Mineure managériale au choix",
				"ratio": 0,
				"matières": [
					{
						"nom": "Parcours cybersécurité",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Systèmes d'information",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Digital consulting",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Techniques quantitatives de management",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Ingénieur d'affaires",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Création d'entreprise",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Management des systèmes d'informations bancaires",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Véhicules autonomes",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			}
		]
	}
]
