[
	{
		"année": 1,
		"blocs": [
			{
				"nom": "Mathématiques et informatique",
				"ratio": 40,
				"matières": [
					{
						"nom": "Algèbre générale",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 60,
						"repartition": [0, 27, 33, 0, 0, 0],
						"supports": ["doc_papier", "mathematica", "moodle"],
						"resume": "Apprendre à argumenter en s'appuyant sur un raisonnement logique formalisé. Introduire les opérations ensemblistes de base, les notions de relations binaires et d’applications entre ensembles. Introduire les concepts de base du dénombrement, de l’abalyse combinatoire et des probabilités discrètes. Pratiquer l’arithmétique dans l’ensemble des entiers relatifs et dans l’ensemble des polynômes à coefficients dans R ou dans C.",
						"contenu": "Raisonnements logiques, dénombrement, analyse combinatoire, lois discrètes usuelles.\n\nIntroduire les opérations ensemblistes de base, les notions de relation binaires, applications, arithmétique et polynômes.\n\n Des exemples concrets seront présentés pour illustrer et/ou modéliser certaines situations liées aux concepts présentés.",
						"objectifs/situations": [
							{
								"obj": "Défendre une argumentation en s'appuyant sur un raisonnement logique formalisé.\n\nIdentifier, reconnaître les différents raisonnements.\n\nConstruire un raisonnement mathématique en utilisant les quantificateurs.",
								"sit": "Traduire et reformuler par écrit des propositions à l'aide des quantificateurs et des connecteurs logiques.\n\nConstruire des démonstrations en choisissant le raisonnement adéquat"
							},
							{
								"obj": "Décrire et expliquer les concepts de base du dénombrement et de l’analyse combinatoire",
								"sit": "Faire le lien entre les propositions logiques, la théorie des ensembles et les principes du dénombrement : union, union disjointe, inclusion, ensemble fini, partition d’un ensemble"
							},
							{
								"obj": "Décrire et expliquer les concepts de base des probabilités",
								"sit": "Définir l’ensemble des résultats possibles d’une expérience aléatoire.\n\nDonner la définition d’un événement, d’un événement élémentaire, d’un événement contraire, d’un événement impossible, d’événements incompatibles, d’un système complet d’événements."
							},
							{
								"obj": "Décrire les lois discrètes usuelles, savoir reconnaître la loi à utiliser en fonction des données de l’énoncé",
								"sit": "Travailler sur des situations concrètes mettant en jeu les lois de probabilités discrètes usuelles."
							},
							{
								"obj": "Enumérer et expliquer les propriétés usuelles d'une relation binaire.",
								"sit": "Traduire les propriétés usuelles d'une relation binaire à l'aide de quantificateurs.\n\nDéterminer le graphe d'une relation binaire.\n\nReconnaître les propriétés d'une relation binaire à partir de son graphe.\n\nDémontrer qu'une relation binaire possède une propriété donnée.\n\nAppliquer les définitions sur des exemples concrets."
							},
							{
								"obj": "Décrire, énumérer et expliciter les propriétés usuelles d'une application, les mettre en œuvre sur des exemples simples, les représenter sur un graphe.",
								"sit": "Traduire les propriétés usuelles d'une relation à l'aide de quantificateurs.\n\nDémontrer qu'une application possède une propriété donnée.\n\nAppliquer les définitions sur des exemples concrets.\n\nReconnaître graphiquement une application injective, surjective et bijective.\n\nIllustrer graphiquement les notions d'application injective, surjective et bijective."
							},
							{
								"obj": "Décrire les notions liées à la division euclidienne dans Z.\n\nAlgorithme d'Euclide et ses applications Résoudre des équations à inconnues entières",
								"sit": ""
							},
							{
								"obj": "Décrire les notions liées à la division euclidienne dans K[X] où K=R ou K=C.",
								"sit": ""
							}
						]
					},
					{
						"nom": "Suites, fonctions d’une variable réelle et approximation",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 57,
						"repartition": [0, 27, 30, 0, 0, 0],
						"supports": ["doc_papier", "mathematica", "moodle"],
						"resume": "Introduire les outils mathématiques pour modéliser des phénomènes discrets ou continus.\n\nOn étudiera aussi quelques méthodes pour déterminer les solutions approchées d'équations et modéliseret résoudre certains problèmes d'optimisation",
						"contenu": "- Inégalités dans R et valeur absolue d'un réel\n\n- Ensembles majorés, minorés, bornés, majorant, minorant, bornes supérieures et inférieures, éléments minimal, maximal\n\n- Suites numériques: suites extraites, suites convergentes, suites divergentes, suites majorées,minorées, bornées, suites monotones\n\n- Propriétés des suites monotones\n\n- Comparaison des suites, théorème du “gendarme”\n\n- Suites adjacentes, fonctions monotones, périodiques, paires, majorées, minorées, bornées\n\n- Définition de la continuité, continuité à droite et à gauche, opérations sur les fonctions continues\n\n- Théorème de la valeur intermédiaire, continuité et monotonie\n\n- Dérivabilité opérations sur les fonctions dérivables\n\n- Extremum Local, théorèmes de Rolle et des accroissements finis\n\n- Application à des problèmes d'optimisation\n\n- Suites récurrentes, monotonie d'une suite récurrente, point fixe\n\n- Localisation des zéros d'une fonction: Méthode de la Dichotomie, Méthode de la Sécante et estimation de l'erreur",
						"objectifs/situations": [
							{
								"obj": "Déterminer et calculer des solutions approchées d'équations\n\nEstimer les erreurs d'approximation\n\nDifférencier les phénomènes discrets des phénomènes continus\n\nModéliser les phénomènes discrets et continus",
								"sit": "Résoudre des équations\n\nRésoudre des problèmes à l'aide de logiciels formels Mathematica (en binôme)"
							},
							{
								"obj": "Interpréter et illustrer géométriquement les énoncés mathématiques",
								"sit": "Illustrer à l'aide des logiciels formels (Mathematica) les concepts et résultats mathématiques (par binôme)"
							},
							{
								"obj": "Modéliser un problème d'optimisation et appliquer les techniques de recherche d'extrema",
								"sit": "Modéliser et résoudre des problèmes d'une seule variable"
							}
						]
					},
					{
						"nom": "Bases de l’informatique et de la programmation",
						"semestre": 1,
						"coeff": 5,
						"nb_heures": 72,
						"repartition": [0, 18, 18, 36, 0, 0],
						"supports": ["powerpoint", "doc_numerique", "moodle", "ordinateur"],
						"resume": "L’objectif de ce module est l’apprentissage des bases de la programmation en C ainsi que les bases de l’algorithmique. L’étudiant doit être capable à la fin du module de rédiger un algorithme simple de résolution à un problème afin de l’implémenter en langage C. Les étudiants sont encouragés à acquérir de l’autonomie afin d’aller chercher l'information nécessaire à la réalisation d'une des tâches précédentes si l'élève ne la connaît pas. Les messages d'erreurs du compilateur doivent être compris afin de les utiliser pour corriger un programme. Enfin, les étudiants doivent être capables de dérouler et corriger des algorithmes et programmes simples.",
						"contenu": "- Introduction au système Unix, ligne de commande.\n\n- Compilation sans Warning ni erreurs avec gcc, débogage avec gdb.\n\n- Types de base du C, représentation des données en machine, notions d’adresses et de pointeurs.\n\n- Structures de contrôle, fonctions, passages par valeur et par adresse.\n\n- Tableaux et matrices statiques et décalage d’adresse.\n\n- Algorithmes gloutons.\n\n- Algorithmes de tri quadratiques (bulles, insertion, sélection…)",
						"objectifs/situations": [
							{
								"obj": "Décrire l'architecture générale matérielle et logicielle (i.e. système d'exploitation) d'un ordinateur.",
								"sit": "Montage et démontage un ordinateur. Enumération des principaux composants et leur fonctionnalité. Maîtrise des commandes Unix usuelles. "
							},
							{
								"obj": "Concevoir, écrire, compiler et exécuter un programme C en environnement ligne de commandes.",
								"sit": "Utilisation d'un éditeur de code basique (gedit ou vi) et compilation en ligne de commandes via gcc.\n\nCompilation sans erreur ni warning exigée."
							},
							{
								"obj": "Concevoir des algorithmes élémentaires et évaluer leur complexité.",
								"sit": "Ecriture d’algorithmes simples en pseudo-code puis implémentation en langage C. Prévision de leur temps d’exécution puis mesure de ce dernier."
							},
							{
								"obj": "Maîtriser les types d’algorithmes basiques",
								"sit": "Déroulement et rédactions d’algorithmes gloutons et des algorithmes de tri quadratiques."
							},
							{
								"obj": "Maîtriser les types élémentaires de données en C.",
								"sit": "Choix du type, déclaration et affectation des variables. Connaissance des tailles des différents types de données."
							},
							{
								"obj": "Manipuler les pointeurs",
								"sit": "Description de l’état de la mémoire à la fin d’un programme C. Compréhension des notions d’adresses et de déréférencement."
							},
							{
								"obj": "Maîtriser les structures de contrôles en C (if/else, for, while …) et les fonctions.",
								"sit": "Association d’un diagramme de flux à une structure de contrôle. Manipulation des arguments de la ligne de commande (argc, argv) aux travers de fonctions, en maîtrisant les types de retour et les passages par adresse."
							},
							{
								"obj": "Manipuler les tableaux et les chaines de caractères.",
								"sit": "Déclaration, initialisation, manipulation et accès en lecture/écriture à des tableaux statiques et chaînes de caractères en C."
							},
							{
								"obj": "Déboguer et optimiser un code",
								"sit": "Analyse des erreurs d’exécution à l’aide de GDB. Mesure du temps d’exécution d’un programme."
							}
						]
					},
					{
						"nom": "Atelier de renforcement numérique",
						"semestre": 1,
						"coeff": 1,
						"nb_heures": 12,
						"repartition": [0, 0, 0, 12, 0, 0],
						"supports": ["doc_papier", "mathematica", "moodle"],
						"resume": "Ce module permet de renforcer les notions mathématiques de base et de développer l'agilité au calcul",
						"contenu": "Ce module permet de renforcer les notions mathématiques de base et de développer l'agilité au calcul",
						"objectifs/situations": [
							{
								"obj": "Réviser le calcul algébrique",
								"sit": "Factoriser une expression\n\nEncadrer une expression\n\nSigne d’un trinôme et signe d’une expression\n\nRésoudre une équation\n\nRésoudre une inéquation"
							},
							{
								"obj": "Réviser le calcul trigonométrique et applications géométriques",
								"sit": "Déterminer le Cosinus, le Sinus et la tangente d’un angle\n\nRésoudre des équations trigonométriques\n\nDéterminer la projection orthogonale d’un vecteur sur une droite"
							},
							{
								"obj": "Réviser le calcul dans C et application à linéarisation",
								"sit": "Déterminer le module et un argument d’un complexe\n\nDéterminer la forme algébrique et trigonométrique d’un complexe\n\nLinéariser une expression trigonométrique\n\nDéterminer une racine carrée d’un complexe\n\nRésoudre quelques équation en utilisant les racines nième d’un complexe"
							},
							{
								"obj": "Réviser le calcul de dérivée d’une fonction\n\nRappeler le calcul de primitive et calcul d’intégral de fonctions simples\n\nRésoudre une équation différentielle linéaire d’ordre 1 et d’ordre 2 à coefficients constants",
								"sit": ""
							}
						]
					},
					{
						"nom": "Algèbre linéaire",
						"semestre": 2,
						"coeff": 2.5,
						"nb_heures": 54,
						"repartition": [0, 27, 27, 0, 0, 0],
						"supports": ["doc_papier", "mathematica", "moodle"],
						"resume": "Le module vise à acquérir les notions élémentaires relatives à l'algèbre linéaire, qui interviennent dans un grand nombre de domaines : transformations géométriques, problèmes d’optimisation, résolution de systèmes linéaires, calculs statistiques, théorie des graphes, etc. Il importe de maîtriser parfaitement les notions matricielles, dont notamment le vocabulaire lié aux matrices remarquables, une bonne pratique du calcul matriciel, la sensibilisation à la noncommutativité du produit. La méthode du pivot de Gauss est un outil essentiel qui permet de répondre à de nombreuses questions : calcul du rang, du déterminant et de l’inverse d’une matrice ; résolution d’un système linéaire. La description algorithmique de la méthode ainsi que son utilisation sont un objectif incontournable du module ; on pourra également envisager sa programmation. Les notions élémentaires sur les espaces vectoriels réels doivent être connues : le cas de l’espace R^n est incontournable, mais on présentera également des espaces de polynômes, des espaces de suites et de fonctions, des espaces de matrices. La notion d’application linéaire doit être travaillée en lien avec sa représentation matricielle dans une base donnée. Dès que possible, on veillera à apporter une interprétation géométrique à chacune des notions abordées.",
						"contenu": "Calculs dans R^n : cas particuliers de R^2 et de R^3.\n\nNotion d'espace vectoriel réel : cas particulier de R^n.\n\nNotion de sous-espace vectoriel : cas particulier des sous-espaces vectoriels de R^n.\n\nÉquations cartésiennes et équations paramétriques d'un sous-espace vectoriel.\n\nFamilles de vecteurs : famille libre, famille liée, famille génératrice, base.\n\nCombinaison linéaire d'une famille de vecteurs, rang d'une famille de vecteurs.\n\nSous-espace vectoriel engendré par une famille de vecteurs, notation Vect.\n\nComposantes d'un vecteur dans une base donnée.\n\nDimension d'un espace vectoriel, dimension d'un sousespace vectoriel.\n\nOpérations sur les matrices : somme, multiplication externe, multiplication interne, puissances d'une matrice carrée, inverse d'une matrice carrée.\n\nDéterminant d'une matrice carrée : cas particulier des matrices d’ordre 2 et d’ordre 3.\n\nMéthode du pivot de Gauss : opérations élémentaires, aspect algorithmique, résolution de systèmes avec plusieurs seconds membres, calcul de l’inverse d’une matrice carrée.\n\nNotion de systèmes linéaires : systèmes homogènes et systèmes avec second membre, résolution par la méthode de substitution pour les systèmes simples\n\nÉtude de systèmes linéaires simples avec choix d'inconnues principales.\n\nInterprétation matricielle des systèmes linéaires.\n\nApplications linéaires entre deux espaces vectoriels réels : cas particulier des applications linéaires de R^p dans R^n.\n\nNoyau et image d'une application linéaire.\n\nThéorème du rang pour les applications linéaires.\n\nMatrice associée à une application linéaire dans des bases données.",
						"objectifs/situations": [
							{
								"obj": "Pratiquer le calcul vectoriel dans R^n et le calcul matriciel.",
								"sit": "Opérations sur les vecteurs et interprétation géométrique.\n\nOpérations sur les matrices.\n\nCalcul de l'inverse d'une matrice par la méthode de Gauss, lien avec l’informatique.\n\nÉtude de suites récurrentes linéaires (suite de Fibonacci) et de systèmes différentiels linéaires."
							},
							{
								"obj": "Déterminer des relations entre les vecteurs, déterminer les composantes d’un vecteur dans une base donnée.",
								"sit": "Résolution de systèmes linéaires"
							},
							{
								"obj": "Manipuler les sous-espaces vectoriels de R^n.",
								"sit": "Écrire un sous-espace vectoriel défini par un système linéaire homogène comme sous-espace vectoriel engendré.\n\nTrouver une famille génératrice d’un sous-espace vectoriel.\n\nTrouver une base d’un sous-espace vectoriel.\n\nSimplifier un système de générateurs."
							},
							{
								"obj": "Résoudre un système linéaire.",
								"sit": "Maîtriser la méthode du pivot de Gauss.\n\nOrganiser rationnellement les calculs permettant la résolution d’un système linéaire.\n\nUtiliser le théorème du rang et la forme de la solution d’un système linéaire."
							},
							{
								"obj": "Reconnaître une application linéaire, déterminer la matrice d’une application linéaire dans une base donnée.",
								"sit": "Déterminer la matrice associée à une application linéaire.\n\nEffectuer la composition de deux applications linéaires.\n\nDéterminer la dimension de l’image et la dimension du noyau d’une application linéaire."
							}
						]
					},
					{
						"nom": "Etude locale de fonctions et intégration",
						"semestre": 2,
						"coeff": 3,
						"nb_heures": 60,
						"repartition": [0, 27, 27, 6, 0, 0],
						"supports": ["doc_papier", "mathematica", "moodle"],
						"resume": "On introduit dans ce module les notions qui permettent l'étude locale d'une fonction et on décrit le concept de l'intégrale utilisé dans le calcul d'une aire.",
						"contenu": "On introduit dans ce module les notions qui permettent l'étude locale d'une fonction et on décrit le concept de l'intégrale utilisé dans le calcul d'une aire.",
						"objectifs/situations": [
							{
								"obj": "Etudier localement une fonction",
								"sit": "Déterminer le développement limité d'une fonction.\n\nCalculer des limites.\n\nEffectuer un calcul numérique approché à la main.\n\nEtudier la position relative d'une courbe et de sa tangente.\n\nDéterminer l'asymptote éventuelle de la courbe représentative d'une fonction."
							},
							{
								"obj": "Décrire le concept de l'intégrale.\n\nCalculer une intégrale/une primitive.",
								"sit": "Calculer une aire à l'aide d'une intégrale.\n\nInterpréter géométriquement une intégrale.\n\nCalculer une valeur approchée d'une intégrale par des méthodes numériques (rectangle, trapèze,...) et estimation de l'erreur"
							},
							{
								"obj": "Décrire les lois continues usuelles et connaître les paramètres usuels de position et de dispersion",
								"sit": "Travailler sur des situations concrètes mettant en jeu les lois de probabilités continues usuelles.
"
							}
						]
					},
					{
						"nom": "Atelier de renforcement numérique",
						"semestre": 2,
						"coeff": 1,
						"nb_heures": 12,
						"repartition": [0, 0, 0, 12, 0, 0],
						"supports": ["doc_papier", "mathematica"],
						"resume": "- Renforcer les notions de base\n\n- Développer l'agilité au calcul\n\n- Développer le bon sens",
						"contenu": "- Décomposition en éléments simples et application au calcul intégration\n\n- Intégration numérique: Méthodes de trapèzes et des rectangles",
						"objectifs/situations": [
							{
								"obj": "Définir la décomposition d’une fraction rationnelle en élément simples dans le cas où les pôles sont simples",
								"sit": "Déterminer les pôles d’une fraction rationnelle\n\nDécomposer en éléments simples une fraction rationnelle dans le cas où les pôles sont simples"
							},
							{
								"obj": "Définir la décomposition d’une fraction rationnelle en élément simples dans le cas général",
								"sit": "Décomposer un polynôme à coefficients réels en produits de polynômes irréductibles\n\nDécomposer en éléments simples une fraction rationnelle"
							},
							{
								"obj": "Calcul d’intégral et calcul de primitive de fraction rationnelle",
								"sit": "Utiliser la formule de changement de variables pour le calcul d’intégral et le calcul de primitive.\n\nCalculer une intégrale et calculer une primitive d’une fraction rationnelle"
							}
						]
					},
					{
						"nom": "Bases de l'algorithme et de la programmation 2",
						"semestre": 2,
						"coeff": 4.5,
						"nb_heures": 72,
						"repartition": [0, 18, 18, 36, 0, 0],
						"supports": ["powerpoint", "doc_numerique", "moodle", "ordinateur"],
						"resume": "L’objectif de ce module est d’approfondir les acquis du premier semestre concernant l’algorithmique et la programmation en C. L'accent est donc mis sur les méthodes de conception d'algorithmes ainsi que leurs implémentations plutôt que de présenter un catalogue d'algorithmes. On présente de nombreux exemples illustrant les méthodes suivantes: diviser pour régner, programmation dynamique ou encore récursivité. D'autres notions de langage C comme l'allocation dynamique de mémoire ou le traitement de fichiers sont également étudiées. Tous les algorithmes sont programmés par les étudiants en C. L'objectif est de rendre l'étudiant créatif devant un problème.",
						"contenu": "- Définition des parties d'un algorithme\n\n- Récursivité\n\n- Méthodes diviser pour régner\n\n- Programmation dynamique\n\n- Allocation dynamique de mémoire\n\n- Algorithmes : exponentiation rapide, tri rapide, problème du sac à dos\n\n- Langage C : structures, fichiers et représentation des données.",
						"objectifs/situations": [
							{
								"obj": "Comprendre et maîtriser la programmation récursive.",
								"sit": "Rédactions d’algorithmes courts manipulant tous les types de récursivité. Transformation d’un programme itératif en récursif et vice-versa"
							},
							{
								"obj": "Choisir le meilleur type d’allocation en fonction d’un problème donné.",
								"sit": "Rédaction de programmes manipulant l’allocation dynamique et statique. Decription de l’état de la mémoire à la fin de l’exécution d’un programme. Débogage à l’aide de Valgrind."
							},
							{
								"obj": "Optimiser un programme afin d’améliorer la performance.",
								"sit": "Simplification d’un code existant.\n\nAmélioration d’un code / algorithme fourni."
							},
							{
								"obj": "Structurer un code C et le rendre plus lisible.",
								"sit": "Manipulation des types structurés (struct, union, enum) et des redéfinitions de type."
							},
							{
								"obj": "Lire et écrire des données dans un fichier sur le disque.",
								"sit": "Manipulation des fonctions et structures de fichiers en C."
							},
							{
								"obj": "Représenter les variables de types entiers et flottants en mémoire.",
								"sit": "Conversion d’entiers et de décimaux d’une base à une autre (bases hexa, décimale, octale, binaire)."
							},
							{
								"obj": "Connaitre quelques algorithmes standards.",
								"sit": "Implémentation des algorithmes d’exponentiation rapide, de tri rapide, de problème du sac à dos …"
							},
							{
								"obj": "Choisir l’algorithme le plus adapté à un problème donné.",
								"sit": "Choix et mise en pratique d’un algorithme : tri, glouton ou de type diviser pour régner, répondant au mieux à un problème concret."
							}
						]
					},
					{
						"nom": "Introduction au langage Python",
						"semestre": 2,
						"coeff": 1,
						"nb_heures": 12,
						"repartition": [0, 3, 0, 9, 0, 0],
						"supports": [],
						"resume": "L’objectif de ce module est de poser les bases de la programmation en python.",
						"contenu": "",
						"objectifs/situations": []
					}
				]
			},
			{
				"nom": "Physique, électronique et systèmes",
				"ratio": 32,
				"matières": [
					{
						"nom": "Mécanique du point et trajectographie spatiale",
						"semestre": 1,
						"coeff": 4,
						"nb_heures": 48,
						"repartition": [48, 0, 0, 0, 0, 0],
						"supports": ["powerpoint", "doc_papier", "doc_numerique"],
						"resume": "Ce module présente les lois générales de la cinématique et de la dynamique du point matériel. Son objectif est d’établir et d’utiliser les principes fondamentaux nécessaires à la description des mouvements que nous observons autour de nous.\n\nPour chaque objectif d’apprentissage la méthodologie est toujours la même :\n\n- Mémoriser les nouvelles notions, les comprendre ensuite et les appliquer à bon escient.\n\n- Lister les hypothèses du problème après avoir lu l’énoncé.\n\n- Discriminer le problème posé entre un problème de cinématique du point et un problème de dynamique du point.\n\n- Reproduire la méthodologie de résolution d’exercice de physique appliqué à la cinématique du point ou à la dynamique du point.\n\n- Reconnaître puis identifier les pré-requis mathématiques utiles à la résolution analytiques des équations obtenues en utilisant les théorèmes fondamentaux de la mécanique.\n\n- Choisir l’outil adéquat et permis pour calculer numériquement le résultat ; calcul mental, calculatrice, Scilab.\n\n- Après la résolution interpréter et questionner les résultats obtenus.\n\n- Si besoin, estimer alors en justifiant les éventuelles erreurs commises lors de la résolution.\n\n- Prédire enfin le comportement futur du système.",
						"contenu": "Concept 1 : Se réperer dans l’espace\n\n	1. Repérage dans l’espace et Cinématique du point\n\n	2. Description du mouvement et référentiel\n\n	3. Application à l’étude de quelques mouvements particuliers\n\n	4. Changements de référentiels\n\n\nConcept 2 : Décrire et quantifier un mouvement\n\n	1. Définition des quantités cinématiques de base (position, vitesse et accelération).\n\n	2. Définition des différents types de mouvement ; savoir les calculer et les reconnaitre.\n\n\nConcept 3 : Utiliser l’approche énergétique pour le prévision d’un mouvement\n\n	1. Définition et interprétation des 3 différentes énergies.\n\n	2. Définition du travail et de la puissance.\n\n	3. Téorèmes fondamentaux : énergie cinétique, énergie mécanique.\n\n	4. Utilisation de l’énergie dans les problèmes de mécanique lorsque ces théorèmes facilitent les calculs qui pourraient aussi être faits grâce à l’approche dynamique dans les cas suivants:\n\n		a. mouvement sur la Terre,\n\n		b. la chute libre,\n\n		c. les mouvements oscillatoires,\n\n		d. les mouvements des satellites.\n\n\nConcept 4 : Relier les interactions mécaniques au déplacement\n\n	1. Principes et théorèmes de la dynamique du point\n\n	2. Référentiels galiléens et lois de Newton\n\n	3. Théorèmes fondamentaux : principe fondamental de la dynamique et changements de référentiels, quantité de mouvement, moment cinétique.\n\n	4. Utilisation du PFD avec tout type de forces classiques (poids,réaction du support, frottements dur et fluide, pseudo-forces, etc.) dans les cas suivants :\n\n		a. mouvement sur la Terre,\n\n		b. la chute libre en prenant en compte la rotation de la Terre.\n\n		c. les mouvements oscillatoires,\n\n			i. Oscillateur harmonique et oscillations libres : étude sans et avec amortissement du système masse-ressort et analogies électromécaniques.\n\n			ii. Oscillations forcées ou entretenues : exemple du système masse-ressort soumis à une excitation de forme sinusoïdale et analogies électro-mécaniques, phénomène de résonance.\n\n		d. Application à la trajectographie spatiale.\n\n			i. Etude du mouvement des astres, planètes, étoiles, comètes, fusées, satellites\n\n			ii. Exemple des trajectoires possibles d’un engin spatial lancé à partir de la Terre, vitesse de satellisation, vitesse de libération, changement d’orbite, état d’apesanteur.\n\n\nIl est aussi possible d’ordonner ce même contenu par thématique et non par concepts physiques, comme suit :\n\n	1. Le repérage dans l’espace et la cinématique.\n\n	2. La chute d’un corps.\n\n	3. Les mouvements oscillatoires.\n\n	4. La trajectographie spatiale.",
						"objectifs/situations": [
							{
								"obj": "Se repérer dans l’espace au travers des systèmes de coordonnées usuels et y traduire les caractéristiques cinématiques d’un point objet (vecteurs position, vitesse et accélération).",
								"sit": "Etude des éléments cinématiques d’un mouvement dans les bases usuelles de repérage (cartésienne, cylindrique, polaire et sphérique) au travers d’exemples simples de translation et/ou de rotation."
							},
							{
								"obj": "Modéliser le mouvement d’un objet ponctuel soumis à un ensemble d’interactions mécaniques à partir des lois de la Dynamique.",
								"sit": "Utilisation du Principe Fondamental de la Dynamique pour l’étude dynamique de systèmes mécaniques simples (chute libre d’un corps, chute dans un milieu visqueux, oscillations d’un pendule pensant ou d’un ressort harmonique, particules chargées dans un champ électromagnétique…)."
							},
							{
								"obj": "Interpréter le concept d’énergie (énergies cinématique, potentielle, mécanique) et appliquer la notion de conservation de l’énergie pour les systèmes isolés.",
								"sit": "Application de la conservation de l’énergie mécanique pour l’étude du mouvement des planètes autour du soleil ou des satellites terrestres autour de la Terre."
							}
						]
					},
					{
						"nom": "Base de l'électronique analogique",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 42,
						"repartition": [42, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "- Acquérir les notions de base en électronique analogique.\n\n- Savoir analyser un circuit électronique. Déterminer son rôle.",
						"contenu": "Chapitre 1: Les lois générales de l’électrocinétique\n\n	1. Grandeurs électriques - Loi d’ohm\n\n	2. Dipôle électrique\n\n	3. Lois de Kirchhoff\n\n	4. Théorèmes de Thévenin et de Norton\n\n	5. Principe de superposition\n\n	6. Théorème de Millman\n\n\n\nChapitre 2: Les diodes\n\n	1. La diode redresseuse et son utilisation\n\n	2. La diode Zener et son utilisation\n\n\n\nChapitre 3: Les transistors bipolaires\n\n	1. Structure du transistor\n\n	2. Fonctionnement de base du transistor\n\n	3. Caractéristiques et paramètres du transistor\n\n	4. Le Transistor comme amplificateur\n\n	5. Le transistor comme interrupteur\n\n	6. Circuits de polarisation du transistor\n\n	7. Amplificateurs bipolaires à faibles signaux\n\n	8. Amplificateurs de puissance",
						"objectifs/situations": [
							{
								"obj": "Enumérer et identifier les différents types de structures élémentaires analogiques d’un circuit (Identifier les composants de base, reconnaitre les différentes associations de composants)",
								"sit": "Identifier une structure à partir d’un schéma en évaluation individuelle"
							},
							{
								"obj": "Analyser et modéliser la fonction de transfert statique et dynamique d’un circuit analogique pour déterminer ses caractéristiques d’entrées et de sorties (Appliquer les lois fondamentales de l’électronique pour calculer des courants et des tensions dans des circuits électroniques constitués de composants analogiques passifs : redressement de tension, régulation, amplification par transistor bipolaire,….)",
								"sit": "Calculer les tensions et courants d’un circuit électrique en évaluation individuelle"
							}
						]
					},
					{
						"nom": "Mesures, composants électroniques et robotique",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 36,
						"repartition": [0, 0, 0, 27, 9, 0],
						"supports": [],
						"resume": "Ce module comporte deux parties distinctes :\n\n- Une initiation à la robotique basée sur le kit didactique LEGO Mindstorms\n\n- Des études, simulations et mesures sur les composants et montages électroniques de base.",
						"contenu": "TP d’initiation à la robotique\n\n- Imaginer et réaliser un robot répondant à un cahier des charges donné.\n\n- Travailler en groupe et dans un temps limité.\n\n\n\nTP mesure et composants électroniques\n\n- Prise en main des appareils de mesure du laboratoire (oscilloscope, générateur basse fréquence, multimètre)\n\n- Prise en main d'un logiciel de simulation de circuits électronique (type SPICE).\n\n- Application des théorèmes de THEVENIN, de NORTON et de MILLMAN.\n\n- Diode à jonction : Redressement et filtrage.\n\n- Diode Zener.\n\n- LED.\n\n- Transistor NPN et PNP.\n\n- Régulateur de tension linéaire intégré.",
						"objectifs/situations": [
							{
								"obj": "Expérimenter en un temps court les missions d’un ingénieur : Réalisation d’un produit répondant à un cahier des charges précis, travail en équipe, présentation du projet",
								"sit": "Participation au concours robotique en 1A : Concevoir en équipe un robot Lego Mindstorm répondant à un cahier des charges"
							},
							{
								"obj": "Analyser des montages utilisant des structure et composants d’électronique analogiques de base.",
								"sit": "Analyser et tester des structures élémentaires d’électrocinétique. Reconnaître les structures élémentaires sur un schéma électronique complet. Analyser et expliquer l’utilisation de chaque sousfonction. Mesurer les différents signaux et comparer les résultats."
							},
							{
								"obj": "Réaliser des montages utilisant des structure et composants d’électronique analogiques de base.",
								"sit": "Analyser et expliquer l’utilisation de chaque sousfonction."
							},
							{
								"obj": "Réaliser des montages utilisant des amplificateurs opérationnels. Analyser et concevoir des filtres analogiques.",
								"sit": "Mesurer les différents signaux et comparer les résultats."
							}
						]
					},
					{
						"nom": "Electronique analogique",
						"semestre": 2,
						"coeff": 3,
						"nb_heures": 36,
						"repartition": [36, 0, 0, 0, 0, 0],
						"supports": ["powerpoint", "doc_papier"],
						"resume": "- Maîtrise (analyse et conception) des montages à base d'amplificateurs linéaires intégrés)\n\n- Introduction à la représentation fréquentielle des systèmes (approche fonction de transfert)",
						"contenu": "Chapitre I. Amplificateur Linéaire Intégré\n\n	1. L’amplificateur Linéaire Intégré\n\n	2. Montages Linéaires\n\n	3. Montages Non Linéaires\n\n	4. Oscillateurs\n\nChapitre II. Le régime sinusoïdal\n\n	1. Notations complexes\n\n	2. Loi d’Ohm généralisée\n\nChapitre III. Fonction de transfert des circuits linéaires\n\n	1. Notion de filtrage\n\n	2. Fonction de transfert\n\n	3. Ordre d’un circuit\n\n	4. Fonction de transfert d’un circuit linéaire\n\n	5. Propriétés des fonctions de transfert\n\n	6. Nature des fonctions de transfert\n\n	7. Les diagrammes de Bode\n\nChapitre IV. Filtres analogiques\n\n	1. Filtre Passif du 1er ordre\n\n	2. Filtre Passif du 2nd ordre\n\n	3. Filtre Actif du 1er ordre\n\n	4. Filtre Atif du 2nd ordre",
						"objectifs/situations": [
							{
								"obj": "Analyser et concevoir des structures électroniques à base d’amplificateurs opérationnels.\n\nAnalyser et concevoir des filtres analogiques.",
								"sit": "Analyser et calculer des structures élémentaires à amplificateur opérationnel.\n\nReconnaitre les structures élémentaires sur un schéma électronique complet.\n\nAnalyser des filtres analogiques à partir de schéma ou diagrammes de Bode.\n\nDe concevoir des filtres analogiques à partir de cahier des charges."
							}
						]
					},
					{
						"nom": "Projet d'électronique analogique",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 27,
						"repartition": [0, 0, 0, 12, 15, 0],
						"supports": [],
						"resume": "Etude de l'amplificateur opérationnel (A.O.) et application des notions fondamentales des circuits électriques à la mesure des caractéristiques et à l'analyse des circuits utilisant des A.O. tels que amplificateur de tension, de courant, inverseur, non inverseur, suiveur, sommateur, intégrateur, dérivateur, filtre, comparateur, etc.",
						"contenu": "Partie projet : les élèves réalisent une carte électronique complète en partant du routage ( ex: amplificateur audio , electromyographe, ...)\n\n\n\nPartie TP : Amplificateur opérationnel\n\n- Etude des montages, suiveur de tension, sommateur et soustracteur.\n\n- Etude, du montage dérivateur (filtre passe haut du 1er ordre), du comparateur et du Trigger de Schmitt.\n\n- Etude, du montage intégrateur (filtre passe bas du 1er ordre), d'un multivibrateur astable et d'un générateur de signaux sinusoîdaux.",
						"objectifs/situations": [
							{
								"obj": "Analyser un schéma et produire une carte électronique architecturée autour de montages à amplificateurs opérationnels.",
								"sit": "Analyser et tester des structures élémentaires à amplificateur opérationnel.\n\nReconnaitre les structures élémentaires sur un schéma électronique complet.\n\nAnalyser et expliquer l’utilisation de chaque sousfonction.\n\nConstruire une carte électronique.\n\nMesurer les différents signaux et comparer les résultats."
							}
						]
					},
					{
						"nom": "Projet fil rouge",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 24,
						"repartition": [0, 0, 0, 0, 24, 0],
						"supports": [],
						"resume": "Ce module propose une mise en situation mobilisant les matières scientifiques (Mathématiques, Physique, Electronique, Informatique) dans le cadre d’une démarche projet",
						"contenu": "Le thème de l’année est « Lanceur de projectiles».\n\nLes étudiants par groupe, vont calculer, simuler, tester la trajectoire d'un projectile.\n\nIl réaliseront un montage permettant de tester leur modélisation.\n\nIls assisteront au lancer « grandeur nature » de leur réalisation lors d’un évènement organisé en mai.",
						"objectifs/situations": [
							{
								"obj": "Modéliser la trajectoire d'un projectile",
								"sit": "Mobiliser les connaissances de Physique et Mathématiques pour calculer et élaborer un modèle. Tester le modèle."
							},
							{
								"obj": "Réaliser un dispositif mécanique ou électronique permettant de lancer le projectile.",
								"sit": "Réalisation en laboratoire"
							},
							{
								"obj": "Travailler en équipe",
								"sit": "Mode projet"
							}
						]
					},
					{
						"nom": "Physique des composants électroniques de base",
						"semestre": 2,
						"coeff": 3,
						"nb_heures": 36,
						"repartition": [36, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "Ce module aborde les bases de l'Electromagnétisme en régime permanent (électrostatique et Magnétostatique) et en régime lentement variable (Induction électromagnétique) au travers de l’étude des composants analogiques de base de l’électronique que sont le condensateur, la résistance et l’inductance. L’accent est mis sur les phénomènes physiques – champ électrique, champ magnétique, effet Joule - dont ils sont le siège.\n\nPour chaque objectif d’apprentissage la méthodologie est toujours la même :\n\n- Mémoriser les nouvelles notions, les comprendre ensuite et les appliquer à bon escient.\n\n- Lister les hypothèses du problème après avoir lu l’énoncé.\n\n- Discriminer le problème posé entre un problème d’électrostatique et un problème de magnétostatique.\n\n- Reproduire la méthodologie de résolution d’exercice de physique appliqué à l’électrostatique ou à la magnétostatique.\n\n- Reconnaître puis identifier les prérequis mathématiques utiles à la résolution analytiques des équations obtenues en utilisant les théorèmes fondamentaux de l’électromagnétostatique.\n\n- Choisir l’outil adéquat et permis pour calculer numériquement le résultat ; calcul mental, calculatrice, Scilab.\n\n- Après la résolution interpréter et questionner les résultats obtenus.\n\n- Si besoin, estimer alors en justifiant les éventuelles erreurs commises lors de la résolution.\n\n- Prédire enfin le comportement futur du système.",
						"contenu": "Thème 1. Le condensateur\n\n	1. Étude pratique d’un condensateur.\n\n	2. Principe et comportement d’un condensateur dans un circuit électrique.\n\n	3. Caractéristiques et technologie des condensateurs.\n\n	4. Étude théorique d’un condensateur.\n\n	5. Calcul du champ électrostatique par calcul direct et théorème de Gauss.\n\n	6. Calcul du potentiel par les opérateurs et énergie électrostatique.\n\n	7. Conducteurs en équilibre électrostatique.\n\n	8. Condensateurs.\n\n	9. Applications à d’autres distributions.\n\n	10. Approfondissement: le dipôle électrostatique\n\n	11. Potentiel et champ créés à grande distance par un dipôle.\n\n	12. Action d'un champ électrostatique extérieur sur un dipôle.\n\n	13. Approximation dipolaire du potentiel.\n\n\n\nThème 2. La résistance\n\n	1. Étude pratique d’une résistance.\n\n	2. Principe et comportement d’une résistance dans un circuit électrique.\n\n	3. Caractéristiques et technologie des résistances.\n\n	4. Etude théorique de la résistance.\n\n	5. Caractérisation d’un courant électrique.\n\n	6. Loi d'Ohm. Résistivité.\n\n	7. Applications.\n\n\n\nThème 3. L’inductance\n\n	1. Étude pratique d’une inductance.\n\n	2. Principe et comportement d’une inductance dans un circuit électrique.\n\n	3. Caractéristiques et technologie des inductances.\n\n	4. Étude théorique d’une inductance.\n\n	5. Champ magnétostatique.\n\n	6. Electrodynamique des régimes stationnaires.\n\n	7. Phénomène d'induction électromagnétique.\n\n	8. Énergie potentielle magnétostatique d'un système de courant.\n\n	9. Applications (systèmes électromécaniques : hautparleur, moteur, transformateur).\n\n	10. Approfondissement en magnétostatique : le dipôle magnétique.\n\n	11. Définition du moment magnétique d’un circuit.\n\n	12. Couple agissant sur le circuit sous l’action d’un champ extérieur B:\n\n		a. Énergie potentielle du dipôle dans un champ extérieur B\n\n		b. Champ d’un dipôle magnétique",
						"objectifs/situations": [
							{
								"obj": "Différentier les composants analogiques de base de l’Electronique que sont le condensateur, le conducteur ohmique et l’inductance analogique et comprendre leurs rôles dans les circuits électriques. ",
								"sit": "Savoir utiliser à bon escient le type de composants selon le résultat recherché.\n\nReconnaitre les valeurs nominales des composants"
							},
							{
								"obj": "Aborder les bases de l'Electrostatique au travers de l’étude physique d’un condensateur",
								"sit": "Application à des formes simples de répartition de charges (linéique, surfacique ou volumique).\n\nEtude du condensateur plan, cylindrique ou sphérique.\n\nAssociation de plusieurs condensateurs : équivalence."
							},
							{
								"obj": "Introduire les notions de courants de charges électriques au travers de l’étude physique du conducteur ohmique ",
								"sit": "Application à des formes simples de conducteurs ohmiques (parallélépipédique, cylindrique, plan…).\n\nAssociation de plusieurs conducteurs : résistance équivalente
"
							},
							{
								"obj": "Présenter les fondements de la Magnétostatique en régime permanent ou faiblement variable au travers de l’étude physique d’une inductance.",
								"sit": "Appliquer les résultats à des cas simples de conducteurs (rectiligne, cylindrique, spire carrée ou circulaire, nappe de courant…).\n\nExpliquer le fonctionnement d’une bobine, d’un solénoïde;\n\nEtudier des systèmes électromécaniques simples tels que le haut-parleur, le moteur, le transformateur.
"
							}
						]
					}
				]
			},
			{
				"nom": "Formation humaine",
				"ratio": 28,
				"matières": [
					{
						"nom": "Projet de formation humaine : Lancement",
						"semestre": 1,
						"coeff": 2,
						"nb_heures": 21,
						"repartition": [0, 0, 6, 0, 15, 0],
						"supports": ["doc_papier"],
						"resume": "Lancer un projet de formation humaine (responsable et citoyen, ancré dans le réel et le possible, idéaliste, rationnel, humaniste). Lancer un projet d'étude, de recherche de l'information, documentaire ou de terrain autour d'un sujet imposé.",
						"contenu": "- Initiation à la conduite de projet (lancer, réaliser, transmettre)\n\n- Apprendre à formuler une problématique, à se donner des objectifs, à élaborer un plan de recherche...\n\n- Apprendre à analyser une situation (externe et interne)\n\n- Apprendre à réaliser une étude, à rechercher l'information\n\n- Rédiger un rapport\n\n- Organiser des réunions\n\n- Organiser un suivi, le partage de l'information",
						"objectifs/situations": [
							{
								"obj": "Lancer un projet",
								"sit": "Analyser un environnement : faire le diagnostic externe (opportunités/menaces) et interne (forces/faiblesses) d’une situation. Mener une étude de faisabilité.\n\nFormuler une problématique et se donner des objectifs pour la résoudre. Les objectifs doivent être Spécifiques, Mesurables, Ambitieux, Réalistes, Temporels (SMART).\n\nPlanifier : établir un plan d’actions (savoir différencier « actions » et « objectifs ») et un plan de financement (à partir de la deuxième année).\n\nSe donner des objectifs personnels de progression."
							}
						]
					},
					{
						"nom": "Techniques d’expression 1",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 27,
						"repartition": [0, 0, 27, 0, 0, 0],
						"supports": [],
						"resume": "Les modules de techniques d’expression permettent d’acquérir et de développer les compétences de communication indispensables à tout ingénieur ;\n\nDe consolider la pratique de la langue française et découvrir des méthodes pour apprendre à rédiger, et à présenter oralement devant un public, participer à des entretiens et animer des réunions.",
						"contenu": "- Langues et langages : donner à l'étudiant des outils pour qu'il évalue de lui même ses compétences en matière d'orthographe, de grammaire, de syntaxe... et lui permettre de s'améliorer ; lui apprendre à lire un texte et à le résumer ; approche de la synthèse de textes (articles de journaux...) et de documents.\n\n- Méthodologie : initier l'étudiant à la rédaction d'un rapport de recherche (technique,scientifique, de formation humaine...)\n\n- Créativité, connaissance et conceptualisation : permettre à l'étudiant d'explorer différentes manières d'écrire et de penser (exploration de savoirs non scientifiques, textes littéraires...) ; lui permettre de libérer et de maîtriser sa créativité par l'écriture (écriture de poèmes, de nouvelles...) ; lui permettre de conceptualiser et d'inventer à partir d'un contexte et d'un champs de connaissance (écrire à partir d'une thématique ; formuler une problématique et y répondre en rédigeant un document original, en créant une forme nouvelle...)...\n\n- Mise en relief des trois moyens d'expression orale : Expression physique ou attitude, expression vocale ou voix, expression verbale ou langage.\n\nA travers l'analyse de présentations individuelles, l'étudiant est invité à prendre conscience des 'vrais' et 'faux' le concernant dans le domaine de l’expression orale ainsi que de ses qualités et difficultés personnelles.\n\n- Quatre directions d'amélioration : Eclairer, Intéresser, s'Ouvrir, s'Affirmer\n\nProposition de quatre voies d'amélioration pour chacun des trois moyens d'expression. Mise en pratique à travers des exercices de créativité.\n\nEtablissement et utilisation de grilles d'analyse.",
						"objectifs/situations": [
							{
								"obj": "Présenter en groupe un sujet / projet",
								"sit": "Réalisation d’un plan de communication"
							},
							{
								"obj": "Adapter son discours à son public",
								"sit": "Simulations"
							},
							{
								"obj": "Identifier les clés et enjeux des différentes étapes d’une présentation",
								"sit": "Analyse de situations, débats"
							},
							{
								"obj": "Structurer sa prise de parole / présentation",
								"sit": "Mises en situation"
							},
							{
								"obj": "Découvrir des outils de créativité et de gestion de soi au service de la communication orale",
								"sit": "Exercices basés sur des techniques théâtrales"
							},
							{
								"obj": "(Se) Présenter individuellement et en groupe un sujet",
								"sit": "Rédaction d’un CV, lettre ou mail de motivation. Débat sur l’actualité."
							},
							{
								"obj": "Structurer sa présentation écrite",
								"sit": "Exercices grammaire et orthographe (pour être lisible). Exercices rédactionnels : Rédaction mail, rapport, plans détaillés."
							},
							{
								"obj": "Analyser un document / une présentation écrite",
								"sit": "Lecture d’un ouvrage littéraire et test de connaissance et de réflexion. Présentation et analyse d’article de presse à chaque séance."
							},
							{
								"obj": "Synthétiser des sujets",
								"sit": "Réduction et reformulation d’un texte."
							},
							{
								"obj": "Concevoir des supports de présentation",
								"sit": "Réalisation un power-point. Apprendre à titrer et à problématiser."
							}
						]
					},
					{
						"nom": "Anglais",
						"semestre": 1,
						"coeff": 2,
						"nb_heures": 21,
						"repartition": [0, 0, 21, 0, 0, 0],
						"supports": ["doc_papier", "powerpoint", "audio", "video", "web", "ordinateur"],
						"resume": "Introduction to methods of learning English and expectations within the framework of higher education, focusing on the tools and methods of autonomous lifelong language learning.\n\nReview and introduction of new notions regarding the English language (verb tenses, work on clear pronunciation,…). Giving students a first experience of public speaking in English.\n\nAcquisition of TOEIC language: Can easily recognize language structures and vocabulary frequently used in the TOEIC. ",
						"contenu": "Presentation of the different parts of the TOEIC.\n\nTest-taking strategies for the TOEIC\n\nWork on language of TOEIC\n\nPronunciation work on specific phonemes that are problematic for native speakers of French\n\nSystematic revision of grammatical structures that are problematic for native speakers of French\n\nPresentation and exploration of language-learning tools (learner’s dictionary, websites for language learners…)",
						"objectifs/situations": [
							{
								"obj": "Identify the different parts of the TOEIC and develop strategies for improving their performance in each section ",
								"sit": "Analysis of written and audio texts in class."
							},
							{
								"obj": "Recognise and use the language commonly found in the TOEIC",
								"sit": "In-class dictionary practice, exposure to periodicals, exercises developing learning reflexes"
							},
							{
								"obj": "Effectively use traditional tools as well as those afforded by NTIC (learner’s dictionaries, television series, websites dedicated to learning the English language) to improve and strengthen their mastery of the language, its structures, its pronunciation",
								"sit": "Recorded discrimination exercises, In-class preparation and recording of student production, with extensive teacher feedback."
							},
							{
								"obj": "Make themselves understood by those who do not speak French (clear, unambiguous pronunciation)",
								"sit": ""
							},
							{
								"obj": "Express themselves in written and oral English with a higher level of grammatical accuracy, with the aim of making themselves better understood",
								"sit": ""
							}
						]
					},
					{
						"nom": "LV2, FLE, anglais renforcé",
						"semestre": 1,
						"coeff": 0,
						"nb_heures": 15,
						"repartition": [0, 0, 15, 0, 0, 0],
						"supports": ["doc_papier", "powerpoint", "audio", "video", "web", "ordinateur"],
						"resume": "Langues : Allemand - Chinois - Espagnol - Japonais - Italien\n\n- Acquérir les compétences communicatives et interculturelles dans la langue choisie\n\n- Préparer des tests de niveau certifiants (TOEIC, Goethe Zertifikat, Cervantes, …)\n\n- Acquérir un niveau de maîtrise des structures grammaticales de la langue choisie permettant une communication simple mais non ambiguë",
						"contenu": "A la discrétion de l’enseignant. Peut inclure :\n\n- Etude de textes d’actualité\n\n- Ecoute d’enregistrements audiovisuels\n\n- Expression orale sur des sujets personnels ou professionnels\n\n- Expression écrite sur des sujets personnels ou professionnels\n\n- Exercices de grammaire\n\n- Apprentissage de vocabulaire\n\n- Présentation d’exposés\n\n- Expression interactive/ débats",
						"objectifs/situations": [
							{
								"obj": "Etre capable, à l’aide d’un dictionnaire, de comprendre des textes dans la langue cible.",
								"sit": "Lecture de textes authentiques dans la langue cible, que cela soit en classe ou à la maison. Des textes peuvent également être publiés sur le Moodle ou envoyés par une plateforme d'apprentissage en ligne. A la discrétion de l'enseignant, certaines de ces lectures peuvent être accompagnées d'une évaluation de compréhension donnant lieu à une note."
							},
							{
								"obj": "Etre capable, à l’aide d’un dictionnaire, d’écrire des textes compréhensibles dans la langue cible (email, CV, lettre de motivation...)",
								"sit": "Rédaction de textes dans la langue cible, dans la langue cible, que cela soit en classe ou à la maison. A la discrétion de l'enseignant, certaines de ces rédactions peuvent donner lieu à une note."
							},
							{
								"obj": "Etre capable de suivre une conversation ou un document audio-visuel bref, dans la langue cible.",
								"sit": "Ecoute de documents authentiques dans la langue cible, que cela soit en classe ou à la maison. Des textes peuvent également être publiés sur le Moodle ou envoyés par une plateforme d'apprentissage en ligne. A la discrétion de l'enseignant, certaines de ces documents audio ou audio-visuel peuvent être accompagnés d'une évaluation de compréhension donnant lieu à une note."
							},
							{
								"obj": "Etre capable de se faire comprendre dans la langue cible de façon non ambiguë",
								"sit": ""
							}
						]
					},
					{
						"nom": "Activité information-communication : APIC",
						"semestre": 1,
						"coeff": 1,
						"nb_heures": 4.5,
						"repartition": [0, 4.5, 0, 0, 0, 0],
						"supports": [],
						"resume": "L’époque où l’ingénieur n’était qu’un très bon spécialiste technique est révolue. Désormais, pour réussir son parcours professionnel il doit également être un 'Homme de communication'.\n\n\n\nAu cours de votre vie étudiante et professionnelle, vous serez amené à exercer vos talents de communicant. Que ce soit pour valoriser un projet associatif, convaincre un jury, faire un exposé devant vos professeurs, décrocher un stage puis un emploi, mener à bien une mission professionnelle, etc.\n\n\n\nVous aurez besoin de communiquer et d’être capable:\n\n- De promouvoir une idée, une réalisation ou un produit ;\n\n- De travailler en équipe, d’argumenter, de négocier pour arriver à un accord ;\n\n- D’informer et convaincre de multiples interlocuteurs dont certains, étrangers à votre univers et sa technicité.\n\n\n\nL'APIC (Actions de Promotion Information et Communication) est un des modules vous permettant de mieux communiquer. Il se fixe un triple objectif.\n\n1. Donner une vision d’ensemble, à la fois théorique et fonctionnelle des aspects liés à la communication persuasive, interpersonnelle et stratégique : construire un message et le délivrer au bon moment, renforcer son argumentation et savoir l’adapter à ses interlocuteurs pour un démultiplier l’impact.\n\n2. Mettre en pratique les connaissances acquises afin de contribuer à la notoriété et à la réputation de l’école lors des manifestations organisées par le service communication.\n\n3. Aider par des conseils pratiques, à la valorisation des actions des différentes associations de l’école et des projets pédagogiques réalisés par les étudiants (scientifiques ou de formation humaine).",
						"contenu": "Notions abordées :\n\n- Approche théorique des techniques de communication.\n\n- Principes de base de la Programmation Neurolinguistique.\n\n- Modèle de la probabilité d’élaboration, pyramide de Maslow, théorie cognitiviste, les voies de la perception (émotionnelle et rationnelle).\n\n- Principes fondamentaux, méthodes et procédés de la rhétorique et de la communication persuasive : construction du discours rhétorique, facteurs qui augmentent la crédibilité, principes de formulation, lois de l’influence, etc.\n\n- La dimension non verbale de la communication : attitude, langage corporel et synchronisation.\n\n- Conseils pratiques et facteurs généraux intervenant dans les situations de communication d’un « esiearque ».\n\n\n\nEvaluation semestrielle : l’évaluation sera à la fois quantitative et qualitative (bonus/malus).\n\n- Assiduité et participation en cours (20%)\n\n- Actions de communication (80%)\n\n\n\nChaque étudiant devra réaliser au moins une action de communication par semestre au service de son école lui permettant de mettre en pratique les techniques et conseils donnés:\n\n- Présence au forum d’orientation de son lycée ou d’un lycée proche de son établissement ;\n\n- Intervention en classe dans un établissement scolaire pour présenter le métier d’ingénieur;\n\n- Participation aux journées portes ouvertes ou journées de concours ;\n\n- Participation active à l’un des salons ou l’école sera présente ;\n\n- Rédaction d’articles (correspondant communication), reportage photo ou vidéo, participation à la web team de l’école ;\n\n- Aide à l’organisation de tout événement engageant l’image de l’école organisé par la Direction de la Communication.",
						"objectifs/situations": []
					},
					{
						"nom": "Projet de formation humaine : Réalisation",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 21,
						"repartition": [0, 0, 0, 0, 21, 0],
						"supports": [],
						"resume": "Réaliser son projet et présenter son travail de recherche sous la forme d'un rapport original, dans le cadre d'une soutenance devant un jury et dans le cadre du salon des projets de formation humaine.",
						"contenu": "Cette activité permet de développer sa curiosité, son sens critique, de s’entraîner aux méthodes du travail de groupe, de la prise de notes et du rapport écrit, d’acquérir de l’assurance dans des situations de prise de parole devant un public.",
						"objectifs/situations": [
							{
								"obj": "Réaliser un projet",
								"sit": "Agir sur une période déterminée (un an, deux ans…), dans une situation complexe, résoudre des problèmes : être proactif\n\nCommuniquer autour de son action (à l’écrit, à l’oral, en réunion…).\n\nEvaluer son action et mesurer l’atteinte de ses objectifs avec des indicateurs de performance adaptés et cohérents. Travailler en équipe. Porter la responsabilité d’une action collective. Exercer une responsabilité : responsable de projet, responsable de la logistique, responsable technique, responsable de la communication, responsable de la diffusion, responsable financier, responsable des partenariats, responsable de l’action internationale, responsable de l’action culturelle, responsable «Solidarités»"
							},
							{
								"obj": "Transmettre un projet",
								"sit": "Synthétiser ses résultats, faire le bilan de son action (par rapport aux objectifs souhaités au moment du lancement du projet).\n\nValoriser et transmettre son expérience (capitalisation des acquis d’apprentissage) : recruter d’éventuels repreneurs du projet, rédiger son C.V.,..."
							}
						]
					},
					{
						"nom": "Techniques d'expression",
						"semestre": 2,
						"coeff": 3,
						"nb_heures": 28.5,
						"repartition": [0, 0, 28.5, 0, 0, 0],
						"supports": [],
						"resume": "Les modules de techniques d’expression vous permettront d’acquérir et de développer les compétences de communication indispensables à tout ingénieur.\n\nVous consoliderez la pratique de la langue française et vous découvrirez des méthodes pour apprendre à rédiger, et réussir vos présentations orales devant un public, pour participer à des entretiens et pour animer des réunions.\n\nInitiation aux techniques de base de la communication écrite, aussi bien dans la transmission - rédaction et conception de supports visuels - que dans la réception – lecture - de l'information.",
						"contenu": "Approches de la communication écrite\n\n- Autoportrait et CV\n\n- La lettre\n\n- Approche de l'écriture journalistique\n\n- Entraînement au rapport écrit\n\n- Techniques de rédaction de messages courts",
						"objectifs/situations": [
							{
								"obj": "Analyser un document / une présentation orale/écrite",
								"sit": "Exercices d’analyse en groupe ; Lecture d’un ouvrage littéraire et test de connaissance et de réflexion. Présentation et analyse d’article de presse."
							},
							{
								"obj": "Synthétiser des sujets à l’oral/à l’écrit",
								"sit": "Réaliser un clip publicitaire ; Rédaction d’une revue de presse ; Rédaction de résumés"
							},
							{
								"obj": "Réaliser des présentations originales et créatives",
								"sit": "Exercices s’appuyant sur des techniques d’improvisation, la musique, le cinéma … Réalisation d’une nouvelle, d’une vidéo, d’un « papier » radio."
							},
							{
								"obj": "S’entrainer à transmettre et recevoir des informations explicites",
								"sit": "Improvisation"
							},
							{
								"obj": "Argumenter ses propos / opinions",
								"sit": "Vivre et mener des débats contradictoires"
							},
							{
								"obj": "Présenter une expérience",
								"sit": "Présenter son rapport de PFH. Critique et mise en perspective d’articles."
							},
							{
								"obj": "Concevoir des supports de présentation type poster sur un sujet donné",
								"sit": "Réaliser une étude comparative (benchmark) ; Rédiger une synthèse ; Référencer ses sources\n\nRéaliser un schéma fonctionnel et technique\n\nRéaliser un poster technico-scientifique : Apprendre les règles de la PAO ; Décrypter l’information, l’analyser pour la synthétiser visuellement."
							}
						]
					},
					{
						"nom": "Anglais",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 21,
						"repartition": [0, 0, 21, 0, 0, 0],
						"supports": ["doc_papier", "powerpoint", "audio", "video", "web", "ordinateur"],
						"resume": "Providing students a cognitive model for the use of television series, films and other media to improve language competency. Introduction to and acquisition of the vocabulary surrounding the entertainment industry. Listening and reading practice: exposure to sophisticated texts containing rich, descriptive language and value judgments. Speaking and writing practice: expressing opinions, brief presentations. Pronunciation practice, recalling and strengthening notions seen in LAN1081AN.",
						"contenu": "Vocabulary of the entertainment industry: presentation and practice\n\nWork on extracts from films and television series\n\nReading film reviews or other texts from the print media\n\nPractice of speaking skills for explaining and describing generally and in detail.\n\nPractice of clear pronunciation\n\nPractice of writing skills for explaining and describing generally and in detail",
						"objectifs/situations": [
							{
								"obj": "Use media (TV series, film, etc.) to improve and strengthen their listening comprehension, their mastery of the language’s structures and pronunciation,in the aim of lifelong language learning",
								"sit": "Practice answering TOEIC questions in class, with teacher feedback"
							},
							{
								"obj": "Describe and discuss in clear unambiguous language",
								"sit": "Attentive listening to film dialogues or audio texts Reproduction of all aspects of speech production from texts"
							},
							{
								"obj": "Speak English in public with confidence",
								"sit": "Attentive listening to multiple sources. General comprehension exercises, Cloze passages."
							},
							{
								"obj": "Make themselves understood through clear, unambiguous pronunciation",
								"sit": ""
							},
							{
								"obj": "Work in English in a group towards a common aim",
								"sit": ""
							}
						]
					},
					{
						"nom": "LV2, FLE, anglais renforcé",
						"semestre": 2,
						"coeff": 0,
						"nb_heures": 15,
						"repartition": [0, 0, 15, 0, 0, 0],
						"supports": ["doc_papier", "powerpoint", "audio", "video", "web", "ordinateur"],
						"resume": "Langues : Allemand - Chinois - Espagnol - Japonais - Italien\n\n- Acquérir les compétences communicatives et interculturelles dans la langue choisie\n\n- Préparer des tests de niveau certifiants (TOEIC, Goethe Zertifikat, Cervantes, …)\n\n- Acquérir un niveau de maîtrise des structures grammaticales de la langue choisie permettant une communication simple mais non ambiguë",
						"contenu": "A la discrétion de l’enseignant. Peut inclure :\n\n- Etude de textes d’actualité\n\n- Ecoute d’enregistrements audiovisuels\n\n- Expression orale sur des sujets personnels ou professionnels\n\n- Expression écrite sur des sujets personnels ou professionnels\n\n- Exercices de grammaire\n\n- Apprentissage de vocabulaire\n\n- Présentation d’exposés\n\n- Expression interactive/ débats",
						"objectifs/situations": [
							{
								"obj": "Etre capable, à l’aide d’un dictionnaire, de comprendre des textes dans la langue cible.",
								"sit": "Lecture de textes authentiques dans la langue cible, que cela soit en classe ou à la maison. Des textes peuvent également être publiés sur le Moodle ou envoyés par une plateforme d'apprentissage en ligne. A la discrétion de l'enseignant, certaines de ces lectures peuvent être accompagnées d'une évaluation de compréhension donnant lieu à une note."
							},
							{
								"obj": "Etre capable, à l’aide d’un dictionnaire, d’écrire des textes compréhensibles dans la langue cible (email, CV, lettre de motivation...)",
								"sit": "Rédaction de textes dans la langue cible, dans la langue cible, que cela soit en classe ou à la maison. A la discrétion de l'enseignant, certaines de ces rédactions peuvent donner lieu à une note."
							},
							{
								"obj": "Etre capable de suivre une conversation ou un document audio-visuel bref, dans la langue cible.",
								"sit": "Ecoute de documents authentiques dans la langue cible, que cela soit en classe ou à la maison. Des textes peuvent également être publiés sur le Moodle ou envoyés par une plateforme d'apprentissage en ligne. A la discrétion de l'enseignant, certaines de ces documents audio ou audio-visuel peuvent être accompagnés d'une évaluation de compréhension donnant lieu à une note."
							},
							{
								"obj": "Etre capable de se faire comprendre dans la langue cible de façon non ambiguë",
								"sit": ""
							}
						]
					},
					{
						"nom": "Activité information-communication : APIC",
						"semestre": 2,
						"coeff": 1,
						"nb_heures": 4.5,
						"repartition": [0, 4.5, 0, 0, 0, 0],
						"supports": [],
						"resume": "Suite ou approfondissement des notions abordées au premier semestre",
						"contenu": "",
						"objectifs/situations": []
					}
				]
			}
		]
	},
	{
		"année": 2,
		"blocs": [
			{
				"nom": "Mathématiques et informatique",
				"ratio": 39,
				"matières": [
					{
						"nom": "Transformations géométriques",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 54,
						"repartition": [54, 0, 0, 0, 0, 0],
						"supports": ["mathematica", "moodle"],
						"resume": "Le module a pour objectif d’approfondir les notions d’algèbre linéaire et de les appliquer à la géométrie du plan et de l’espace. On poursuit le travail matriciel en introduisant le vocabulaire lié à la diagonalisation des matrices carrées. La classification des applications linéaires usuelles du plan et de l’espace, ainsi que leur représentation matricielle, sont données et utilisées : rotation, homothétie, projection, dilatation. Les notions relatives aux espaces vectoriels réels sont enrichies par les notions d’espaces euclidiens. Le vocabulaire relatif à l’orthogonalité est un attendu du module ; on montre notamment le caractère favorable de la diagonalisation dans une base orthonormée. On introduit également les notions relatives aux espaces affines.",
						"contenu": "Le module a pour objectif d’approfondir les notions d’algèbre linéaire et de les appliquer à la géométrie du plan et de l’espace. On poursuit le travail matriciel en introduisant le vocabulaire lié à la diagonalisation des matrices carrées. La classification des applications linéaires usuelles du plan et de l’espace, ainsi que leur représentation matricielle, sont données et utilisées : rotation, homothétie, projection, dilatation. Les notions relatives aux espaces vectoriels réels sont enrichies par les notions d’espaces euclidiens. Le vocabulaire relatif à l’orthogonalité est un attendu du module ; on montre notamment le caractère favorable de la diagonalisation dans une base orthonormée. On introduit également les notions relatives aux espaces affines.",
						"objectifs/situations": [
							{
								"obj": "Modéliser à l’aide de transformations géométriques usuelles dans le plan et dans l’espace.",
								"sit": "Connaître la représentation matricielle des transformations géométriques usuelles."
							},
							{
								"obj": "Reconnaître une transformation géométrique à l’aide d’une analyse spectrale.",
								"sit": "Déterminer le polynôme caractéristique d'une matrice carrée.\nDéterminer les éléments propres d'une matrice carrée.\nDiagonaliser une matrice."
							},
							{
								"obj": "Reconnaître une transformation à partir de son écriture matricielle pour les transformations usuelles.",
								"sit": "Reconnaître une transformation à partir de sa représentation matricielle. Utiliser les coordonnées homogènes."
							},
							{
								"obj": "Étudier un système dynamique, discret ou continu.Connaître la richesse de l’utilisation de bases orthonormales.",
								"sit": ""
							},
							{
								"obj": "Connaître la richesse de l’utilisation de bases orthonormales.",
								"sit": "Connaître la richesse de l’utilisation de bases orthonormales."
							}
						]
					},
					{
						"nom": "Courbes et surfaces",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 54,
						"repartition": [0, 21, 22.5, 10.5, 0, 0],
						"supports": [],
						"resume": "Ce cours est consacré à l'étude des fonctions de plusieurs variables.\n\nCe sont des fonctions définies sur Rn, ou une partie de R n, à valeurs dans R ou dans R p ; n et p désignant deux entiers naturels.\n\nComme pour les fonctions d'une variable réelle, nous chercherons à établir, pour ce type de fonctions, les concepts de continuité, de dérivabilité, d'intégrabilité.\n\nPour les fonctions de R2 dans R, nous visualiserons les graphes correspondant à des surfaces de R3 et qui peuvent modéliser des reliefs.\n\nNous parlerons de pente dans des directions données, comme le ferait un randonneur,de reliefs accidentés,que nous modéliserons à l'aide de concepts mathématiques tels que la continuité, les dérivées directionnelles et partielles, la différentiabilité.\n\nA cette fin, nous introduirons les outils qui nous permettrons de donner les définitions correspondantes.\n\nC'est l'objet du premier chapitre qui traite des distances et des normes sur Rn, et de façon plus générale de topologie : la notion fondamentale pour parler de continuité est celle de voisinage. Une fonction f est dite continue en un point a si les valeurs f(x) qu'elle prend pour des valeurs x voisines de a, sont voisines de f(a). Cette définition naturelle de la continuité pourra être déclinée d'une façon rigoureuse mathématique, si nous pouvons définir la notion de voisinage, qui fait appel à un outil de mesure : la distance. ",
						"contenu": "Topologie de et Calcul différentiel :\n\n- Notion de normes et de distances; normes équivalentes ; notion de voisinage\n\n- Fonctions de Rn dans Rp, continuité, dérivées partielles\n\n- Fonctions différentiables et plan tangent\n\n- Fonctions de classe C2\n\n- Recherche d'extréma pour les fonctions de classe C2.",
						"objectifs/situations": [
							{
								"obj": "Maitriser les outils mathématiques permettant de définir les notions de continuité et de convergence dans des ensembles généraux.",
								"sit": "Calculer des distances dans un espace métrique ou dans un espace vectoriel normé.\n\nIdentifier les voisinages élémentaires d'un élément dans un espace métrique ou dans un espace vectoriel normé.\n\nVérifier qu'une application est une norme, une distance.\n\nComparer des normes, des voisinages.\n\nExprimer les notions de continuité et de convergences dans un espace métrique à l'aide de différents outils : distances, normes, voisinages.\n\nÉtudier la convergence d'une suite dans un espace métrique à l'aide de la distance choisie\n\nÉtudier la continuité d'une fonction dans un espace métrique à l'aide de la distance choisie."
							},
							{
								"obj": "Etudier les variations d’une fonction de plusieurs variables réelles",
								"sit": "Représenter des graphes de fonctions dans IR3 à l'aide de Mathematica\n\nIdentifier les graphes dans IR3 de fonctions usuelles\n\nIdentifier les graphes de fonctions continues/discontinues.\n\nProuver la continuité d'une fonction en un point de IRn\n\nProuver la discontinuité d'une fonction en un point de IRn\n\nCalculer des dérivées partielles\n\nReprésenter les fonctions partielles\n\nIllustrer la notion de dérivées partielles\n\nRechercher les lignes de plus grande pente"
							},
							{
								"obj": "Approximer une fonction de plusieurs variables réelles par un polynôme de degré 1 ou 2",
								"sit": "Etudier la différentiabilité : Développer une fonction de plusieurs variables réelles à l’ordre 1 ou 2\n\nIllustrer la notion de différentiabilité dans IR3 en représentant les plans tangents à l'aide de Mathematica\n\nCalculer des valeurs approchées d’une fonction de plusieurs variables réelles"
							},
							{
								"obj": "Rechercher les extrema d’une fonction de plusieurs variables réelles",
								"sit": "Etudier la différentiabilité à l’ordre 2 : Développer une fonction de plusieurs variables réelles à l’ordre 2\n\nDéterminer les points critiques ou singuliers\n\nDéterminer la nature des points critiques – maximum, minimum ou point col – en utilisant la règle du Hessien."
							}
						]
					},
					{
						"nom": "Algorithmique et programmation C",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 45,
						"repartition": [0, 18, 13.5, 13.5, 0, 0],
						"supports": ["doc_numerique", "powerpoint"],
						"resume": "L’objectif est de présenter à l‘étudiant les structures basées sur les listes et les arbres afin de résoudre un ensemble de problèmes basés sur la construction de tels objets tels que la recherche/insertion rapide dans un ensemble d’éléments triés, hiérarchiser des éléments …)",
						"contenu": "Rappel sur les pointeurs et les tableaux\n\nPrésentation des structures de données et de l’allocation dynamique\n\nLes listes chaînées, piles et files\n\nLes arbres (N-aires, binaires, parcours en largeur / profondeur)\n\nLes arbres binaires de recherche et équilibrés (ABR et AVL, rotations, linéarisation, arborisation)",
						"objectifs/situations": [
							{
								"obj": "Utiliser les pointeurs et l’allocation/désallocation dynamique",
								"sit": "Détecter des erreurs dans l’utilisation des pointeurs (papier/crayon) – individuel.\n\nDévelopper un programme utilisant les pointeurs et l’allocation dynamique (machine) – binôme"
							},
							{
								"obj": "Utilisation des structures de données en C",
								"sit": "Construire une structure en fonction du besoin.\n\nUtiliser les pointeurs de structures."
							},
							{
								"obj": "Reconnaître les structures de données de liste et d’arbre.\n\nExpliquer ce qu’est une liste, un arbre.",
								"sit": "Donner la définition d’une liste, pile ou d’une file.\n\nDonner la définition d’un arbre (N-aire, binaire).\n\nIdentifier une structure de données : reconnaître un ABR ou un AVL par exemple(papier/crayon) – individuel"
							},
							{
								"obj": "Définir et utiliser une structure de données dynamique",
								"sit": "Produire un code permettant de gérer des structures de données dynamiques dans une bibliothèque. (machine) – binôme"
							},
							{
								"obj": "Implémenter des algorithmes basés sur les listes et les arbres",
								"sit": "Insérer, rechercher, supprimer un élément dans une liste\n\nInsérer, rechercher un élément dans un arbre"
							},
							{
								"obj": "Définir un arbre équilibré.\n\nEquilibrer un arbre binaire",
								"sit": "Implémenter l’équilibrage d’un arbre binaire"
							},
							{
								"obj": "Utiliser les pointeurs et l’allocation/désallocation dynamique",
								"sit": "Détecter des erreurs dans l’utilisation des pointeurs (papier/crayon) – individuel.\n\nDévelopper un programme utilisant les pointeurs et l’allocation dynamique (machine) – binôme"
							},
							{
								"obj": "Utilisation des structures de données en C",
								"sit": "Construire une structure en fonction du besoin.\n\nUtiliser les pointeurs de structures."
							}
						]
					},
					{
						"nom": "Travaux pratiques logiciel",
						"semestre": 1,
						"coeff": 2,
						"nb_heures": 18,
						"repartition": [0, 0, 0, 18, 0, 0],
						"supports": [],
						"resume": "Programmation des connaissances et algorithmes acquis en cours magistral et en travaux dirigés.",
						"contenu": "Réalisation de programmes en langage C correspondant au programme des cours de S1 :\n\n- Utilisation des pointeurs.\n- Mise en application des listes chainées.\n- Parcours d'arbres binaires\n- Algorithmes de recherche dans un AVL\n- Utilisation des fichiers\n\nExemple de TP proposés les années précédentes :\n\n- Gestion d’un serveur de tchat en liste chaînée, mémorisation d’un parcours de sortie de labyrinthe en liste chainées.\n- Intelligence artificielle de puissance 4 avec des arbres min-max ou alpha/beta.\n- Développement et factorisation d’expression arithmétiques avec une représentation en arbres.",
						"objectifs/situations": [
							{
								"obj": "Mettre en pratique les notions vues en cours (INF2031)",
								"sit": "Implémenter un projet complet à partir d’une base pour faciliter le développement ou en partant d’une feuille blanche en fonction du sujet à traiter\n\nSe baser sur un cas concret (exemple : jeu de plateau / IA, simulation, algorithme d’optimisation pour le rendu …) (machine)"
							},
							{
								"obj": "Créer le projet dans le cadre de l’environnement de développement. (machine)\n\nDéboguer en cours de développement en utilisant les outils mis à disposition. (machine)",
								"sit": "Livrer un rendu suivant un cahier des charges"
							},
							{
								"obj": "Rendre le projet sous un format spécifique avec une arborescence imposée dans un format prédéfini (ZIP par exemple).",
								"sit": ""
							}
						]
					},
					{
						"nom": "Mathématiques et cryptographie",
						"semestre": 2,
						"coeff": 2.5,
						"nb_heures": 42,
						"repartition": [0, 16.5, 16.5, 9, 0, 0],
						"supports": ["doc_papier", "ordinateur", "mathematica", "moodle"],
						"resume": "Ce module vise à acquérir les notions de base sur les groupes puis à les appliquer en cryptographie. Au travers des liens présentés entre l’algèbre et la cryptographie, l’étudiant est sensibilisé à la sécurité de l’information. Dans un premier temps, la théorie des groupes permet de formaliser plusieurs chiffrements historiques (par exemple les chiffrements de César, Vigenère, Vernam, les grilles tournantes de Fleissner ou enigma) ainsi que leurs familles (chiffrements mono/poly-alphabétique, par permutation, etc.). Ensuite, la cryptographie asymétrique est introduite avec les groupes cycliques et les anneaux. Les bases théoriques sont utilisées pour démontrer le fonctionnement du chiffrement RSA et de l’échange de clés de Diffie-Hellman.\n\nEnfin, une ouverture pourra être faite vers la cryptographie symétrique moderne, la signature électronique et les fonctions de hachage.",
						"contenu": "- Notions générales sur les groupes : définitions, propriétés, sous-groupes, groupes quotients.\n\n- Sous-groupes de Z, étude des groupes Z/nZ. Application par exemple aux chiffrements de César, Vigenère et Vernam.\n\n- Morphismes de groupes, image, noyau, propriétés, groupes isomorphes, théorème d’isomorphisme.\n\n- Ordre d’un élément dans un groupe, notion de générateur, groupe monogène, groupe cyclique. Problème du logarithme discret et échange de clé de Diffie-Hellman.\n\n- Notions générales sur les anneaux : définitions, propriétés, sous-anneaux, idéaux, groupe des inversibles, corps.\n\n- Anneaux Z/nZ et chiffrement RSA. Formalisation possible du chiffrement de Hill ou des chiffrements affines par blocs. Ouverture possible sur la signature électronique avec RSA.\n\n- Théorème Chinois et résolution d'équation et système d'équation de congruence. Utilisation par exemple pour une cryptanalyse à clairs connus du chiffrement de Hill.\n\n- Corps finis Z/pZ et Fpn. Ouverture possible sur la cryptographie symétrique moderne ou sur les codes correcteurs.",
						"objectifs/situations": [
							{
								"obj": "Reconnaître et décrire un groupe ou un sous-groupe.",
								"sit": "Démontrer que G est un groupe. Démontrer que H est un sous-groupe de G.\n\nQCM pour déterminer si G est un groupe."
							},
							{
								"obj": "Reconnaître et décrire un anneau, un sous-anneau, un idéal, un corps.",
								"sit": "Démontrer que A est un anneau. Démontrer que B est un sous-anneau de A. Démontrer que I est un idéal.\n\nQCM pour déterminer si A est un anneau."
							},
							{
								"obj": "Calculer dans un groupe quotient ou dans un anneau quotient.",
								"sit": "Effectuer des calculs dans un quotient.\n\nConstruire et effectuer des calculs dans un corps fini si l’on fournit un polynôme irréductible.\n\nPeut être évalué indirectement avec la cryptographie."
							},
							{
								"obj": "Découvrir l’utilité des morphismes ; les appliquer pour calculer dans un groupe ou dans un anneau.",
								"sit": "Montrer qu’une application est un morphisme\n\nSimplifier un groupe en construisant un isomorphisme avec un groupe classique."
							},
							{
								"obj": "Étudier puis comparer les chiffrements symétriques historiques. Évaluer leur sécurité avec la théorie des groupes.",
								"sit": "Chiffrer/déchiffrer un message avec des systèmes historiques (César, Vigenère, etc.). Implémenter différents algorithmes de chiffrement et des cryptanalyses (analyse de fréquence, indice de coïncidence).\n\nÉtudier le groupe engendré par le chiffrement."
							},
							{
								"obj": "Appliquer le chiffrement RSA et l’échange de clés DiffieHellman.",
								"sit": "Appliquer RSA et Diffie-Hellman avec de petites valeurs sur papier."
							}
						]
					},
					{
						"nom": "Séries, approximation, probabilités",
						"semestre": 2,
						"coeff": 2.5,
						"nb_heures": 42,
						"repartition": [0, 21, 21, 0, 0, 0],
						"supports": [],
						"resume": "Connaitre la notion de séries numériques, de séries de fonctions et de séries entières. Maîtrise des différentes notions de convergences. Savoir approximer les fonctions par des séries entières.\n\nLe premier chapitre est centré sur les techniques d’étude de nature de séries de nombres : elles permettent d’indiquer si une converge ou si elle diverge.\n\nLe calcul de la somme infinie de séries convergentes n’y est abordé que pour les cas les plus simples : séries géométriques, séries « télescopiques ».\n\nLe deuxième chapitre introduit la notion de suites de fonctions.\n\nLe troisième chapitre est consacré aux séries entières qui généralisent la notion de polynômes et s’appuient sur les développements de Taylor.\n\nLe dernier chapitre tratite quelques notions de probabilités et de l’utilisation du logiciel R",
						"contenu": "Séries : Séries numériques : Convergence d'une suite et convergence d'une série. Relation entre la convergence absolue et la convergence d'une série.\n\n- Etude des séries de références. Séries à termes positifs : Majoration du terme général d'une série par le terme général d'une série de référence, recherche d'un équivalent du terme général, règle de d'Alembert & Règle de Riemann ; comparaison d'une série et d'une intégrale.\n\n- Pour les autres séries : Théorème des séries alternées ; développement limité du terme général\n\n- Suites de fonctions : Convergence simple, convergence uniforme ; la convergence uniforme implique la convergence simple.\n\n- Propriétés de la fonction limite : continuité, dérivation et intégration.\n\n- Rapide introduction aux séries de fonctions application aux séries entières : Rayon de convergence d'une série entière, règle de d'Alembert.\n\n- Développement en série entière des fonctions `usuelles`.\n\n- Sommation d' une série entière (en se ramenant aux fonctions de référence ou par la méthode de l'équation différentielle).\n\n- Couple de variables aléatoires discrètes finies : loi de probabilité d’un couple de variables aléatoires, lois marginales, indépendance de deux variables aléatoires, covariance et coefficient de corrélation linéaire, lois conditionnelles, espérance et variance conditionnelles\n\n- Approximation de la loi binomiale par la loi de Poisson, appproximation de la loi hypergéométrique par la loi binomiale, approximation de la loi binomiale par la loi normale",
						"objectifs/situations": [
							{
								"obj": "Calculer des valeurs approchées de nombres ou de fonctions, en utilisant des séries et en estimant la précision de l’approximation",
								"sit": "Expliquer la notion de convergence de séries numériques\n\nIdentifier les séries géométriques\n\nCaractériser les conditions de convergence des séries géométriques\n\nIndiquer si une série converge ou diverge en utilisant un outil approprié\n\nIdentifier le type de convergence de suites de fonctions\n\nDéterminer les domaines de convergences des séries entières\n\nCalculer les sommes de séries entières\n\nDévelopper des fonctions en série entière"
							},
							{
								"obj": "Calculer des sommes de séries",
								"sit": "Calculer la somme d’une série géométrique convergente\n\nCalculer les sommes de séries « télescopiques »\n\nLister les développements en série entière des fonctions usuelles."
							},
							{
								"obj": "Connaître les approximations des lois de probabilité usuelles et utiliser l’outil informatique R",
								"sit": "Savoir qu’il est possible d’approximer une loi par une autre loi"
							}
						]
					},
					{
						"nom": "Algorithmique avancée",
						"semestre": 2,
						"coeff": 2.5,
						"nb_heures": 45,
						"repartition": [0, 18, 13.5, 13.5, 0, 0],
						"supports": ["doc_numerique", "powerpoint"],
						"resume": "L’objectif est de présenter les structures de données de type graphes afin de résoudre des problèmes axées sur la recherche du plus court chemin. Une présentation de quelques algorithmes de compression est également réalisée.",
						"contenu": "Compression :\n\nIntroduction / Définitions\nCodage basé sur la longueur de séquence (RLE)\nCodage de Huffman\nCodage basé sur un dictionnaire (LZW)\n\nGraphes :\n\nDéfinitions.\nReprésentation d'un graphe en mémoire (Mémorisation matricielle, en table de listes d'adjacence)\nParcours en profondeur, en largeur.\nPlus court chemin (Dijkstra, Floyd) et ouverture sur d’autres algorithmes.",
						"objectifs/situations": [
							{
								"obj": "Comprendre les concepts de la compression et reconnaître le type de compression utilisé",
								"sit": "Savoir identifier les caractéristiques d’un mode de compression (exemple : ZIP, RAR, JPEG, MPEG, BMP/RLE, …) (papier/crayon)"
							},
							{
								"obj": "Implémenter des algorithmes de compression",
								"sit": "Développer un programme pour compresser/décompresser avec un des algorithmes vus en cours (RLE, Huffman, LZW) (machine)"
							},
							{
								"obj": "Reconnaître les structures de données de graphe.\nExpliquer ce qu’est un graphe.\nModéliser un graphe pour l’exploiter par la suite dans un algorithme",
								"sit": "Donner la définition d’un graphe (papier/crayon).\nIdentifier une structure de données de graphe. (papier/crayon).\nSavoir créer une structure de graphe à partir d’un schéma. (machine)"
							},
							{
								"obj": "Implémenter des algorithmes basés sur les graphes",
								"sit": "Implémenter les parcours en profondeur / largeur et des algorithmes de recherche du plus court chemin."
							},
							{
								"obj": "Comprendre les concepts de la compression et reconnaître le type de compression utilisé",
								"sit": "Savoir identifier les caractéristiques d’un mode de compression (exemple : ZIP, RAR, JPEG, MPEG, BMP/RLE, …) (papier/crayon)"
							},
							{
								"obj": "Implémenter des algorithmes de compression",
								"sit": "Développer un programme pour compresser/décompresser avec un des algorithmes vus en cours (RLE, Huffman, LZW) (machine)"
							}
						]
					},
					{
						"nom": "Travaux pratiques logiciel : projet",
						"semestre": 2,
						"coeff": 2.5,
						"nb_heures": 18,
						"repartition": [0, 0, 0, 18, 0, 0],
						"supports": ["ordinateur"],
						"resume": "L'objectif est une mise en d'application du module théorique INF2032 : programmation et algoritmique sur les sujets de la compression de données (sans perte) ainsi que les graphes. En langage C et/ou en Java. Selon qu'une introduction aux langages orienté objet ait été faite. Le TP est découpé en 2 livrables sur les 2 thématiques.",
						"contenu": "- Réalisation en langage C d'algorithmes mettant en pratique les notions de compression de données vus en cours (INF2032) et en travaux dirigés\n\n- Réalisation d'applications en langage Java mettant en pratique les notions de programmation orientée objet vues en cours et en travaux dirigés.\n\n- Réalisation d'applications en langage Java relatives à la théorie des graphes.\n\n- Création de classes, de méthodes et d'interface permettant la gestion des graphes.\n\n- Ecriture d'algorithmes sur les graphes (plus cours chemin ou 'page-rank')",
						"objectifs/situations": [
							{
								"obj": "Mettre en pratique les notions vues en cours (INF2031 & INF2032)",
								"sit": "Implémenter un projet complet à partir d’une base pour faciliter le développement ou en partant d’une feuille blanche en fonction du sujet à traiter\n\nSe baser sur un cas concret (exemple : compression de données spécifique, résolution de problème avec les graphes, application des graphes à divers domaines : musique, électronique, …) (machine)"
							},
							{
								"obj": "Exploiter les fonctionnalités de l’environnement de développement",
								"sit": "Créer le projet dans l’environnement de développement.\nDéboguer en cours de développement en utilisant les outils mis à disposition. (machine)"
							},
							{
								"obj": "Livrer un rendu suivant un cahier des charges",
								"sit": "Rendre le projet sous un format spécifique avec une arborescence imposée dans un format prédéfini (ZIP par exemple)."
							}
						]
					}
				]
			},
			{
				"nom": "Physique, électronique et systèmes",
				"ratio": 31,
				"matières": [
					{
						"nom": "Propagation et Ondes",
						"semestre": 1,
						"coeff": 4,
						"nb_heures": 54,
						"repartition": [0, 45, 9, 0, 0, 0],
						"supports": ["doc_papier", "doc_numerique", "web"],
						"resume": "Toute onde est associée à une vibration, une oscillation qui se transmet de proche en proche. En commençant par l’étude des oscillations dans des systèmes mécaniques et électriques simples, puis dans des systèmes couplés plus élaborés, l’objectif de ce module est de présenter sur des exemples variés, une description de base des oscillations indépendamment de tout système physique, d’expliquer la façon dont elles évoluent en fonction des paramètres qui les contraignent, pour aboutir à une description commune donc plus générale des phénomènes de propagation d’ondes et de leurs propriétés.",
						"contenu": "1. Espace, Temps et Description locale\n\n- Introduction aux phénomènes ondulatoires : ondes, couplage espace-temps, espace et longueur d’onde, temps et fréquence.\n\n- Concept de champ et description locale : repérage et systèmes de coordonnées 3D, l’outil mathématique champ et les opérateurs différentiels, les équations locales des champs à circulation ou à flux conservatifs, champs de gradient, champs de rotationnel.\n\n- Transport de l’énergie par les ondes : énergie mécanique totale d’un système physique, énergie cinétique, énergie potentielle, autres formes d’énergie et chaîne de transformation, transport d’énergie et répartition locale.\n\n\n2. Oscillateurs et Ondes\n\n- Le modèle harmonique de l’oscillateur à 1 dimension : rappels (qu’est-ce qu’un oscillateur ? définition, caractéristiques et exemples), équation différentielle du mouvement et solution générale, représentation dans l’espace des phases et aspect énergétique.\n\n- Oscillations libres et forcées d’un système dissipatif : modèles d’oscillateurs amortis mécaniques et électriques, les différents régimes d’oscillations libres amorties, dissipation d’énergie et facteur de qualité, forçage et résonance d’un oscillateur amorti.\n\n- Le couplage d’oscillateurs, des oscillations aux ondes : exemple du couplage entre 2 oscillateurs, détermination des modes propres, phénomène de battements, oscillations libres et forcées d’un système couplé de N oscillateurs, comportement de la chaîne, première approche du phénomène de propagation.\n\n\n3. Propagation des ondes : concept d’onde et modélisation\n\n- Le phénomène de propagation et l’équation d’onde : propagation dans la chaîne d’oscillateurs et approximation des milieux continus, équation d’onde (équation de d’Alembert) à 1 dimension et solution générale (fonction d’onde progressive plane), généralisation à 3 dimensions, autres solutions, et exemples d’ondes (ondes mécaniques, ondes sonores, ondes de courant, ondes de chaleur, ondes de matière).\n\n- L’analyse harmonique de la propagation et son intérêt : l’outil opps (onde progressive plane sinusoïdale), ses caractéristiques (double périodicité, fronts d’onde, vitesse de phase), équation de dispersion et analyse d’un phénomène de propagation.\n\n- La superposition d’ondes et les interférences : superposition d’ondes de mêmes fréquences, notion de paquet d’ondes et vitesse de groupe, application à la transmission d’une information et signaux transportés par une modulation.\n\n\n4. Les ondes électromagnétiques\n\n- Retour sur les lois de l’Electromagnétisme (Electrostatique, Magnétostatique et induction électromagnétique).\n\n- La description locale du champ électromagnétique variable : équations de Maxwell et contenu physique, conditions aux limites, compréhension intuitive du phénomène de propagation et équation d’onde électromagnétique.\n\n- La propagation des ondes électromagnétiques dans le vide : équation de d’Alembert et onde électromagnétique progressive plane sinusoïdale. Structure transversale, plans d’onde, vitesse de phase, périodicités spatiale et temporelle, relation de dispersion du vide, polarisation et applications à la lumière.\n\n- La propagation de l’énergie électromagnétique : vecteur de Poynting et puissance rayonnée par une oepps, densité d’énergie, bilan énergétique local et théorème de Poynting, vitesse de propagation de l’énergie, équirépartition des densités d’énergie.",
						"objectifs/situations": [
							{
								"obj": "Définir le concept de propagation d’une quantité physique et énoncer les différents types d’équations de propagation d’une onde\n\nModéliser un mouvement oscillatoire à partir des lois de la Mécanique.\n\nEnumérer les lois de l’Electromagnétisme et les utiliser pour la caractérisation d’une onde électromagnétique",
								"sit": "Décrire le comportement temporel et fréquentiel d’un système oscillant (amplitude, fréquence, période, résonance...).\n\nEtudier le couplage de systèmes mécaniques (chaine de ressorts, pendules couplés…)\n\nTransposer un système mécanique oscillant en système électromagnétique (analogie électromécanique)\n\nEtudier quelques cas concrets d’ondes longitudinales (ressort, son…) ou transversales (cordes)\n\nPrévoir le comportement d’un signal électrique dans une ligne de transmission.\n\nInterpréter la relation de dispersion pour un phénomène de propagation.\n\nEtudier les propriétés d’une onde électromagnétique (direction de propagation, polarisation, énergie transportée…)"
							}
						]
					},
					{
						"nom": "Electronique numérique",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 33,
						"repartition": [33, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "Comprendre les bases de la logique binaire et séquentielle.",
						"contenu": "- Introduction aux concepts numériques\n\n- Numération\n\n- Portes logiques\n\n- Algèbre booléenne et simplification logique\n\n- Logique combinatoire\n\n- Introduction à la logique programmable\n\n- Bascules\n\n- Compteurs\n\n- Registres à décalage",
						"objectifs/situations": [
							{
								"obj": "Analyser et concevoir des systèmes élémentaires à base de composants numériques.",
								"sit": "Analyser et schématiser des fonctions combinatoires (codeurs, décodeurs, multiplexeurs,…).\n\nAnalyser et schématiser des fonctions séquentielles (bascules, compteurs et décompteurs).\n\nStructurer un système numérique séquentiel d’un niveau de complexité faible."
							}
						]
					},
					{
						"nom": "Projet robotique et techniques numériques",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 27,
						"repartition": [0, 0, 0, 18, 9, 0],
						"supports": [],
						"resume": "- Utiliser un langage de programmation pour réaliser l'asservissement d'un robot\n- Savoir réaliser un système logique basé sur des fonctions combinatoires et séquentielles",
						"contenu": "Projet robotique :\n\n- Programmation d'un robot lego Mindstorm avec le langage C, dans le respect d'un cahier des charges,\n\n- Compétition finale entre équipes à l'image de la coupe de France de robotique.\n\n\nTP techniques numériques :\n\n- Utilisation des opérateurs logiques élémentaires\n\n- Réalisation d’additionneurs et de soustracteurs\n\n- Etude des bascules RS, RST, D et JK\n\n- Réalisation de compteurs synchrones et asynchrones\n\n- Etude et réalisation d'une horloge",
						"objectifs/situations": [
							{
								"obj": "Concevoir et développer des structures élémentaires en utilisant un circuit de logique programmable (FPGA) à partir de schémas blocs.",
								"sit": "Analyser et schématiser des fonctions combinatoires (codeurs, décodeurs, multiplexeurs,…).\n\nAnalyser et schématiser des fonctions séquentielles (bascules, compteurs et décompteurs).\n\nStructurer un système numérique séquentiel d’un niveau de complexité faible."
							}
						]
					},
					{
						"nom": "Systèmes",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 36,
						"repartition": [0, 27, 0, 9, 0, 0],
						"supports": ["doc_papier", "powerpoint", "quartus"],
						"resume": "- Savoir analyser un système ou un cahier des charges afin de le modéliser et le réaliser -> utilisation de différentes méthodes (graphes d'états , réseaux de PETRI, grafcet)\n\nIntroduction aux systèmes à microprocesseurs.\n- Savoir analyser l’architecture d’un système minimal.",
						"contenu": "- Analyse et synthèse des systèmes à événements discrets\n\n- Machines de Moore, Mealy\n\n- Réseaux de Pétri\n\n- Notion de bus\n\n- Mémoires vives, mémoires mortes\n\n- Conversion Analogique Numérique\n\n- Conversion Numérique Analogique\n\n- Introduction aux systèmes microprogrammés\n\n- Interfaçage",
						"objectifs/situations": [
							{
								"obj": "Analyser puis réaliser des modélisations de systèmes dans différents formalismes.",
								"sit": "De modéliser des systèmes électroniques par graphes d’états.\n\nDe comprendre des cahiers des charges pour produire une modélisation simple
"
							},
							{
								"obj": "Analyser l’architecture d’un système à base de microprocesseurs",
								"sit": "Analyser et reconnaître l’architecture d’un système à microprocesseur.\n\nUtiliser les documentations techniques de mémoires.\n\nComprendre les mécanismes de conversions analogiques / numériques"
							}
						]
					},
					{
						"nom": "Projet Techniques Analogiques",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 24,
						"repartition": [0, 0, 0, 12, 12, 0],
						"supports": [],
						"resume": "Concevoir et réaliser un système basé sur des fonctions numériques et analogiques",
						"contenu": "Imaginer, concevoir et réaliser un système logique complexe, utilisant des fonctions logiques combinatoires, séquentielles, des mémoires et des fonctions analogiques",
						"objectifs/situations": [
							{
								"obj": "Concevoir et développer une application en utilisant un circuit de logique programmable (FPGA) à partir de schémas blocs.",
								"sit": "Analyser l’architecture d’une solution comportant au moins une mémoire et un composant d’interface analogique-numérique ou numérique-analogique.\n\nSchématiser chaque sous fonction.\n\nRésoudre les problèmes de fonctionnement.\n\nStructurer un système numérique séquentiel d’un niveau de complexité moyen."
							}
						]
					},
					{
						"nom": "Production et transmission des ondes et des signaux",
						"semestre": 2,
						"coeff": 3,
						"nb_heures": 54,
						"repartition": [0, 45, 9, 0, 0, 0],
						"supports": ["doc_papier", "doc_numerique", "web"],
						"resume": "Ce module présente l’étude des phénomènes physiques liés à la propagation des ondes et des signaux dans les médias de communication électrique et optique.\n\nSon objectif est de fournir les bases indispensables à la compréhension des phénomènes de propagation libre et guidée. Il en présente les très nombreuses et très importantes applications technologiques en particulier pour les télécommunications tant terrestres que spatiales.",
						"contenu": "1. Production et réception des ondes électromagnétiques : application aux antennes.\n\n- Ondes électromagnétiques (Rappels) : fréquences et longueurs d’onde des ondes électromagnétiques, différents types de sources et leur mode d’émission, exemples de capteurs d’ondes électromagnétiques.\n\n- Notions sur le rayonnement d’ondes électromagnétiques : rayonnement dipolaire électrique, champ rayonné, énergie électromagnétique et puissance rayonnées, diagramme de rayonnement.\n\n- Introduction aux antennes : comment générer ou recevoir des ondes électromagnétiques, principe de fonctionnement d’une antenne en émission et réception.\n\n- Application à l’étude du rayonnement des antennes pour les télécommunications (radio émettrices, télévision par satellite, téléphones portables, WiFi).\n\n\n2. Propagation des ondes électromagnétiques en espace libre.\n\n- Ondes électromagnétiques progressives planes sinusoïdales dans le vide : rappels des caractéristiques de propagation, polarisation et grandeurs énergétiques.\n\n- Notions sur l’électromagnétisme des milieux : polarisation et aimantation, équations de Maxwell dans la matière, application aux milieux linéaires, homogènes et isotropes.\n\n- Possibilités de propagation dans un milieu LHI illimité : analyse harmonique, équation de dispersion, phénomènes d’absorption et de dispersion, vitesse de groupe et propagation de l’énergie\n\n- Applications : à l’étude de l’absorption d’un signal dans un bon conducteur (effet de peau), à l’étude de la dispersion d’un signal dans un plasma (exemple du plasma ionosphérique), à l’étude du phénomène de diffusion (exemple de la diffusion Rayleigh atmosphérique).\n\n\n3. Réflexion et Transmission des ondes électromagnétiques, influence des conditions aux limites\n\n- Ondes et conducteurs métalliques : la réflexion sur un métal parfait, conditions aux limites, onde incidente et onde réfléchie, pression de radiation.\n\n- Etude de la réflexion normale (ondes stationnaires et modes de résonance d’une cavité) et étude de la réflexion oblique ( ondes guidées et modes de propagation d’un guide d’ondes)\n\n- Ondes et milieux diélectriques : conditions aux limites, réflexion et réfraction, lois de Descartes, passage à l’Optique géométrique, exemple des ondes lumineuses\n\n- Application aux télécommunications terrestres ou spatiales : étude de situations concrètes en espace libre, par lignes ou guides d’ondes métalliques, par fibres optiques.\n\n\n4. D’autres aspects des phénomènes ondulatoires\n\n- Superposition constructive ou destructive d’ondes et phénomènes d’interférences et de diffraction.\n\n- Systèmes interférentiels par division du front d’onde, par division d’amplitude et réseaux.\n\n- Application à l’étude d’interférences lumineuses (phénomène d’ irisation, décomposition de la lumière par un CD), d’interférences d’ondes radio (ondes parasites, fading, anti-bruit), des réseaux optiques ou des réseaux d’antennes.\n\n- Le phénomène de diffraction par un obstacle ou un diaphragme, interférences et diffraction.\n\n- Application à l’étude de l’holographie et de la vélocimétrie Laser\n\n- Doppler.",
						"objectifs/situations": [
							{
								"obj": "Enumérer les propriétés d’une onde électromagnétique.\n\nEtudier la propagation d’une onde électromagnétique dans le vide et dans un milieu matériel.\n\nDécrire le comportement d’une onde guidée.\n\nDégager les relations de l’optique géométrique et physique des lois générales de l’Electromagnétisme.",
								"sit": "Décrire une onde électromagnétique se propageant dans le vide (direction de propagation, polarisation, vecteur d’onde..).\n\nModéliser un signal électromagnétique sous la forme d’ondes planes (décomposition spectrale).\n\nSchématiser un milieu matériel vu par une onde électromagnétique en termes d’interaction matière rayonnement (milieu conducteur, diélectrique, plasma...)\n\nInterpréter la relation de dispersion d’une onde électromagnétique dans des milieux matériels simples.\n\nEtudier la réflexion d’une onde sur un plan métallique (miroir, guide d’onde, cavité résonante).\n\nPrévoir le résultat de la composition de plusieurs ondes électromagnétiques (interférences, diffraction)."
							}
						]
					},
					{
						"nom": "Projet Scientifique et Techniques : Réalisation",
						"semestre": 2,
						"coeff": 3,
						"nb_heures": 42,
						"repartition": [0, 0, 9, 0, 42, 0],
						"supports": [],
						"resume": "Mobiliser des connaissances entre les différentes disciplines.\n\nConcevoir un système simple : Définir, Modéliser, Simuler/tester, Valider le modèle sur un prototype, Expliquer le modèle, Comparer avec le réalisé, Proposer des axes d’amélioration\n\nS’initier à la gestion de projet 'classique' (waterfall), en mettant l'accent ce semetsre sur le phase 'réalisation', se préper à la présentation orale.",
						"contenu": "Initiation à la gestion de projet :\n\nLes principaux thèmes abordés dans l’enseignement GP sont les suivants :\n\n- Qu’est-ce qu’un projet ?\n\n- L’objectif et la raison d’être,\n\n- Les parties prenantes,\n\n- Les grandes étapes d’un projet,\n\n- L’organisation d’un projet,\n\n- Le planning (diagramme de Gantt),\n\n- Gérer les risques.\n\n\nTechnique de présentation :\n\nL’enseignement porte sur les bonnes pratiques de la présentation de projet :\n\n- Pertinence du choix des éléments présentés,\n\n- Répartition des rôles entre membres de l’équipe,\n\n- Equilibre des temps de parole,\n\n- Qualité des supports,\n\n- Qualité de la présentation orale",
						"objectifs/situations": [
							{
								"obj": "Mettre en place une méthodologie de projet",
								"sit": "Réalisation du projet"
							},
							{
								"obj": "Valider la conformité d’un projet",
								"sit": "Organiser la recette du projet"
							},
							{
								"obj": "Communiquer et présenter un projet",
								"sit": "Participer au salon des projets, réaliser des affiches"
							}
						]
					}
				]
			},
			{
				"nom": "Formation humaine",
				"ratio": 30,
				"matières": [
					{
						"nom": "Projet de Formation Humaine : Lancement",
						"semestre": 1,
						"coeff": 2,
						"nb_heures": 15,
						"repartition": [0, 0, 0, 0, 15, 0],
						"supports": ["doc_papier"],
						"resume": "Les projets de formation humaine de l'ESIEA sont des projets citoyens et responsables, ancrés dans le réel et le possible, novateurs, rationnels et humanistes. Ils permettent aux étudiants de réaliser sur une année un projet portant sur un domaine spécifique et de leur choix (création artistique, écologie, économie sociale et solidaire, vie associative...), de réfléchir à des problématiques nouvelles, d'agir dans des situations complexes (pro-activité) et de développer des compétences transversales. L'activité des projets de formation humaine permet de construire son projet personnel et professionnel.",
						"contenu": "- Ateliers : méthodologie de la conduite de projet (les trois phases d'un projet, lancement, réalisation, transmission), méthodologie de la rédaction d'un rapport d'avant-projet (problématique, objectifs, plan d'action et de financement), méthodologie de la présentation orale d'un projet. Ateliers spécifiques : étude de faisabilité, plan de diffusion, les réponses du destinataire d'un projet artistique...\n\n- Conférences : autour d'une thématique choisie chaque année (2014-2015 : la métamorphose)... et sur des sujets de société : femmes et sciences, les actions de solidarité, le système ontophanique numérique...\n\n- Projet suivi par des professeurs, des anciens élèves de l'ESIEA, des acteurs du monde professionnel et associatif...\n\n- Réunions mentoring (1 à 2 fois par semestre) : bilan, avancement du projet, évaluation du porte-folio numérique, recommandation...\n\nL'activité des projets de formation humaine est axée principalement sur la communication en deuxième année.",
						"objectifs/situations": [
							{
								"obj": "Lancer un projet",
								"sit":"Analyser un environnement : faire le diagnostic externe (opportunités/menaces) et interne (forces/faiblesses) d’une situation. Mener une étude de faisabilité.\nFormuler une problématique et se donner des objectifs pour la résoudre. Les objectifs doivent être Spécifiques, Mesurables, Ambitieux, Réalistes, Temporels (SMART).\nPlanifier : établir un plan d’actions (savoir différencier « actions » et « objectifs ») et un plan de financement (à partir de la deuxième année).\nSe donner des objectifs personnels de progression."
							}
						]
					},
					{
						"nom": "Techniques d’expression",
						"semestre": 1,
						"coeff": 1.5,
						"nb_heures": 15,
						"repartition": [0, 0, 15, 0, 0, 0],
						"supports": ["doc_papier", "powerpoint", "ordinateur"],
						"resume": "Le métier d’ingénieur nécessite des compétences multiples qui s’inscrivent au-delà du périmètre technique et scientifique.\n\nLors des modules de techniques d’expression vous serez amenés à exercer votre esprit critique et développer vos capacités d’analyse, de synthèse et d’expression nécessaires dans le cadre de vos activités professionnelles.\n\nDans la continuité du travail élaboré en L1, vous travaillerez en mode projet sur des sujets variés, à dimension culturelle et sociétale, qui vous permettront de soutenir et de développer vos compétences en communication.",
						"contenu": "Plusieurs projets de groupe à réaliser sur l'année. Écrit comme oral. Dictées pour travail sur l'orthographe et règles de grammaire.",
						"objectifs/situations": [
							{
								"obj": "Améliorer sa maîtrise de la langue française",
								"sit": "Dictées, révisions de règles de grammaire et orthographe et exercices d’application. Travail du vocabulaire."
							},
							{
								"obj": "Développer sa culture générale, sa curiosité et son esprit critique",
								"sit": "Lecture d’un ouvrage (roman, nouvelles, essai) et analyse de celui-ci"
							},
							{
								"obj": "Rédiger un écrit bien structuré et argumenté",
								"sit": "Etat de l’art, dissertation, présentation de rapports et projets d’entreprises ; Redaction de rapport de stage/projet en resctant un cahier des charges"
							},
							{
								"obj": "Synthétiser des sujets",
								"sit": "Synthèse d’idées essentielles d’articles de journaux et d’ouvrage, puis formulation d’un avis critique"
							},
							{
								"obj": "Adapter son discours à un public",
								"sit": "Exercices ludiques sur la notion de « registre »"
							},
							{
								"obj": "Développer sa créativité",
								"sit": "Rédiger un écrit original et créatif – Atelier d’écriture"
							}
						]
					},
					{
						"nom": "Anglais",
						"semestre": 1,
						"coeff": 2,
						"nb_heures": 21,
						"repartition": [0, 0, 21, 0, 0, 0],
						"supports": ["doc_papier", "powerpoint", "audio", "video", "web", "ordinateur"],
						"resume": "Through exposure to a wide variety of news reports from the print media, television and radio, students improve their reading and listening comprehension as well as enriching their vocabulary in many different subject areas. In teams of 8 to 10, students create their own news broadcasts, a project which involves intensive oral and written production with extensive feedback from the instructors. Students also produce a first CV and covering letter for the mission abroad.",
						"contenu": "- The language of news reporting: presentation and practice\n\n- Reading news reports from the print media; watching news reports from television\n\n- Multiple writing assignments with instructor feedback\n\n- Work sessions on clear pronunciation of news reports\n\n- Writing a first CV: presentation of basic notions, practice and feedback\n\n- Writing a first covering letter: presentation of basic notions, practice and feedback",
						"objectifs/situations": [
							{
								"obj": "Can recognise and use language on a wide range of topics within spoken exchanges.",
								"sit": "Video lessons with teacher-developed comprehension exercises; student production (oral and written) following upon models provided."
							},
							{
								"obj": "Speak comprehensibly for a short period of time on a clearly defined and limited topic",
								"sit": "News Broadcast Project / Reading exercise in Lab"
							},
							{
								"obj": "Can produce a short non-ambiguous text on a clearly defined and limited topic.",
								"sit": "News Broadcast Project"
							}
						]
					},
					{
						"nom": "LV2, FLE, anglais renforcé",
						"semestre": 1,
						"coeff": 0,
						"nb_heures": 15,
						"repartition": [0, 0, 15, 0, 0, 0],
						"supports": ["doc_papier", "powerpoint", "audio", "video", "web", "ordinateur"],
						"resume": "- Acquérir les compétences communicatives et interculturelles dans la langue choisie\n\n- Préparer des tests de niveau certifiants (TOEIC, Goethe Zertifikat, Cervantes, …)\n\n- Acquérir un niveau de maîtrise des structures grammaticales de la langue choisie permettant une communication simple mais non ambiguë",
						"contenu": "A la discrétion de l’enseignant. Peut inclure...\n\n- Etude de textes d’actualité\n\n- Ecoute d’enregistrements audiovisuels\n\n- Expression orale sur des sujets personnels ou professionnels\n\n- Expression écrite sur des sujets personnels ou professionnels\n\n- Exercices de grammaire\n\n- Apprentissage de vocabulaire\n\n- Présentation d’exposés\n\n- Expression interactive/ débats",
						"objectifs/situations": [
							{
								"obj": "Etre capable, à l’aide d’un dictionnaire, de comprendre des textes dans la langue cible.",
								"sit": "Lecture de textes authentiques dans la langue cible, que cela soit en classe ou à la maison. Des textes peuvent également être publiés sur le Moodle ou envoyés par une plateforme d'apprentissage en ligne. A la discrétion de l'enseignant, certaines de ces lectures peuvent être accompagnées d'une évaluation de compréhension donnant lieu à une note."
							},
							{
								"obj": "Etre capable, à l’aide d’un dictionnaire, d’écrire des textes compréhensibles dans la langue cible (email, CV, lettre de motivation...)",
								"sit": "Rédaction de textes dans la langue cible, dans la langue cible, que cela soit en classe ou à la maison. A la discrétion de l'enseignant, certaines de ces rédactions peuvent donner lieu à une note."
							},
							{
								"obj": "Etre capable de suivre une conversation ou un document audio-visuel bref, dans la langue cible.",
								"sit": "Ecoute de documents authentiques dans la langue cible, que cela soit en classe ou à la maison. Des textes peuvent également être publiés sur le Moodle ou envoyés par une plateforme d'apprentissage en ligne. A la discrétion de l'enseignant, certaines de ces documents audio ou audio-visuel peuvent être accompagnés d'une évaluation de compréhension donnant lieu à une note."
							},
							{
								"obj": "Etre capable de se faire comprendre dans la langue cible de façon non ambiguë",
								"sit": ""
							}
						]
					},
					{
						"nom": "Activité information-communication : APIC",
						"semestre": 1,
						"coeff": 1,
						"nb_heures": 4.5,
						"repartition": [0, 4.5, 0, 0, 0, 0],
						"supports": [],
						"resume": "Au cours de votre vie étudiante et professionnelle, vous serez amené à exercer vos talents de communicant. Que ce soit pour valoriser un projet associatif, convaincre un jury, faire un exposé devant vos professeurs, décrocher un stage puis un emploi, mener à bien une mission professionnelle, etc.\nVous aurez besoin de communiquer et d’être capable:\n\n- De promouvoir une idée, une réalisation ou un produit ;\n- De travailler en équipe, d’argumenter, de négocier pour arriver à un accord ;\n- D’informer et convaincre de multiples interlocuteurs dont certains, étrangers à votre univers et sa technicité.\n\nL'APIC (Actions de Promotion Information et Communication) est un des modules vous permettant de mieux communiquer. Il se fixe un triple objectif :\n\n1. Donner une vision d’ensemble, à la fois théorique et fonctionnelle des aspects liés à la communication persuasive, interpersonnelle et stratégique : construire un message et le délivrer au bon moment, renforcer son argumentation et savoir l’adapter à ses interlocuteurs pour un démultiplier l’impact.\n2. Mettre en pratique les connaissances acquises afin de contribuer à la notoriété et à la réputation de l’école lors des manifestations organisées par le service communication.\n3. Aider par des conseils pratiques, à la valorisation des actions des différentes associations de l’école et des projets pédagogiques réalisés par les étudiants (scientifiques ou de formation humaine)",
						"contenu": "Notions abordées :\n\n- Approche théorique des techniques de communication.\n- Principes de base de la Programmation Neurolinguistique.\n- Modèle de la probabilité d’élaboration, pyramide de Maslow, théorie cognitiviste, les voies de la perception (émotionnelle et rationnelle).\n- Principes fondamentaux, méthodes et procédés de la rhétorique et de la communication persuasive : construction du discours rhétorique, facteurs qui augmentent la crédibilité, principes de formulation, lois de l’influence, etc.\n- La dimension non verbale de la communication : attitude, langage corporel et synchronisation.\n- Conseils pratiques et facteurs généraux intervenant dans les situations de communication d’un « esiearque ».\n\nEvaluation semestrielle :\n\nL’évaluation sera à la fois quantitative et qualitative (bonus/malus).\n- Assiduité et participation en cours (20%)\n- Actions de communication (80%)\n\nChaque étudiant devra réaliser au moins une action de communication par semestre au service de son école lui permettant de mettre en pratique les techniques et conseils donnés:\n\n- Présence au forum d’orientation de son lycée ou d’un lycée proche de son établissement ;\n- Intervention en classe dans un établissement scolaire pour présenter le métier d’ingénieur;\n- Participation aux journées portes ouvertes ou journées de concours ;\n- Participation active à l’un des salons ou l’école sera présente ;\n- Rédaction d’articles (correspondant communication), reportage photo ou vidéo, participation à la web team de l’école ;\n- Aide à l’organisation de tout événement engageant l’image de l’école organisé par la Direction de la Communication.",
						"objectifs/situations": []
					},
					{
						"nom": "Projet Scientifique et Technique : Définition du projet",
						"semestre": 1,
						"coeff": 2.5,
						"nb_heures": 30,
						"repartition": [13.5, 0, 0, 0, 15, 1.5],
						"supports": ["powerpoint"],
						"resume": "Mobiliser des connaissances entre les différentes disciplines.\n\nConcevoir un système simple : Définir, Modéliser, Simuler/tester, Valider le modèle sur un prototype, Expliquer le modèle, Comparer avec le réalisé, Proposer des axes d’amélioration\n\nS’initier à la gestion de projet « classique » (waterfall), en mettant l'accent ce semetsre sur le phase « avant-projet », se préper à la présentation orale",
						"contenu": "Initiation à la gestion de projet :\n\nLes principaux thèmes abordés dans l’enseignement GP sont les suivants :\n\n- Qu’est-ce qu’un projet ?\n\n- L’objectif et la raison d’être,\n\n- Les parties prenantes,\n\n- Les grandes étapes d’un projet,\n\n- L’organisation d’un projet,\n\n- Le planning (diagramme de Gantt),\n\n- Gérer les risques.\n\n\nTechnique de présentation :\n\nL’enseignement porte sur les bonnes pratiques de la présentation de projet :\n\n- Pertinence du choix des éléments présentés,\n\n- Répartition des rôles entre membres de l’équipe,\n\n- Equilibre des temps de parole,\n\n- Qualité des supports,\n\n- Qualité de la présentation orale",
						"objectifs/situations": [
							{
								"obj": "Problématiser et délimiter le sujet",
								"sit": "Réalisation d'un document de cadrage du projet qui présente ce sur quoi porte le projet (le quoi ?)"
							},
							{
								"obj": "Identifier les problèmes à résoudre",
								"sit": "Réalisation d’un document de cadrage du projet qui présente une décomposition pertinente et cohérente de la démarche de réalisation"
							},
							{
								"obj": "Réguler la dynamique de groupe,\nOrganiser le travail,\nTravailler en équipe",
								"sit": "Organisation de réunions de suivis régulières permettant à l'équipe de rendre compte de l'avancement du projet, de la répartition des tâches entre les membres de l'équipe projet et des prochaines étapes."
							}
						]
					},
					{
						"nom": "Projet de Formation Humaine : Réalisation",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 21,
						"repartition": [0, 0, 0, 0, 21, 0],
						"supports": [],
						"resume": "Les projets de formation humaine de l'ESIEA sont des projets citoyens et responsables, ancrés dans le réel et le possible, novateurs, rationnels et humanistes. Ils permettent aux étudiants de réaliser sur une année un projet portant sur un domaine spécifique et de leur choix (création artistique, écologie, économie sociale et solidaire, vie associative...), de réfléchir à des problématiques nouvelles, d'agir dans des situations complexes (pro-activité) et de développer des compétences transversales. L'activité des projets de formation humaine permet de construire son projet personnel et professionnel.",
						"contenu": "- Ateliers : méthodologie de la conduite de projet (les trois phases d'un projet, lancement, réalisation, transmission), méthodologie de la rédaction d'un rapport d'avant-projet (problématique, objectifs, plan d'action et de financement), méthodologie de la présentation orale d'un projet. Ateliers spécifiques : étude de faisabilité, plan de diffusion, les réponses du destinataire d'un projet artistique...\n\n- Conférences : autour d'une thématique choisie chaque année (2014-2015 : la métamorphose)... et sur des sujets de société : femmes et sciences, les actions de solidarité, le système ontophanique numérique...\n\n- Projet suivi par des professeurs, des anciens élèves de l'ESIEA, des acteurs du monde professionnel et associatif...\n\n- Réunions mentoring (1 à 2 fois par semestre) : bilan, avancement du projet, évaluation du porte-folio numérique, recommandation...\n\nL'activité des projets de formation humaine est axée principalement sur la communication en deuxième année.",
						"objectifs/situations": [
							{
								"obj": "Réaliser son projet",
								"sit": "Agir sur une période déterminée (un an, deux ans…), dans une situation complexe, résoudre des problèmes : être proactif…\n\nCommuniquer autour de son action (à l’écrit, à l’oral, en réunion…).\n\nEvaluer son action et mesurer l’atteinte de ses objectifs avec des indicateurs de performance adaptés et cohérents.\n\nTravailler en équipe. Porter la responsabilité d’une action collective. Exercer une responsabilité : responsable de projet, responsable de la logistique, responsable technique, responsable de la communication, responsable de la diffusion, responsable financier, responsable des partenariats, responsable de l’action internationale, responsable de l’action culturelle, responsable «Solidarités»…"
							},
							{
								"obj": "Transmettre son projet",
								"sit": "Synthétiser ses résultats, faire le bilan de son action (par rapport aux objectifs souhaités au moment du lancement du projet).Valoriser et transmettre son expérience (capitalisation des acquis d’apprentissage) : recruter d’éventuels repreneurs du projet, rédiger son C.V., construire son porte-folio"
							}
						]
					},
					{
						"nom": "Projet Professionnel",
						"semestre": 2,
						"coeff": 1,
						"nb_heures": 16.5,
						"repartition": [0, 0, 16, 0, 0, 0, 4.5],
						"supports": ["moodle"],
						"resume": "",
						"contenu": "Dans cet atelier, chaque étudiant est amené à se poser des questions sur ses traits de caractères et sur ses valeurs au travail. Il entame la rédaction de son livre de bord par le renseignement de son portefeuille de compétences.\n\nEn parallèle, il découvre le marché de l’emploi dans le numérique en France. Il sélectionne un ou deux métiers et réalise une interview d’un ingénieur en entreprise.",
						"objectifs/situations": [
							{
								"obj": "Découvrir le marché",
								"sit": "Présentation d’au moins une interview d’ingénieur réalisée en entreprise."
							},
							{
								"obj": "Réfléchir à son projet professionnel",
								"sit": "Présenter la cohérence entre ses valeurs, ses traits de caractères et ses compétences"
							},
							{
								"obj": "Présenter son travail",
								"sit": "Présenter à l'oral devant la classe"
							}
						]
					},
					{
						"nom": "Techniques d'expression : Présentation orales",
						"semestre": 2,
						"coeff": 1,
						"nb_heures": 13.5,
						"repartition": [0, 0, 13.5, 0, 0, 0],
						"supports": [],
						"resume": "Le métier d’ingénieur nécessite des compétences multiples qui s’inscrivent au-delà du périmètre technique et scientifique.\n\nLors des modules de techniques d’expression vous serez amenés à exercer votre esprit critique et développer vos capacités d’analyse, de synthèse et d’expression nécessaires dans le cadre de vos activités professionnelles.\n\nDans la continuité du travail élaboré en L1, vous travaillerez en mode projet sur des sujets variés, à dimension culturelle et sociétale, qui vous permettront de soutenir et de développer vos compétences en communication.",
						"contenu": "- Créativité sur les trois axes de l’expression orale\n\n- Atelier d'Expression Physique et Vocale\n\nLa «Présence » :\nTravail sur l’« Etre » (Etre là, Etre soi-même, Etre « naturel »)\nL’impression faite sur Autrui (Bonne, mauvaise, Définitive, Irrationnelle)\n\nGagner en assurance et affirmation de Soi\n- Pratique de l'analyse critique orale\n- Initiation à l'Animation de Réunion",
						"objectifs/situations": [
							{
								"obj": "(Se) Présenter dans des environnements multiples",
								"sit": "Mises en situation ; Réalisation de clip vidéo"
							},
							{
								"obj": "Mobiliser l’attention de son public",
								"sit": "Improvisation, sketchs de théâtre, prises de parole courtes et préparées"
							},
							{
								"obj": "Valoriser un travail / une personne en utilisant des supports variés",
								"sit": "Présenter à l’oral un projet en utilisant des supports (visuels, écrits, sonores,…)"
							},
							{
								"obj": "S'entrainer à soutenir un dossier / projet",
								"sit": "Soutenance en groupe d’un projet en se conformant à un cahier des charges"
							},
							{
								"obj": "Connaitre les règles de la rhétorique",
								"sit": "Débats préparés en petits groupes"
							},
							{
								"obj": "S’entrainer à l’argumentation",
								"sit": "Débats contradictoires"
							}
						]
					},
					{
						"nom": "Anglais et TOEIC",
						"semestre": 2,
						"coeff": 3,
						"nb_heures": 21,
						"repartition": [0, 0, 21, 0, 0, 0],
						"supports": ["doc_papier", "powerpoint", "audio", "video", "web", "ordinateur"],
						"resume": "Through the business start-up coursework and project, students acquire vocabulary from the business environment: human resources, organization charts, marketing, finance. This vocabulary is tested extensively on the TOEIC. In pairs, students invent a fictional start-up. They write up a business plan (practice in the use of professional written English) and present their project to a jury of potential investors (practice in professional presentation language, practice in the use of persuasive language). Continuous feedback on writing and speaking.",
						"contenu": "The language of the world of work: entrepreneurship, organization chart, marketing, finance.\n\n- Trends in marketing\n\n- Reading articles on entrepreneurs and innovative companies from the print media; watching similar reports from television\n\n- Multiple writing assignments with instructor feedback\n\n- Preparation of a business plan\n\n- Preparation of a persuasive presentation",
						"objectifs/situations": [
							{
								"obj": "Speak for 2 mins in a focused and precise way to explain and sell an idea, using pronunciation which is understandable to a non-French listener",
								"sit": "After viewing several examples, production and performance of an Elevator Pitch"
							},
							{
								"obj": "Understand spoken English in a specific targeted context (business start-up)",
								"sit": "Videos accompanied by teacher-developed listening comprehension exercises (Dragon's Den)"
							},
							{
								"obj": "Write clear understandable English in a formal style using precise terms from the world of work, for a specific purpose",
								"sit": "Production of a written business plan as part of final evaluation"
							},
							{
								"obj": "Present an idea before an audience, in detail using logical structure with clear pronunciation.",
								"sit": ""
							}
						]
					},
					{
						"nom": "LV2, FLE, anglais renforcé",
						"semestre": 2,
						"coeff": 0,
						"nb_heures": 15,
						"repartition": [0, 0, 15, 0, 0, 0],
						"supports": ["doc_papier", "powerpoint", "audio", "video", "web", "ordinateur"],
						"resume": "- Acquérir les compétences communicatives et interculturelles dans la langue choisie\n\n- Préparer des tests de niveau certifiants (TOEIC, Goethe Zertifikat, Cervantes, …)\n\n- Acquérir un niveau de maîtrise des structures grammaticales de la langue choisie permettant une communication simple mais non ambiguë",
						"contenu": "A la discrétion de l’enseignant. Peut inclure...\n\n- Etude de textes d’actualité\n\n- Ecoute d’enregistrements audiovisuels\n\n- Expression orale sur des sujets personnels ou professionnels\n\n- Expression écrite sur des sujets personnels ou professionnels\n\n- Exercices de grammaire\n\n- Apprentissage de vocabulaire\n\n- Présentation d’exposés\n\n- Expression interactive/ débats",
						"objectifs/situations": [
							{
								"obj": "Etre capable, à l’aide d’un dictionnaire, de comprendre des textes dans la langue cible.",
								"sit": "Lecture de textes authentiques dans la langue cible, que cela soit en classe ou à la maison. Des textes peuvent également être publiés sur le Moodle ou envoyés par une plateforme d'apprentissage en ligne. A la discrétion de l'enseignant, certaines de ces lectures peuvent être accompagnées d'une évaluation de compréhension donnant lieu à une note."
							},
							{
								"obj": "Etre capable, à l’aide d’un dictionnaire, d’écrire des textes compréhensibles dans la langue cible (email, CV, lettre de motivation...)",
								"sit": "Rédaction de textes dans la langue cible, dans la langue cible, que cela soit en classe ou à la maison. A la discrétion de l'enseignant, certaines de ces rédactions peuvent donner lieu à une note."
							},
							{
								"obj": "Etre capable de suivre une conversation ou un document audio-visuel bref, dans la langue cible.",
								"sit": "Ecoute de documents authentiques dans la langue cible, que cela soit en classe ou à la maison. Des textes peuvent également être publiés sur le Moodle ou envoyés par une plateforme d'apprentissage en ligne. A la discrétion de l'enseignant, certaines de ces documents audio ou audio-visuel peuvent être accompagnés d'une évaluation de compréhension donnant lieu à une note."
							},
							{
								"obj": "Etre capable de se faire comprendre dans la langue cible de façon non ambiguë",
								"sit": ""
							}
						]
					},
					{
						"nom": "Activité information-communication : APIC",
						"semestre": 2,
						"coeff": 1,
						"nb_heures": 4.5,
						"repartition": [0, 4.5, 0, 0, 0, 0],
						"supports": [],
						"resume": "Suite ou approfondissement des notions abordées au premier semestre",
						"contenu": "",
						"objectifs/situations": []
					}
				]
			}
		]
	},
	{
		"année": 3,
		"blocs": [
			{
				"nom": "Mathématiques et informatique",
				"ratio": 38,
				"matières": [
					{
						"nom": "Probabilités",
						"semestre": 1,
						"coeff": 1.5,
						"nb_heures": 21,
						"repartition": [21, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "Ce module présente les outils probabilistes de base qui, au-delà de leur importance et utilité intrinsèques, sont nécessaires à la compréhension du module de Statistiques du second semestre, dont les applications dans des domaines très divers sont nombreuses : Epidémiologie, Finances, Assurances, Informatique …\n\nLes éléments probabilistes ou (et) statistiques dispensés dans ce module peuvent aussi être utilisés par les étudiants pour agrémenter leurs projets intermédiaires ou de fin d’études, de traitements statistiques de données.\n\nLes outils contenus dans ce module sont également indispensables pour suivre convenablement plusieurs modules de 4A, dont : Processus stochastiques, Signaux aléatoires et Analyse des données et la data science en 5A",
						"contenu": "1- Espaces probabilisés\n\n- Introduction et rappels\n\n- Expérience aléatoire\n\n- Evénements\n\n- Espace des épreuves\n\n- Langage des événements\n\n- Notion de probabilité\n\n- Espace probabilisé fini\n\n- Calcul d’une probabilité sur un espace probabilisable fini\n\n- Equiprobabilité\n\n- Espace probabilisé : cas général\n\n- Sigma-algèbre (ou Tribu) ;\n\n- Système complet d’événements\n\n\n2. Probabilités conditionnelles\n\n- Introduction\n\n- Probabilités conditionnelles\n\n- Formule des probabilités composées\n\n- Formule des probabilités totales\n\n- Formule de Bayes\n\n\n3. Indépendance en probabilité\n\n- Indépendance de deux événements\n\n- Indépendance d’une suite d’événements\n\n\n4. Généralités sur les variables aléatoires réelles\n\n- Définitions\n\n- Opérations\n\n- Fonction de répartition\n\n- Fonction génératrice\n\n\n5. Variables et vecteurs aléatoires discrets finis\n\nVariables aléatoires discrètes finis\n- Loi de probabilité d’une variable aléatoire réelle discrète finie\n\n- Fonction de répartition d’une variable aléatoire réelle discrète finie\n\n- Loi d’une fonction d’une variable aléatoire réelle discrète finie\n\n- Moments d’une variable aléatoire réelle discrète finie ; Espérance mathématique ; Variance et Ecart type.\n\nCouple de variables aléatoires discrètes finies\n- Loi de probabilité d’un couple de variables aléatoires réelles discrètes finies\n\n- Lois marginales\n\n- Indépendance de deux variables aléatoires réelles discrètes finies\n\n- Covariance et coefficient de corrélation linéaire\n\n- Lois conditionnelles ;\n\n- Espérance et variance conditionnelles\n\n\n6. Lois discrètes usuelles\n\nLois discrètes finies\n- Loi de Bernoulli\n\n- Loi binomiale\n\n- Loi hypergéométrique\n\n- Loi uniforme sur l’intervalle entier [1, n]\n\n\nLois discrètes infinies\n- Loi géométrique\n\n- Loi de Poisson\n\n\n7. Variables et vecteurs aléatoires réels continus\n\nVariables aléatoires réelles continues\n- Densité et fonction de répartition\n\n- Exemples de fonctions d’une v.a.r. à densité\n\n- Espérance mathématique\n\n- Variance et Ecart type\n\n- Densité d’une somme de deux v.a.r. continues indépendantes\n\n- Fonction génératrice\n\n- Fonction caractéristique\n\nVecteurs aléatoires réels continus\n- Couple de variables aléatoires réelles continues\n\n- Loi de probabilité d’un couple de variables aléatoires réelles continues\n\n- Lois marginales\n\n- Lois conditionnelles\n\n- Indépendance de deux variables aléatoires réelles\n\n- Covariance et coefficient de corrélation linéaire\n\n- Espérance et variance conditionnelles\n\n- Généralisation à un vecteur aléatoire de dimension n\n\n\n8. Lois continues usuelles\n\n- Loi normale\n\n- Loi du Khi 2\n\n- Loi de Fisher\n\n- Loi de Student\n\n\n9. Convergences\n\n- Inégalité de Bienaymé-Tchebychev\n\n- Loi faible des grands nombres\n\n- Convergence en loi et approximations\n\n- Théorème de la limite centrée\n\n- Approximation de la loi binomiale par la loi de Poisson\n\n- Approximation de la loi hypergéométrique par la loi binomiale\n\n- Approximation de la loi binomiale par la loi normale",
						"objectifs/situations": [
							{
								"obj": "Appréhender les concepts de la théorie des probabilités et des statistiques",
								"sit": "Cours et exercices d’application"
							},
							{
								"obj": "Identifier les conditions d’applications et d’utilisation des outils sur des cas concrets\n\nAppliquer les techniques statistiques dans différents domaines d’ingénierie (sécurité, médical, aide à la décision, processus industriels, finance…)",
								"sit": "Préciser les types de situation d’exercices correspondant aux objectifs"
							}
						]
					},
					{
						"nom": "Réseaux IP",
						"semestre": 1,
						"coeff": 1,
						"nb_heures": 18,
						"repartition": [0, 18, 0, 0, 0, 0],
						"supports": ["doc_numerique", "powerpoint"],
						"resume": "Expliquer le fonctionnement d'un réseau local filaire et des protocoles Ethernet et IP",
						"contenu": "- GÉNERALITÉS\n\n- Historique : De shape à l'ENIAC, du traitement centralisé au cloud computing\n\n- Normalisation : Le modèle OSI, l'IEEE 802, l'IETF, l'UIT\n\n- Classification : en fonction de l'espace, de la topologie et de l'emploi\n\n- LES TECHNOLOGIES D'ACCÈS\n\n- Les supports filaires, les méthodes d'accès (accès concurrentiels, la commutation, l'adressage physique)\n\n- INTERNET\n\n- historique, fonctionnement, le DNS, la box\n\n- ETHERNET et TCP-IP\n\n- en simultané avec LAB3418",
						"objectifs/situations": [
							{
								"obj": "En terme de normalisation des réseaux, les étudiants seront capables d'énumérer les principaux organismes et leur domaine de compétence",
								"sit": "Donner les couches du modèle OSI/ TCP/IP\n\nDonner les organismes ainsi que leur implication et le secteur touché par ces derniers"
							},
							{
								"obj": "Les étudiants seront capables de classer les réseaux. Ils sauront évaluer la qualité et la performance d'une technologie réseau en fonction de ces modes d'exploitation",
								"sit": "Répondre à un appel d’offre en présentant les avantages et les inconvénients des technologies qu’ils proposent."
							},
							{
								"obj": "Les étudiants seront capables de décrire et de caractériser les supports électriques exploités dans les réseaux locaux. Ils pourront juger de la qualité d'installation par rapport aux normes en vigueur.",
								"sit": "Proposer des technologies spécifiques vis-à-vis de problématique imposée."
							},
							{
								"obj": "Les étudiants seront capables de décrire le fonctionnement de Ethernet et TCP-IP.",
								"sit": ""
							}
						]
					},
					{
						"nom": "TP Réseaux IP",
						"semestre": 1,
						"coeff": 1,
						"nb_heures": 18,
						"repartition": [0, 0, 0, 18, 0, 0],
						"supports": ["doc_papier", "doc_numerique", "powerpoint", "ordinateur"],
						"resume": "Mettre en pratique les connaissances du cours INF3037",
						"contenu": "LAB1 : Rappel des commandes système Linux\n\nLAB2 : Prise en main des équipements (physiques ou simulés)\n\nLAB3 : Micro LAN\n\nLAB4 : Mini LAN\n\nLAB5 : Le routage statique\n\nLAB6 : VLAN et routage inter-VLAN\n\nLAB7 : La résolution de nom",
						"objectifs/situations": [
							{
								"obj": "Créer un réseau local personnel filaire",
								"sit": "Rapport à remettre à la fin de chaque séance"
							},
							{
								"obj": "Définir et administrer une plan d'adressage IP",
								"sit": "Rapport à remettre à la fin de chaque séance"
							},
							{
								"obj": "Administrer des équipements actifs de réseau",
								"sit": "Rapport à remettre à la fin de chaque séance"
							},
							{
								"obj": "Administrer des services réseau.",
								"sit": ""
							}
						]
					},
					{
						"nom": "Programmation orientée objet : POO",
						"semestre": 1,
						"coeff": 1.5,
						"nb_heures": 24,
						"repartition": [0, 9, 0, 15, 0, 0],
						"supports": ["powerpoint", "ordinateur", "web"],
						"resume": "Appliquer les concepts fondamentaux de l'approche Objet (décomposition d’un problème en concepts ou objets et réalisation des fonctionnalités attendues par les interactions entre les objets) pour concevoir et réaliser des programmes informatiques",
						"contenu": "• Principes de l'approche objet et son impact dans la définition d'un langage\n\n• Introduction du langage Java (machine virtuelle, GC, ...)\n\n• Classes, Objets, Références vs pointeurs, Constructeurs, membres statiques\n\n• Extensibilité (héritage), mode protégé, classes abstraites, interfaces\n\n• Gestion des erreurs (Exceptions)\n\n• Gestion des E/S, Sérialisation et graphe d'objets\n\n• Généricité, Collections\n\n• IHM avec SWING",
						"objectifs/situations": [
							{
								"obj": "Identifier les composantes d’un objet élémentaire (ses attributs propres et sa capacité à interagir avec les autres objets) et d’un objet complexe (composé d’autres objets)",
								"sit": "Savoir répondre à des questions sur le sujet. (papier/crayon)"
							},
							{
								"obj": "Décomposer le processus de réalisation d’une fonctionnalité attendue comme le résultat d’interactions entre les objets",
								"sit": "Savoir répondre à des questions sur le sujet. (papier/crayon)"
							},
							{
								"obj": "Connaître les concepts fondamentaux des langages objet (classes, encapsulation, héritage, polymorphisme), références vs pointeurs, Gestion de la mémoire, Gestion des erreurs, Généricité",
								"sit": "Coder ces concepts en java"
							},
							{
								"obj": "Être capable d’interpréter une modélisation orientée objet d’une application",
								"sit": "Être capable de réaliser un programme à partir à partir d’une modélisation sous forme de diagrammes à la “UML”"
							},
							{
								"obj": "Être capable d’utiliser les bibliothèques principales (E/S, collections, ...)",
								"sit": "Savoir les utiliser pour créer efficacement des applications"
							},
							{
								"obj": "Être capable de réaliser une IHM élémentaire",
								"sit": "Savoir créer une application objet avec une interface graphique"
							},
							{
								"obj": "Savoir faire la différence entre le compilateur java et la machine virtuelle java",
								"sit": ""
							},
							{
								"obj": "Bien différencier la programmation itérative et l’approche objet",
								"sit": "Savoir structurer son code selon les normes objet en vigueur"
							}
						]
					},
					{
						"nom": "Projet POO",
						"semestre": 1,
						"coeff": 1,
						"nb_heures": 15,
						"repartition": [0, 1.5, 4.5, 0, 9, 0],
						"supports": [],
						"resume": "Concevoir et réaliser un projet Java réactualisant les savoirs vu en TD (Bases du Java, String, Collections, Persistence, GUI).\n\nLe projet doit être pensé en amont et finalisé à destination d'un client potentiel (contrairement aux TDs qui sont très cadrés)",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "Appliquer les concepts fondamentaux de l'approche Objet (décomposition d’un problème en concepts ou objets et réalisation des fonctionnalités attendues par les interactions entre les objets) pour concevoir et réaliser des programmes informatiques",
								"sit": "Concevoir et réaliser un projet Java en mobilisant les savoirs vus en cours (Bases du Java, String, Collections, Persistence, GUI)."
							},
							{
								"obj": "Concevoir dans son intégralité le projet (réflexion, structure, code et debug).",
								"sit": "Le projet doit être totalement finalisé comme s'il était à destination d'un client potentiel (contrairement aux TDs qui sont très cadrés)"
							}
						]
					},
					{
						"nom": "Systèmes d'exploitation",
						"semestre": 1,
						"coeff": 2,
						"nb_heures": 30,
						"repartition": [0, 15, 0, 15, 0, 0],
						"supports": ["doc_numerique", "powerpoint", "ordinateur", "web"],
						"resume": "Présentation et exploitation des fonctions élémentaires d'un système d'exploitation.",
						"contenu": "- Présentation des systèmes Unix/Linux (rôles d'un OS, historique, licences)\n\n- La séquence de démarrage\n\n- Plateformes multi-systèmes ou virtualisées\n\n- Prise en main (environnement graphique, présentation du shell)\n\n- Les commandes de base\n\n- La gestion des logiciels (installation de paquetages, gestion des dépendances, compilation de sources)\n\n- Les Systèmes de Fichiers (les partitions, l'arborescence)\n\n- La gestion des utilisateurs (caractéristiques des utilisateurs, gestion des groupes)\n\n- La gestion des processus (suivi de l'activité, lancement, arrêt d'un processus)\n\n- Initiation aux scripts Shell (les variables, les tests et les boucles)",
						"objectifs/situations": [
							{
								"obj": "- Installer, configurer et exploiter un système d'exploitation Linux sur une architecture multisystème (multi-boot) ou virtualisée (Virtualbox).\n\n- Exploiter les fonctions élémentaire du système",
								"sit": "- Évaluation directe pendant les cours (type quizzoodle)\n\n- Questionnaire d'évaluation des connaissances en fin de module (numérique sous Moodle ou papier)\n\n- TP notés"
							}
						]
					},
					{
						"nom": "Projet C",
						"semestre": 1,
						"coeff": 1,
						"nb_heures": 24,
						"repartition": [0, 1.5, 7.5, 0, 15, 0],
						"supports": ["doc_numerique", "ordinateur"],
						"resume": "Permettre aux étudiants de continuer à pratique le langage C , en prévision de modules de 4A où ce sera nécessaire. (il n'y a pas de pratique de ce langage en 3A...).\n\nIl s'agit aussi d'un module d'approfondissement. Il s'agit d'un module qui a aussi pour but rendre les étudiants plus autonome (il n'y a pas vraiment d'heure de cours associé, même si il peut y avoir quelques séances d'introduction et d'aides.)",
						"contenu": "Projet logiciel en langage C",
						"objectifs/situations": [
							{
								"obj": "Modéliser un problème et le résoudre",
								"sit": "Etudier un problème soumis par l’enseignant et le mettre « en équation »/le modéliser pour générer un algorithme adapté. (papier/crayon)\n\nFaire une recherche ciblée et efficace d’informations pour résoudre le problème. Trier les informations et identifier les plus pertinentes. (bibliographie/webographie)"
							},
							{
								"obj": "Pratiquer le langage C",
								"sit": "Implémenter un projet utilisant des notions à réviser (pointeurs, récursivité, structures, fichiers, arbres, graphes, …). (machine)\n\nUtiliser le débogueur pour tracer l’exécution du programme et détecter bugs & fuites mémoires. (machine)"
							}
						]
					},
					{
						"nom": "Bases de données",
						"semestre": 1,
						"coeff": 1.5,
						"nb_heures": 24,
						"repartition": [0, 9, 6, 9, 0, 0],
						"supports": ["powerpoint", "web"],
						"resume": "Présentations des SGBD, concepts relationnels,modélisation, apprentissage approfondi du langage d'interrogation de bases de données SQL.",
						"contenu": "- Introduction aux bases de données et à la modélisation\n\n- Introduction au language SQL - créer des tables, contraintes\n\n- Initiation à la modélisation d’une BDD\n\n- Approfondissement des techniques de requêtes SQL LMD",
						"objectifs/situations": [
							{
								"obj": "Comprendre le langage SQL et la conception des schémas logiques de bases de données relationnelles.",
								"sit": "- Questionnaire d'évaluation des connaissances"
							},
							{
								"obj": "- Concevoir des BDD relationnelles",
								"sit": "- Questionnaire d'évaluation des connaissances"
							},
							{
								"obj": "- Concevoir des requêtes SQL",
								"sit": "- Questionnaire d'évaluation des connaissances"
							}
						]
					},
					{
						"nom": "Programmation WEB",
						"semestre": 1,
						"coeff": 1.5,
						"nb_heures": 18,
						"repartition": [7, 0, 0, 11, 0, 0],
						"supports": ["powerpoint", "ordinateur", "web"],
						"resume": "Créer un site web simple sans framework à partir des langages du Web que sont l’HTML, le CSS, le Javascript et le PHP",
						"contenu": "Présentation du protocole HTTP.\n\nPrésentation de l’HTLM avec exercice pratique (~30min – 1h) – formater une page avec des balises HTML.\n\nPrésentation du CSS avec exercice pratique (~30min – 1h) – utilisation de flexbox sur une page HTML simple pour que les composants soient placés exactement où on le souhaite et que la page soit responsive (les composants s’adaptent automatiquement à la résolution)\n\nPrésentation de JavaScript avec exercice pratique (~30min – 1h) – Animation simple en modifiant dynamiquement du CSS.\n\nPrésentation du concept Client / Serveur.\n\nPrésentation du PHP avec exercice pratique (~30min – 1h) – Questionnaire avec réaction du serveur suivant la réponse. Mise en place d’une session utilisateur PHP (simplement avec une table de hashage dans une variable globale, pas de BDD).\n\n\nTP création d’un site web\n\n\nContenu au choix de l’étudiant avec contraintes :\n\n* Pas de framework ou bibliothèque autre que ceux fournis par HTML, PHP, JavaScript et PHP.\n\n* Doit contenir un bandeau de menu.\n\n* Doit contenir une partie dynamique côté client (JavaScript).\n\n* Doit être responsive.\n\n* Doit avoir une gestion d’utilisateurs (avec ou sans BDD, peut être une liste d’utilisateurs codés en dur ou stockée simplement dans un fichier).\n\n* Doit avoir une partie dynamique côté serveur (réagissant différemment suivant les utilisateurs ou que l’on soit simple visiteur).",
						"objectifs/situations": [
							{
								"obj": "Maitriser les base de l’HTML, du CSS, du Javascript et du PHP",
								"sit": "TP évalué"
							},
							{
								"obj": "Différentier le client du serveur !",
								"sit": "TP évalué"
							}
						]
					},
					{
						"nom": "Statistique",
						"semestre": 2,
						"coeff": 1.5,
						"nb_heures": 21,
						"repartition": [0, 9, 15, 0, 0, 0],
						"supports": ["doc_papier", "doc_numerique", "logiciel_R"],
						"resume": "Ce module a pour but de savoir structurer et de représenter l’information contenue dans un jeu de données d’une part, et de savoir obtenir des renseignements (ou une modélisation) d’un certain caractère défini sur une population à l’aide de mesures effectuées sur un échantillon de cette population d’autre part.",
						"contenu": "Rappel de statistique descriptive : caractéristiques de position, de dispersion et de forme.\n\nEstimation ponctuelle d’une moyenne ou d’une proportion ;\n\nEstimation par intervalle de confiance d’une moyenne ou d’une proportion ;\n\nComparaison de moyennes ou de proportions de deux populations indépendantes;\n\nTests du Khi-deux d’adéquation et d’indépendance;\n\nAjustement linéaire.\n\nRegression linéaire simple par MCO ( Moindres carrés ordinaires)\n\nANOVA (ANalysis Of VAriance)",
						"objectifs/situations": [
							{
								"obj": "Savoir caractériser numériquement une série statistique",
								"sit": "Savoir déterminer la moyenne, la médiane, le mode, les quantiles, les moments, l’étendue, la variance, l’écart type et l’écart absolu moyen."
							},
							{
								"obj": "Savoir représenter graphiquement une série statistique",
								"sit": "Savoir tracer un histogramme, un diagramme en bâtons et la courbe des effectifs et des fréquences cumulés."
							},
							{
								"obj": "Savoir estimer ponctuellement et par un intervalle de confiance une moyenne ou une fréquence",
								"sit": "Savoir déterminer un degré de confiance à accorder à la moyenne ou à la fréquence issue d’un échantillon."
							},
							{
								"obj": "Savoir comparer deux fréquences ou deux moyennes de deux populations",
								"sit": "Savoir déterminer un degré de confiance à accorder à la différence observée entre deux productions de deux machines."
							},
							{
								"obj": "Savoir utiliser un test d’ajustement et un test d’indépendance en utilisant la loi du Khi-deux.",
								"sit": "Savoir trouver la loi suivie par la variable étudiée.\n\nSavoir déterminer l’intensité du lien entre deux variables qualitatives."
							},
							{
								"obj": "Savoir mener à bien une procédure d’ajustement d’un nuage de points par une fonction affine",
								"sit": "Savoir déterminer les paramètres du modèle d’ajustement linéaire."
							}
						]
					},
					{
						"nom": "Algorithme, calculabilité et complexité",
						"semestre": 2,
						"coeff": 1,
						"nb_heures": 21,
						"repartition": [0, 9, 12, 0, 0, 0],
						"supports": ["powerpoint", "moodle"],
						"resume": "Le cours vise à donner aux étudiants les moyens d'appréhender la notion de calcul et de complexité en informatique, et donc de leur permettre de répondre aux trois questions suivantes :\n- Algorithmique : qu’est-ce qu’un calcul ?\n- Calculabilité : peut-on tout calculer ?\n- Complexité : peut-on calculer efficacement ?\n\nPour cela, il introduit les fondements de la théorie des automates finis, y compris les notions de langage formel, de grammaire, d’automate fini.\n\nIl aborde également la théorie de la décidabilité et de la calculabilité, notamment la notion de machine de Turing et de problème décidable.\n\nEnfin, il définit les premiers éléments de la théorie de la complexité algorithmique, à savoir les notions de complexité en temps et en espace et de classes de complexité.",
						"contenu": "1) Théorie des automates finis\n\n- langage formel et grammaire algébrique\n- automates finis déterministes et non déterministes, expressions régulières, lemme de l'étoile\n- machines de Turing\n- modèles de Kripke\n\n2) Théorie de la décidabilité et de calculabilité\n\n- problème de décision vs. d'évaluation.\n- codage et représentation\n- décidabilité d'un problème et machine de Turing universelle\n- existence d'un problème indécidable : le problème de l'arrêt\n\n3) Théorie de la complexité algorithmique\n\n- évaluation de la complexité d'un problème, notions de O et o\n- problème résoluble de façon déterministe ou non déterministe\n- complexité temporelle : classes P, NP, EXPTIME, NEXPTIME\n- complexité spatiale\n- problème NP-complet\n- utilisation de la complexité d'un problème en cryptologie : systèmes à clef publique",
						"objectifs/situations": [
							{
								"obj": "Comprendre ce qu'est un calcul au sens informatique et logique du terme.",
								"sit": "Découverte de la notion de langage formel et de grammaire.\n\nPrésentation de différents modèles de calcul (automates finis, machines de Turing).\n\nPrésentation d'une autre vision des automates : les modèles de Kripke et les vérifications sur l'exécution d'un système"
							},
							{
								"obj": "Déterminer si un problème est décidable ou calculable.",
								"sit": "Présentation de la notion de problème de décision vs. d'évaluation.\n\nPrésentation des notions de codage et de représentation.\n\nMise en évidence que tout problème n'est pas décidable."
							}
						]
					},
					{
						"nom": "Génie logiciel et Projet GLPOO",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 24,
						"repartition": [0, 12, 9, 9, 15, 0],
						"supports": ["doc_papier", "doc_numerique", "ordinateur", "web"],
						"resume": "Comprendre les concepts fondamentaux de l'approche Objet pour l'analyse, la conception et la programmation.\n\nSavoir mettre en oeuvre un processus de développement logiciel unifié et/ou Agile.\n\nCompétences visées :\n\n- Bonne maîtrise du langage Java\n- Bonne maîtrise de la notation UML\n- Bonne maîtrise d'un IDE\n- Bonne maîtrise de l'Agilité\n- Bonne maîtrise des tests\n- Bonne maîtrise du travail en équipe",
						"contenu": "Java\n\nUML\n\nEclipse\n\nOutils de test : JUnit, TDD, 3T\n\nIHM : Swing, Mockup\n\nDesign patterns\n\nDAO : JDBC, JPA, CVS\n\nMéthodes agiles : Scrum, Xp, Kanban\n\nMaven Jenkins\n\nSCM : Subversion, Git",
						"objectifs/situations": [
							{
								"obj": "Discuter d'une conception technique à l'aide d'une représentation commune normalisée",
								"sit": "Utilisation d’UML en TP, évaluation et projet"
							},
							{
								"obj": "Appréhender la méthodologie agile",
								"sit": "Gérer (participer) un projet de manière agile"
							},
							{
								"obj": "Comprendre et maitriser les outils de gestion de code",
								"sit": "Utilisation de SVN et Git, github, en projet et évaluation"
							},
							{
								"obj": "Comprendre et maitriser les principaux design patterns",
								"sit": "Utilisation des patterns le GOF. en TP, évaluation et projet."
							},
							{
								"obj": "Comprendre et maitriser les bonnes pratiques de développement",
								"sit": "Utilisation de TDD, 3T, Xp, conventions. n TP, évaluation et projet."
							}
						]
					},
					{
						"nom": "Administration systèmes",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 21,
						"repartition": [0, 3, 0, 18, 0, 0],
						"supports": [],
						"resume": "Administrer des systèmes d'exploitation dans l'environnement d'un Réseau Local d'Entreprise (RLE)",
						"contenu": "- Présentation du rôle de l’administrateur,\n\n- Rappel sur les devoirs en termes de sécurité et d’éthique,\n\n- Présentation de la philosophie A.D.,\n\n- Installation et paramétrage d’un A.D.,\n\n- Mise en place d’une architecture type (utilisateurs, station Windows, répertoires partagés, DNS, DHCP, NTP),\n\n- Déploiement d’une mise à jour par GPO (fenêtre de connexion, certificat)\n\n- Présentation des principes d’interconnexion Linux/Windows (Kerberos),\n\n- Intégration d’une station Linux,\n\n- Mise en oeuvre d'un gestionnaire de parc informatique (GLPI, OCS Inventory, journalisation, WSUS, Puppet)\n\n- Mise en oeuvre des sauvegardes (répertoires partagés, journaux, ...)",
						"objectifs/situations": [
							{
								"obj": "- Installer, configurer et exploiter un Active Directory © (A.D.) ;\n\n- Interconnecter des équipements clients (Linux, Windows, imprimantes) et interagir avec l'A.D. ;\n\n- Gérer les mises à jour, les journaux et les sauvegardes,\n\n- Prendre en compte les problé",
								"sit": "- Évaluation directe pendant le cours (type quizzoodle)\n\n- Questionnaire d'évaluation des connaissances (numérique type Moodle ou papier)"
							}
						]
					},
					{
						"nom": "Bases de données 2",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 18,
						"repartition": [0, 9, 0, 9, 0, 0],
						"supports": ["doc_numerique", "powerpoint"],
						"resume": "Mise en application des notions du module INF3031 Bases de données dans le cadre d’un projet de développement d’une application exploitant une base de dedonnnées.",
						"contenu": "Modélisation d’une BDD\n\n- Mise en oeuvre d’une BDD en prenant en compte les besoins d’optimisation et de sécurité\n\n- Optimisation des requêtes\n\n- Vues, procédures stockées et déclencheurs\n\n- Sécurisation des accès.",
						"objectifs/situations": [
							{
								"obj": "- Comprendre les techniques de développement complet d’une application utilisant une base de données.\n\nDévelopper des procédures stockées\n\nExploiter des vues",
								"sit": "- Réalisation d’une application avec sa documentation"
							}
						]
					},
					{
						"nom": "Programmation mobile",
						"semestre": 2,
						"coeff": 1.5,
						"nb_heures": 21,
						"repartition": [0, 3, 0, 18, 0, 0],
						"supports": ["powerpoint", "ordinateur"],
						"resume": "Apprendre les bases de la programmation mobile sous Android",
						"contenu": "Le cours s’attache à apprendre les bases de la programmation mobile et ces paradigmes en s’appuyant sur un projet de réalisation d’application mobile interfacée à un serveur web (fourni ou issu du module INF4041)\n\nL’application du TP sera réalisée sur Android.\n\nLes connaissances seront dispensées au fur et à mesure de l’avancement du TP pour permettre aux étudiants un aller-retour constant entre théorie et pratique.\n\nLe projet sera basé sur une idée libre validée. Il devra récupérer des données d’une API REST et les afficher dans des vues Android en utilisant les outils présentés en TP.",
						"objectifs/situations": [
							{
								"obj": "Maitrise des outils de base pour créer une interface graphique sur Android",
								"sit": "Utilisation d'Android Studio pour créer une application avec les outils de base (Intent, LinearLayout, RelativeLayout, RecyclerView, Fragment & Activity, ActionBar, ListView)"
							},
							{
								"obj": "Compréhension des cycles de vie des Activity, du concept de bac à sable, et des Fragments, ainsi que du fonctionnement du Manifest.",
								"sit": "Découverte de l'intérêt et des mécanismes des grands fonctionnement d'Android, à travers des cas particuliers de réalisation de partie de UI"
							},
							{
								"obj": "Comprendre la notion de service et implémenter une version basique.",
								"sit": "Au travers d'une requête http vers une API REST, nous découvrirons l'intérêt des services et leur fonctionnement."
							}
						]
					},
					{
						"nom": "Introduction aux thématiques de majeures",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 21,
						"repartition": [0, 15, 6, 0, 0, 0],
						"supports": ["powerpoint", "ordinateur"],
						"resume": "Découvrir les thématiques des majeures.",
						"contenu": "A) Cybersécurité (9h)\n- Qu'est-ce que la sécurité informatique (3h)\n- Introduction à la cryptographie (3h)\n- Introduction à la virologie (3h)\n\nB) Intelligence artificielle (6h)\nIntroduction à l’intelligence artificielle et à ses applications\n\nC) Intelligence artificielle (6h)\nIntroduction à la réalité virtuelle et à ses applications",
						"objectifs/situations": [
							{
								"obj": "Savoir identifier les problèmes généraux de sécurité informatique dans les domaines suivants :\n- comportements des utilisateurs,\n- organisation de la sécurité dans la société,\n- sécurisation des données.",
								"sit": "- Évaluation directe pendant le cours (type quizzoodle)\n\n- Questionnaire d'évaluation des connaissances (numérique type Moodle ou papier)"
							}
						]
					}
				]
			},
			{
				"nom": "Physique, électronique et systèmes",
				"ratio": 34,
				"matières": [
					{
						"nom": "Projet Scientifique et Technique : Définition du projet",
						"semestre": 1,
						"coeff": 1.5,
						"nb_heures": 30,
						"repartition": [0, 0, 15, 0, 15, 0],
						"supports": [],
						"resume": "Concevoir un système complexe (interactions de plusieurs sous-systèmes) : Définir, Modéliser, Simuler/tester, Valider le modèle sur un prototype, Expliquer le modèle, Comparer avec le réalisé, Proposer des axes d’amélioration, Réaliser le système améliorer, Valoriser son projet",
						"contenu": "Le Projet des Sciences de l’Ingénieur permet à l’étudiant de se confronter à la démarche projet de l’ingénieur, de développer le travail en équipe, les techniques de communication ainsi que le travail collaboratif.\n\nLes élèves constituent leur groupe (de 4 à 5 étudiants) et choisissent le domaine où ils souhaitent travailler.\n\nLe projet est réalisé sur les deux semestre\n\nL’objectif est de réaliser une application ou une expérimentation qui peut répondre à des besoins à moyen terme d’une entreprise, d’une association humanitaire ou d’un organisme à but pédagogique. Il repose sur une étude scientifique et technique, partant des pratiques concrètes en entreprise sur le sujet\n\nCette première partie est focalisée sur la définition du projets : expressions des besoin, spécifications fonctionnelles",
						"objectifs/situations": [
							{
								"obj": "Problématiser et délimiter le sujet",
								"sit": "Remise d'un document de cadrage du projet qui présente ce sur quoi porte le projet (le quoi ?)"
							},
							{
								"obj": "Identifier les problèmes à résoudre",
								"sit": "Remise d'un document de cadrage du projet qui présente une décomposition pertinente et cohérente de la démarche de réalisation"
							},
							{
								"obj": "Réguler la dynamique de groupe,\nOrganiser le travail,\nTravailler en équipe",
								"sit": "Organisation de réunion de suivis régulières permettant à l'équipe de l'avancement du projet, de la répartition des tâches entre les membres prochaines étapes."
							}
						]
					},
					{
						"nom": "Architecture d'un système à microprocesseur",
						"semestre": 1,
						"coeff": 2.5,
						"nb_heures": 27,
						"repartition": [0, 13.5, 0, 13.5, 0, 0],
						"supports": [],
						"resume": "- Savoir analyser l’architecture d’un système à microprocesseur, concevoir un système minimal comportant les éléments essentiels (processeur, mémoires ram et eeprom, interfaces d’entrée/sorties) pour le développement d’une application.\n\n- Comprendre les mécanismes de la programmation en assembleur.",
						"contenu": "Architecture d’un système à microprocesseur :\n- Présentation : la mémoire centrale, l’unité de commande et l’unité de traitement.\n- Supports et transferts de l’information : notion de bus, connexion de plusieurs circuits sur un bus, intérêt de la logique à trois états.\n- Transferts avec la mémoire centrale : aspects topographiques et temporels.\n- Exemple de conception d’un système minimal.\n- Applications : fabrication de plans mémoire.\n\nStructure interne et fonctionnement d’un microprocesseur :\n- Unité de traitement : constitution et rôle.\n- Unité de commande : structure, séquencement des opérations et jeu d’instructions.\n- Unité d’adressage : constitution et rôle.\n- Exemple d’exécution d’un programme simple.(exemple : famille X86 Intel)\n- Modes d’adressage : immédiat, inhérent, direct, étendu, relatif, indexé,...\n- Applications : manipulation de données en mémoire, configuration et utilisation de l’interface parallèle.\n\nMicrocontrôleurs : (familles Motorola et Microchip)\n- Introduction : spécificités, domaines d’application.\n- Constitution interne : mémoires intégrées, ports d’entrées/sorties, circuits de communication série, registres et accumulateurs internes, convertisseur analogique/numérique.\n- Modes d’adressage et jeu d’instructions.\n- Applications : lecture de données en provenance d’un clavier matriciel.\n\nProcesseur de traitement de signal, DSP :\n- Origine des DSP : comment sont-ils apparus ? Comparaisons des performances entre les circuits traditionnels à amplificateurs opérationnels et les circuits utilisant les DSP, principaux avantages de ceux-ci. Domaines d’application.\n- Architecture centrale : unité arithmétique et logique, unité de génération d’adresses, unité de contrôle de programme, notion d’accès et de transferts parallèles. Architecture de type HARVARD.\n- Modes d’adressage et jeu d’instruction : adressage linéaire et modulo, résumé des instructions, structure des lignes d’instruction.\n- Organisation d’un programme : définition des zones de travail pour les données et les instructions, exemples de programmation d'équations de récurrence utilisées en traitement du signal.\n- Applications : exemple faisant apparaître l’importance des transferts parallèles de données entre mémoires et registres internes et les avantages sur les processeurs classiques.",
						"objectifs/situations": [
							{
								"obj": "Expliquer l’architecture, concevoir les interfaces et les applications d’un système à microprocesseur de faible complexité.",
								"sit": "Analyser et reconnaitre l’architecture d’un système à microprocesseur.\n\nUtiliser les documentations techniques de fabricants.\n\nDévelopper une application de gestion des entrées/sorties en assembleur ou en langage C.\n\nRelier des périphériques aux bus du microprocesseur.\n\nUtiliser des périphériques (timer, UART,…) et développer les programmes de gestion."
							}
						]
					},
					{
						"nom": "Signal déterministe et Analyse de Fourier",
						"semestre": 1,
						"coeff": 3,
						"nb_heures": 45,
						"repartition": [0, 15, 15, 15, 0, 0],
						"supports": [],
						"resume": "Cet enseignement est une introduction au traitement du signal mettant l'accent sur les outils d'analyse deterministe de ces signaux : analyse de Fourier, concept d'échantillonnage, notion de filtrage,...\n\nL’objectif principal est la maîtrise des outils mathématiques et la réalisation des fonctions de filtrage.",
						"contenu": "1. REPRESENTATION DES SIGNAUX\n\n1.1 Introduction\n\n1.2 Signaux à temps continu et à temps discret\n\n1.3 Les signaux élémentaires\n\n1.4 Energie et puissances des signaux\n\n1.5 Analyse de Fourier : série et transformées de Fourier\n\nActivités assistées par ordinateur : Introduction a MATLAB\n\n\n2. ANALYSE CORRELATIVE DES SIGNAUX\n\n2.1 Signaux d’énergie finie\n\n2.2 Signaux de puissance moyenne finie\n\nActivités assistées par ordinateur : Série de Fourier\n\n\n3. FILTRAGE LINEAIRE\n\n3.1 Réponse impulsionnelle et réponse fréquentielle\n\n3.2 Filtrage de signaux d’énergie finie\n\n3.2 Les filtres élémentaires\n\n3.3 Modulation d’amplitude\n\nActivités assistées par ordinateur : Fonctions de corrélation\n\n\n4. ECHANTILLONNAGE\n\n4.1 Introduction\n\n4.2 Les signaux à bande limitée\n\n4.3 Le théorème d’échantillonnage\n\n4.4 Echantillonnage parfait\n\n4.5 Repliement ou recouvrement de spectre\n\n4.6 Filtre anti-repliement\n\nActivités assistées par ordinateur : Echantillonnage\n\n\n5. LA TRANSFORMEE DE FOURIER DISCRETE ET LA TRANSFORMEE DE FOURIER RAPIDE\n\n5.1 La transformée de Fourier discrète\n\n5.2 La transformée de Fourier rapide\n\n\n6. LA TRANSFORMEE EN z\n\n6.1 Définition et généralités\n\n6.2 Inversion de la transformée en z\n\n6.2.1 Inversion d’une fraction rationnelle\n\n6.2.2 Inversion par le théorème des résidus\n\n6.3 Propriétés de la transformée en z\n\n6.4 Stabilité d’un signal\n\n\n7. FILTRAGE NUMERIQUE\n\n7.1 Introduction\n\n7.2 Classification des filtres\n\n7.3 Filtres à réponse impulsionnelle finie\n\n7.3.1 Filtres à phase linéaire\n\n7.3.2 Synthèse d’un filtre RIF par la méthode de la fenêtre\n\nActivités assistées par ordinateur : Conception de filtres numériques",
						"objectifs/situations": [
							{
								"obj": "Calculer le développement en série de Fourier d'un signal périodique d'énergie finie sur une période.",
								"sit": "Pour un signal périodique d'énergie finie sur sa période,\n\n- calculer ses coefficients de Fourier\n- calculer sa puissance moyenne\n- représenter graphiquement (matlab) son développement à l'ordre n (pour différentes valeurs de n)"
							},
							{
								"obj": "Savoir calculer la transformée de Fourier d'un signal stable (L1) ou d'un signal d'énergie finie (L2)",
								"sit": "Pour un signal donné, vérifier à quel espace fonctionnel il appartient (L1, L2, ...) et calculer sa transformée de Fourier (dans L1, L2 ou au sens des distributions)."
							},
							{
								"obj": "Savoir Calculer la fonction de corrélation d'un signal d'énergie finie ou de puissance moyenne finie.",
								"sit": "Détermination du temps de retard d'un canal de transmission."
							},
							{
								"obj": "Maitriser les conditions d'application du théorème d'échantillonnage.",
								"sit": "Conditions que doit satisfaire un signal de voix pour être transmis numériquement à la vitesse de 64kbps"
							},
							{
								"obj": "Synthétiser un filtre numérique passe bas idéal.",
								"sit": "Décryptage du son canal+."
							}
						]
					},
					{
						"nom": "Gestion de processus par Microcontrôleurs",
						"semestre": 1,
						"coeff": 2,
						"nb_heures": 21,
						"repartition": [0, 0, 0, 21, 0, 0],
						"supports": [],
						"resume": "Analyse et conception d’un système complet, architecturé autour d’un microcontrôleur\n\n- Utilisation de ce système pour le développement d’une application permettant de commander un processus externe.",
						"contenu": "- Familiarisation avec les outils de développement\n\n- Analyse de la carte de développement, des capteurs, des actionneurs et des interfaces\n\n- Conception et réalisation du montage électronique\n\n- Programmation et tests\n\n- Exemples d’applications : contrôle d'un moteur pas à pas, d'un écran à cristaux liquides, gestion d’un clavier matriciel et réalisation d'une calculatrice,...",
						"objectifs/situations": [
							{
								"obj": "Développer une application architecturée autour d’un microcontrôleur et de périphériques (capteurs et actionneurs).",
								"sit": "Relier les périphériques et les composants au microprocesseur en tenant compte des spécifications techniques des documentations.\n\nConcevoir et développer la partie matérielle et logicielle d’un système basé sur un microcontrôleur."
							}
						]
					},
					{
						"nom": "Traitement numérique du signal",
						"semestre": 1,
						"coeff": 2,
						"nb_heures": 21,
						"repartition": [0, 0, 0, 21, 0, 0],
						"supports": [],
						"resume": "- Savoir implémenter sur une carte à processeur de traitement de signal DSP, différents algorithmes de traitement de signal après avoir pris connaissance de l’architecture spécifique à ce processeur.\n\n- Effectuer des traitements sur un signal audio.",
						"contenu": "Etude de la carte DSP : détermination des emplacements mémoire, identification des ports, étude de l’interface A/N et N/A.\n\nEtude de la partie logicielle : initialisation du DSP et du circuit Convertisseur.\n\nApplications : dérivée et intégrale d’un signal, oscillateur numérique, filtres numériques, traitements sur le son (écho, réverbération, compression, ...)",
						"objectifs/situations": [
							{
								"obj": "Développer des traitements numériques sur des signaux discrets, en programmant les algorithmes de traitement temps réel en C sur une plateforme DSP.",
								"sit": "Concevoir et développer des filtres de type FIR et IIR.\n\nDévelopper des traitements audio en C sur une plateforme DSP et en utilisant MATLAB."
							}
						]
					},
					{
						"nom": "Projet Scientifique et Technique",
						"semestre": 2,
						"coeff": 4,
						"nb_heures": 45,
						"repartition": [0, 0, 10, 0, 35, 0],
						"supports": [],
						"resume": "Concevoir un système complexe (interactions de plusieurs sous-systèmes) : Définir, Modéliser, Simuler/tester, Valider le modèle sur un prototype, Expliquer le modèle, Comparer avec le réalisé, Proposer des axes d’amélioration, Réaliser le système améliorer\n\nValoriser son projet",
						"contenu": "Le Projet des Sciences de l’Ingénieur permet à l’étudiant de se confronter à la démarche projet de l’ingénieur, de développer le travail en équipe, les techniques de communication ainsi que le travail collaboratif.\nLes élèves constituent leur groupe (de 4 à 5 étudiants) et choisissent le domaine où ils souhaitent travailler.\n\nLe projet :\n1. Réaliser une application ou une expérimentation qui peut répondre à des besoins à moyen terme d’une entreprise, d’une association humanitaire ou d’un organisme à but pédagogique. Il repose sur une étude scientifique et technique, partant des pratiques concrètes en entreprise sur le sujet\n\n2. Concevoir un système complexe (interactions de plusieurs sous-systèmes) : Définir, Modéliser, Simuler/tester, Valider le modèle sur un prototype, Expliquer le modèle, Comparer avec le réalisé, Proposer des axes d’amélioration, Réaliser le système améliorer\nValoriser son projet\n\n3. Mettre en oeuvre les techniques de conduite de projet : chaque groupe devra mettre en place l’organisation de la structuration du projet",
						"objectifs/situations": [
							{
								"obj": "Problématiser et délimiter le sujet",
								"sit": "Remise d'un document de cadrage du projet qui présente ce sur quoi porte le projet (le quoi ?)"
							},
							{
								"obj": "Identifier les problèmes à résoudre",
								"sit": "Remise d'un document de cadrage du projet qui présente une décomposition pertinente et cohérente de la démarche de réalisation"
							},
							{
								"obj": "Réguler la dynamique de groupe,\n\nOrganiser le travail,\n\nTravailler en équipe",
								"sit": "Organisation de réunion de suivis régulières permettant à l'équipe de l'avancement du projet, de la répartition des tâches entre les membres prochaines étapes."
							}
						]
					},
					{
						"nom": "Automatique",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 36,
						"repartition": [0, 27, 9, 0, 0, 0],
						"supports": ["powerpoint", "doc_papier"],
						"resume": "L’enseignement porte sur les bases de l’automatique pour l'étude et la conception de l'asservissement des systèmes linéaires dans le respect d'un cahier des charges fixé en termes de stabilité, rapidité et précision. La notion de fonction de transfert est abordée ainsi que différents types de correcteurs (PID, avance et retard de phase), pour des systèmes à temps continu et à temps discret. Les différentes notions sont mises en pratique à travers des exercices basés sur l’étude de systèmes physiques réels, et la manipulation des logiciels de calculs et de simulation associés (Matlab-Simulink).",
						"contenu": "Contenu commun 3A/CFA :\n\nA. Introduction : Structure générale d'un système asservi, performances d'un système asservi, notion de modèle\n\nB. Systèmes linéaires à temps continu\n\n1. Définition et propriétés : linéarité, invariance, causalité\n\n2. Représentation des systèmes linéaires continus\n\n2.1. Représentation temporelle : équation différentielle ordinaire, linéarisation, réponses aux signaux tests\n2.2. Représentation fréquentielle : transformée de Laplace, propriétés, transformées usuelles, théorèmes de la valeur initiale et de la valeur finale, fonction de transfert, réponse fréquentielle, diagrammes de Bode, Black et Nyquist\n\n3. Systèmes du 1er ordre : exemples en mécanique et électronique, représentation temporelle, représentation fréquentielle\n\n4. Systèmes du 2e ordre : exemples en mécanique et électronique, représentation temporelle, représentation fréquentielle\n\n5. Performances des systèmes asservis\n\n5.1. Structure générale d'un système asservi : schémas bloc, fonctions de transfert en boucle ouverte et en boucle fermée\n5.2. Stabilité : définition, conditions de stabilité, carte des pôles, critère de Routh, critère du revers dans les plans de Black et Nyquist, marges de stabilité, robustesse\n5.3. Précision : précision en régime permanent, erreurs de position, de vitesse et d'accélération, classe du système, erreur due à une perturbation constante, effet d'un intégrateur, précision dynamique, dépassement\n5.4. Rapidité : temps de montée, temps de réponse à 5% et à n%\n\n6. Synthèse de correcteurs : actions correctrices, correcteur proportionnel, correcteur proportionnel dérivé et à avance de phase, correcteur proportionnel intégral et à retard de phase, correcteur PID, synthèse par l'abaque de Black-Nichols, réglage simplifié par la 1ere méthode de Ziegler-Nichols\n\n\nContenu supplémentaire 3A :\n\nRéglage pratique d'un PID, correcteurs à avance et retard de phase, applications à un système réel (saturations, dispositifs anti wind-up).\n\nC. Systèmes à temps discret\n\n1. Discrétisation d'un signal continu (théorème de Shannon, échantillonneur - bloqueur d'ordre zéro)\n\n2. Equations de récurrence, transformée en Z\n\n3. Fonctions de transfert\n\n4. Structure générale d'un système asservi\n\n5. Stabilité (critère de stabilité, utilisation des méthodes du continu)\n\n6. Précision\n\n7. Commande (utilisation des méthodes du continu)",
						"objectifs/situations": [
							{
								"obj": "Savoir modéliser un système en vue de concevoir un asservissement",
								"sit": "Exercices en TD sur la linéarisation et la transformée de Laplace pour le passage d’une modélisation physique (équations électriques et mécaniques) à une fonction de transfert.\n\nExercices en TD sur la compréhension de la notion d’asservissement et l’analyse d’un système asservi : identification des sous-systèmes physiques (capteur, correcteur, système à asservir, etc..), passage de la description d’un système physique à un schéma fonctionnel puis à un schéma bloc, etc."
							},
							{
								"obj": "Proposer un correcteur adapté au système à asservir et permettant d’obtenir des performances spécifiées",
								"sit": "Exercices en TD sur les différents types d’actions correctrices (P, I, D) et le calcul des performances obtenues. Proposition par l’élève d’un type de correcteur adapté. Exercice en simulation (Simulink) sur l’implémentation de différents types de correcteurs."
							},
							{
								"obj": "Savoir manipuler les outils de calcul et de simulation pour l’automatique (Matlab et Simulink)",
								"sit": ""
							}
						]
					},
					{
						"nom": "Asservissement d'un moteur",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 21,
						"repartition": [0, 0, 0, 21, 0, 0],
						"supports": [],
						"resume": "On se propose d'asservir la position angulaire d'un disque, entraîné par un moteur à courant continu, à celle d'un potentiomètre de commande.\n\nAu préalable , il conviendra d'identifier la fonction de transfert de l'ensemble motoréducteur - disque par analyse de la réponse indicielle.\n\nL' asservissement sera réalisé tout d'abord par retour potentiométrique simple.\n\nIl sera ensuite amélioré par insertion d'un correcteur de type PID analogique (à amplificateurs opérationnels) puis numérique (sur microcontrôleur /DSP). Une simulation du processus corrigé est préalablement effectuée.",
						"contenu": "- Etude théorique du système.\n\n- Etude des modèles corrigés en simulation (avec Matlab/Simulink et PSPICE)\n\n- Etude expérimentale : correction analogique (par AOP) et correction numérique (par microcontrôleur).\n\n- Comparaison des résultats et synthèse.",
						"objectifs/situations": [
							{
								"obj": "Analyser puis corriger le comportement d’un système asservi en position par un moteur à courant continu.",
								"sit": "Schématiser et analyser un système bouclé asservi en position par un moteur à courant continu.\n\nCalculer les paramètres d’un correcteur PID.\n\nEstimer l’incidence du correcteur dans la réponse statique et dynamique du système.\n\nSimuler et expérimenter le système avec et sans correction."
							}
						]
					},
					{
						"nom": "De l'atome aux composants éléctroniques",
						"semestre": 2,
						"coeff": 2,
						"nb_heures": 36,
						"repartition": [0, 18, 0, 0, 18, 0],
						"supports": ["doc_papier", "web"],
						"resume": "Physique atomique :\n- Essentiellement descriptif\n- Notions de Quantification, physique probabiliste\n\nPhysique Quantique :\n- Comprendre et savoir résoudre une équation de Schrödinger dans un cas simple (particule dans une boite)\n\nPhysique statistique :\n- Comprendre la différence entre les différentes distributions\n- Comprendre comment les propriétés des corps à l'échelle courante (macroscopique) s'expliquent à partir de leurs constituants microscopiques (atomes, molécules, ions)\n\nPhysique du Solide :\n- Comprendre la constitution et la réalisation d’un semi-conducteur\n- Via un travail de simulation envisagé pour le futur\n\nSynthèse du cours de physique de 3A :\n- Comprendre quelques applications technologiques du futur, basées sur les lois physiques étudiées dans le cours de physique de 3A.",
						"contenu": "Thème 1. Physique atomique\n\n- Structure atomique : atome de Bohr, raies spectrales d'émission et absorption.\n\n- Nombres quantiques : quantification orbitale, spin, effet Zeeman, configuration électronique des atomes...\n\n- Dualité Onde-Corpuscule, longueur d'onde de Broglie, Expérience de Davisson et Germer\n\n- Relations d'Incertitude de Heisenberg.\n\n- Applications de la Physique atomique : étude d'un spectre lumineux, effet laser, introduction à la physique nucléaire...\n\n\nThème 2. Physique Quantique\n\n- Formalismes de la mécanique classique : Newton, Lagrange et Hamilton.\n\n- Outils mathématiques de la Mécanique quantique : Opérateurs quantiques, probabilités, fonctions de carré sommable\n\n- Équation d'évolution de Schrödinger : particule dans un potentiel stationnaire, puits de potentiel, barrière de potentiel\n\n- Étude des systèmes quantiques de base : oscillateur harmonique à un degré de liberté, atome d'hydrogène, particule confinée dans l'espace.\n\n- Applications de la Physique Quantique : effet Compton, effet Doppler, diffraction électronique, effet tunnel (microscope électronique), microscope à effet de champs...\n\n\nThème 3. Physique Statistique\n\n- Le monde microscopique\n\n- Caractères quantiques des particules. Énergies quantiques usuelles. Bosons et fermions\n\n- Introduction à la physique des grands ensembles : équilibre, états macroscopiques et microscopiques d’un système de N particules\n\nPostulats de la Physique Statistique.\n\n- Rappels de thermodynamique classique\n\n- Entropie statistique\n\nLa statistique de Maxwell Boltzmann\n\n- Hypothèses de bases de la statistique de Maxwell Boltzmann\n\n- Répartition à l’équilibre. Fonction de partition\n\n- Applications de la statistique de Maxwell Boltzmann : théorie cinétique des gaz, modèle simple de la pression atmosphérique, aimantation...\n\nLes Statistiques Quantiques\n\n- Hypothèses de bases des statistiques quantiques\n\n- La statistique de Bose Einstein\n\n- La statistique de Fermi Dirac\n\n- Statistique de Maxwell Boltzmann corrigée\n\nApplications des Statistiques Quantiques\n\n- Le rayonnement du Corps Noir\n\n- Interaction Onde Matière\n\n- LASER\n\n- Phonons\n\n- Conduction électronique\n\n\nThème 4. Physique du solide et des semi-conducteurs\n\nGénéralités sur les électrons dans les solides\n\nLes semi-conducteurs intrinsèques\n\n- Exemples courants : le Silicium et le Germanium...\n\n- Conduction dans les semi-conducteurs : courant d’électrons, courant de trous, densité d’électrons dans la bande de conduction, position du niveau de Fermi\n\nLes semi-conducteurs extrinsèques\n\n- Dopage P, dopage N\n\n- Niveau de Fermi\n\n- Relation d’action de masse\n\nApplication des propriétés semi-conductrices\n\n- La jonction PN\n\n- L’effet transistor\n\nLes phénomènes de transport dans les cristaux\n\n- Courant de conduction\n\n- Courant de diffusion\n\n- Lois de FICK\n\n- Effet HALL",
						"objectifs/situations": [
							{
								"obj": "Partant de l’atome jusqu’à l’état solide, l’objectif principal de ce module est de montrer que le fonctionnement des différents types de composants de la microélectronique et des capteurs intégrés passent par la connaissance et la compréhension de phénomènes physiques, atomiques et quantiques, régissant les propriétés microscopiques de la matière.",
								"sit": "Physique atomique\n\n- Structure atomique : atome de Bohr, raies spectrales d'émission et absorption.\n\n- Nombres quantiques : quantification orbitale, spin, effet Zeeman, configuration électronique des atomes...\n\n- Dualité Onde-Corpuscule, longueur d'onde de Broglie, Expérience de Davisson et Germer\n\n- Relations d'Incertitude de Heisenberg.\n\n- Applications de la Physique atomique : étude d'un spectre lumineux, effet laser, introduction à la physique nucléaire...\n\n\nPhysique Quantique\n\n- Formalismes de la mécanique classique : Newton, Lagrange et Hamilton.\n\n- Outils mathématiques de la Mécanique quantique : Opérateurs quantiques, probabilités, fonctions de carré sommable\n\n- Équation d'évolution de Schrödinger : particule dans un potentiel stationnaire, puits de potentiel, barrière de potentiel\n\n- Étude des systèmes quantiques de base : oscillateur harmonique à un degré de liberté, atome d'hydrogène, particule confinée dans l'espace.\n\n- Applications de la Physique Quantique : effet Compton, effet Doppler, diffraction électronique, effet tunnel (microscope électronique), microscope à effet de champs..."
							},
							{
								"obj": "Expliquer le lien entre les propriétés macroscopiques d’un corps et le comportement de ses constituants microscopiques",
								"sit": "Appliquer le théorème d’équipartition de l’énergie pour prédire et estimer l’énergie interne d’un système physique\n\nUtiliser les fonctions de distribution de Maxwell-Botzman pour étudier le mouvement des molécules d’un gaz parfait"
							},
							{
								"obj": "Expliquer et interpréter le rayonnement d’un corps noir",
								"sit": "Appliquer les lois de Planck pour estimer la densité de photons et la densité d’énergie émises par un rayonnement électromagnétique"
							},
							{
								"obj": "Décrire les phénomènes physiques de base dans un laser",
								"sit": "Appliquer les lois de Planck pour calculer différentes caractéristiques d’un laser : puissance de sortie, température, ..."
							},
							{
								"obj": "Expliquer et interpréter le comportement des électrons dans les solides et notamment dans les semi-conducteurs intrinsèques et extrinsèques",
								"sit": "Identifier et appliquer les lois appropriées pour calculer la densité de porteurs de charges dans un semi-conducteur\n\nAppliquer les lois de Fick pour calculer les courants circulants dans un semi-conducteur"
							}
						]
					}
				]
			},
			{
				"nom": "Formation humaine",
				"ratio": 28,
				"matières": [
					{
						"nom": "Projet de formation humaine : Lancement",
						"semestre": 1,
						"coeff": 2,
						"nb_heures": 12,
						"repartition": [0, 0, 0, 0, 12, 0],
						"supports": [],
						"resume": "Les projets de formation humaine de l'ESIEA sont des projets citoyens et responsables, ancrés dans le réel et le possible, novateurs, rationnels et humanistes. Ils permettent aux étudiants de réaliser sur une année un projet portant sur un domaine spécifique et de leur choix (création artistique, écologie, économie sociale et solidaire, vie associative...), de réfléchir à des problématiques nouvelles, d'agir dans des situations complexes (pro-activité) et de développer des compétences transversales. L'activité des projets de formation humaine permet de construire son projet personnel et professionnel.",
						"contenu": "- Ateliers : méthodologie de la conduite de projet, approfondissement (les trois phases d'un projet, lancement, réalisation, transmission), méthodologie de la rédaction d'un rapport d'avant-projet (problématique, objectifs, plan d'action et de financement), méthodologie de la présentation orale d'un projet, stratégies de communication. Ateliers spécifiques : plan stratégique, valorisation de son projet à l'intérieur et à l'extérieur de sa communauté, à l'international, recherche de nouveaux partenaires (financiers ou en nature)...\n\n- Conférences : autour d'une thématique choisie chaque année (2014-2015 : la métamorphose)... et sur des sujets de société : femmes et sciences, les actions de solidarité, le système ontophanique numérique...\n\n- Projet suivi par des professeurs, des anciens élèves de l'ESIEA, des acteurs du monde professionnel et associatif...\n\n- Réunions mentoring (1 à 2 fois par semestre) : bilan, avancement du projet, évaluation du porte-folio numérique, recommandation...\n\nL'activité des projets de formation humaine est axée principalement sur le management de projet en troisième année, sans que cet éclairage soit exclusif.",
						"objectifs/situations": []
					},
					{
						"nom": "Macro Économie et Économie industrielle",
						"semestre": 1,
						"coeff": 2,
						"nb_heures": 21,
						"repartition": [0, 12, 9, 0, 0, 0],
						"supports": ["doc_numerique", "powerpoint"],
						"resume": "Ce module a pour objectifs principaux :\n\n- permettre aux étudiants de comprendre et d'analyser leur environnement économique au niveau international, national et de l'entreprise,\n\n- donner une réelle connaissance de l'entreprise et de l'industrie (dont l'EIT: Electronique, Informatique, Télécom) pour faciliter leur insertion professionnelle, ainsi que des outils d'analyse d'entreprise et de secteur.",
						"contenu": "Ce module a pour objectifs principaux :\n\n- permettre aux étudiants de comprendre et d'analyser leur environnement économique au niveau international, national et de l'entreprise,\n\n- donner une réelle connaissance de l'entreprise et de l'industrie (dont l'EIT: Electronique, Informatique, Télécom) pour faciliter leur insertion professionnelle, ainsi que des outils d'analyse d'entreprise et de secteur.\n\n\n1-INTRODUCTION A L'ECONOMIE\n\nLe capitalisme.Fonctionnement des marchés.\n\nLes politiques économiques.\n\nLes problématiques actuelles: chômage, PIB, dette et déficit public, croissance, crise, mondialisation, compétitivité, protection sociale et Etat-providence etc...\n\n\n2- ECONOMIE D'ENTREPRISE\n\nL'entreprise: types, organisations, grandes fonctions.\n\nLa structure des marchés: offre, demande, concentration, barrières.\n\nLa concurrence: parfaite, monopole, oligopole, internationale.\n\nLes stratégies: génériques, technologiques, spécialisation etc...\n\n\n3- ECONOMIE INDUSTRIELLE\n\nLe système productif: industrie, secteur, filière, branche.\n\nLes outils de l'analyse sectorielle.\n\nL'industrie française et mondiale. L'EIT.\n\n\n4- ECONOMIE DE L'INNOVATION\n\nApproche classique.L'entreprise innovante.Processus, cycles.\n\nInnovation technologique, produit/process/organisationnelle, de rupture/incrémentale/de routine.\n\nStratégies d'innovation.Développement de nouveaux produits.",
						"objectifs/situations": [
							{
								"obj": "- Comprendre et analyser l'environnement économique au niveau international et national au travers d'une culture générale en macroéconomie.",
								"sit": "- Contrôle de connaissance par un devoir sur table consistant en questions de cours avec exemples à fournir pour illustrer l'assimilation des concepts."
							},
							{
								"obj": "- Comprendre et analyser l'entreprise, pour faciliter insertion et réussite professionnelle",
								"sit": "- Contrôle de connaissance par devoir sur table\n\n- Etude de cas: dans le cadre d'un micro-projet, les étudiants analysent en équipe, à partir des outils du cours, une entreprise de leur choix en cohérence avec leur projet professionnel.\n\nLe micro-projet donne lieu à un rapport noté et éventuellement un bref exposé en TD."
							},
							{
								"obj": "- Comprendre et analyser un secteur industriel, pour faciliter insertion et réussite professionnelle",
								"sit": "- Contrôle de connaissance par devoir sur table\n\n- Analyse sectorielle: dans le cadre du micro-projet précédent, les étudiants analysent en équipe, à partir des outils du cours, le secteur industriel de l'entreprise choisie.\n\nCes analyses sectorielles et d'entreprises peuvent constituer une banque de données pour l'ESIEA dans le cadre de l'insertion professionnelle des stagiaires et diplômés."
							},
							{
								"obj": "- Connaitre l'économie de l'innovation au niveau de l'entreprise",
								"sit": ""
							}
						]
					},
					{
						"nom": "Anglais",
						"semestre": 1,
						"coeff": 2,
						"nb_heures": 21,
						"repartition": [0, 0, 21, 0, 0, 0],
						"supports": ["doc_papier", "powerpoint", "audio", "video", "web", "ordinateur"],
						"resume": "In this module, students will analyze information about ESIEA's mission abroad program to better develop their own goals for international work and study. Notions of cultural identity, fighting stereotypes and accepting difference will be introduced. Students will begin acquiring skills for effective presentations.",
						"contenu": "In this module, students will analyze information about ESIEA's mission abroad program to better develop their own goals for international work and study. Notions of cultural identity, fighting stereotypes and accepting difference will be introduced. Students will begin acquiring skills for effective presentations.\n\n\nThis module will include work on preparing the mission abroad in the following notional areas:\n\n-Introducing the notion of cultural identity\n\n-Raising awareness of how France and the French are viewed by others\n\n-Completing intercultural questionnaires and comparing data coming from different countries\n\n-Gaining knowledge about the opportunities ESIEA offers and discussing the pros and cons of the various opportunities in English;\n\n\nStudents will learn to\n\n-Email and telephone effectively in English to prepare a stay abroad\n\n\nStudents will also begin acquiring the skills for effective presentations\n\n-Body language\n\n-Signposting language\n\n-Use of visuals, etc.",
						"objectifs/situations": [
							{
								"obj": "Able to understand and use the language of trends and change.",
								"sit": "Lesson on language of trends and change; incorporation of this language in oral presentations"
							},
							{
								"obj": "Able to speak clear, understandable and structured\n\nEnglish on a clearly defined topic using appropriate vocabulary and signposting",
								"sit": "Presentation, telephoning to meet an objective"
							},
							{
								"obj": "Able to write a simple email giving and requesting information for the purpose of doing a mission abroad",
								"sit": "Lessons on emailing, followed by in-class and at home writing activities"
							},
							{
								"obj": "Able to name the major international academic programs offered by ESIEA and explain application procedures: Erasmus, BCI, dual degrees\n\nAssume a self-reflexive attitude toward notions of identity, cultural context",
								"sit": ""
							},
							{
								"obj": "Assume a self-reflexive attitude toward notions of identity, cultural context",
								"sit": ""
							}
						]
					},
					{
						"nom": "LV2, FLE, anglais renforcé",
						"semestre": 1,
						"coeff": 0,
						"nb_heures": 15,
						"repartition": [0, 0, 15, 0, 0, 0],
						"supports": ["doc_papier", "powerpoint", "audio", "video", "web", "ordinateur"],
						"resume": "- Acquérir les compétences communicatives et interculturelles dans la langue choisie\n\n- Préparer des tests de niveau certifiants (TOEIC, Goethe Zertifikat, Cervantes, …)\n\n- Acquérir un niveau de maîtrise des structures grammaticales de la langue choisie permettant une communication simple mais non ambiguë",
						"contenu": "A la discrétion de l’enseignant. Peut inclure...\n\n- Etude de textes d’actualité\n\n- Ecoute d’enregistrements audiovisuels\n\n- Expression orale sur des sujets personnels ou professionnels\n\n- Expression écrite sur des sujets personnels ou professionnels\n\n- Exercices de grammaire\n\n- Apprentissage de vocabulaire\n\n- Présentation d’exposés\n\n- Expression interactive/ débats",
						"objectifs/situations": [
							{
								"obj": "Etre capable, à l’aide d’un dictionnaire, de comprendre des textes dans la langue cible.",
								"sit": "Lecture de textes authentiques dans la langue cible, que cela soit en classe ou à la maison. Des textes peuvent également être publiés sur le Moodle ou envoyés par une plateforme d'apprentissage en ligne. A la discrétion de l'enseignant, certaines de ces lectures peuvent être accompagnées d'une évaluation de compréhension donnant lieu à une note."
							},
							{
								"obj": "Etre capable, à l’aide d’un dictionnaire, d’écrire des textes compréhensibles dans la langue cible (email, CV, lettre de motivation...)",
								"sit": "Rédaction de textes dans la langue cible, dans la langue cible, que cela soit en classe ou à la maison. A la discrétion de l'enseignant, certaines de ces rédactions peuvent donner lieu à une note."
							},
							{
								"obj": "Etre capable de suivre une conversation ou un document audio-visuel bref, dans la langue cible.",
								"sit": "Ecoute de documents authentiques dans la langue cible, que cela soit en classe ou à la maison. Des textes peuvent également être publiés sur le Moodle ou envoyés par une plateforme d'apprentissage en ligne. A la discrétion de l'enseignant, certaines de ces documents audio ou audio-visuel peuvent être accompagnés d'une évaluation de compréhension donnant lieu à une note."
							},
							{
								"obj": "Etre capable de se faire comprendre dans la langue cible de façon non ambiguë",
								"sit": ""
							}
						]
					},
					{
						"nom": "Activité information-communication : APIC",
						"semestre": 1,
						"coeff": 1,
						"nb_heures": 4.5,
						"repartition": [0, 4.5, 0, 0, 0, 0],
						"supports": [],
						"resume": "Au cours de votre vie étudiante et professionnelle, vous serez amené à exercer vos talents de communicant. Que ce soit pour valoriser un projet associatif, convaincre un jury, faire un exposé devant vos professeurs, décrocher un stage puis un emploi, mener à bien une mission professionnelle, etc.\nVous aurez besoin de communiquer et d’être capable:\n\n- De promouvoir une idée, une réalisation ou un produit ;\n- De travailler en équipe, d’argumenter, de négocier pour arriver à un accord ;\n- D’informer et convaincre de multiples interlocuteurs dont certains, étrangers à votre univers et sa technicité.\n\nL'APIC (Actions de Promotion Information et Communication) est un des modules vous permettant de mieux communiquer. Il se fixe un triple objectif :\n\n1. Donner une vision d’ensemble, à la fois théorique et fonctionnelle des aspects liés à la communication persuasive, interpersonnelle et stratégique : construire un message et le délivrer au bon moment, renforcer son argumentation et savoir l’adapter à ses interlocuteurs pour un démultiplier l’impact.\n2. Mettre en pratique les connaissances acquises afin de contribuer à la notoriété et à la réputation de l’école lors des manifestations organisées par le service communication.\n3. Aider par des conseils pratiques, à la valorisation des actions des différentes associations de l’école et des projets pédagogiques réalisés par les étudiants (scientifiques ou de formation humaine)",
						"contenu": "Notions abordées :\n\n- Approche théorique des techniques de communication.\n- Principes de base de la Programmation Neurolinguistique.\n- Modèle de la probabilité d’élaboration, pyramide de Maslow, théorie cognitiviste, les voies de la perception (émotionnelle et rationnelle).\n- Principes fondamentaux, méthodes et procédés de la rhétorique et de la communication persuasive : construction du discours rhétorique, facteurs qui augmentent la crédibilité, principes de formulation, lois de l’influence, etc.\n- La dimension non verbale de la communication : attitude, langage corporel et synchronisation.\n- Conseils pratiques et facteurs généraux intervenant dans les situations de communication d’un « esiearque ».\n\nEvaluation semestrielle :\n\nL’évaluation sera à la fois quantitative et qualitative (bonus/malus).\n- Assiduité et participation en cours (20%)\n- Actions de communication (80%)\n\nChaque étudiant devra réaliser au moins une action de communication par semestre au service de son école lui permettant de mettre en pratique les techniques et conseils donnés:\n\n- Présence au forum d’orientation de son lycée ou d’un lycée proche de son établissement ;\n- Intervention en classe dans un établissement scolaire pour présenter le métier d’ingénieur;\n- Participation aux journées portes ouvertes ou journées de concours ;\n- Participation active à l’un des salons ou l’école sera présente ;\n- Rédaction d’articles (correspondant communication), reportage photo ou vidéo, participation à la web team de l’école ;\n- Aide à l’organisation de tout événement engageant l’image de l’école organisé par la Direction de la Communication.",
						"objectifs/situations": []
					},
					{
						"nom": "Projet de Formation Humaine : Réalisation",
						"semestre": 2,
						"coeff": 1.5,
						"nb_heures": 24,
						"repartition": [0, 0, 0, 0, 24, 0],
						"supports": [],
						"resume": "Les projets de formation humaine de l'ESIEA sont des projets citoyens et responsables, ancrés dans le réel et le possible, novateurs, rationnels et humanistes. Ils permettent aux étudiants de réaliser sur une année un projet portant sur un domaine spécifique et de leur choix (création artistique, écologie, économie sociale et solidaire, vie associative...), de réfléchir à des problématiques nouvelles, d'agir dans des situations complexes (pro-activité) et de développer des compétences transversales. L'activité des projets de formation humaine permet de construire son projet personnel et professionnel.",
						"contenu": "- Ateliers : méthodologie de la conduite de projet (les trois phases d'un projet, lancement, réalisation, transmission), méthodologie de la rédaction d'un rapport d'avant-projet (problématique, objectifs, plan d'action et de financement), méthodologie de la présentation orale d'un projet. Ateliers spécifiques : plan de diffusion, les réponses du destinataire d'un projet artistique...\n\n- Conférences : autour d'une thématique choisie chaque année (2014-2015 : la métamorphose)... et sur des sujets de société : femmes et sciences, les actions de solidarité, le système ontophanique numérique...\n\n- Projet suivi par des professeurs, des anciens élèves de l'ESIEA, des acteurs du monde professionnel et associatif...\n\n- Réunions mentoring (1 à 2 fois par semestre) : bilan, avancement du projet, évaluation du porte-folio numérique, recommandation...",
						"objectifs/situations": []
					},
					{
						"nom": "Projet Professionnel et conférences métiers",
						"semestre": 2,
						"coeff": 1.5,
						"nb_heures": 30,
						"repartition": [0, 18, 12, 0, 0, 0],
						"supports": ["powerpoint"],
						"resume": "Se préparer au stage technique : actualiser son CV ; gérer son image numérique et réussir son entretien",
						"contenu": "- Introduction à l’identité numérique et sa gestion.\n\n- Sensibilisation à l’impact de son image dans les médias sociaux sur sa vie professionnelle et conseils pour la nettoyer, la construire et la développer.\n\n- Travail sur le CV et la lettre de motivation en relation avec des offres de stage\n\n- Réalisation d’entretiens avec des professionnels\n\n- Conférences métiers",
						"objectifs/situations": [
							{
								"obj": "Perfectionner ses outils de communication",
								"sit": "CV et lettre de motivation itérées et évaluées"
							},
							{
								"obj": "Se préparer à l'entretien",
								"sit": "Entretien individuel par des entreprises avec grille d'évaluation"
							},
							{
								"obj": "Gérer son image numérique",
								"sit": "Actualiser son e-port-folio avec les réseaux sociaux"
							},
							{
								"obj": "Identifier les missions d’un ingénieurs",
								"sit": ""
							}
						]
					},
					{
						"nom": "Etre et s'affirmer en relations",
						"semestre": 2,
						"coeff": 0.5,
						"nb_heures": 12,
						"repartition": [0, 0, 12, 0, 0, 0],
						"supports": ["powerpoint"],
						"resume": "Ce module a pour objectif d'apprendre à mieux travailler en équipe. Notamment évaluer ses forces et faiblesses pour s’affirmer, s’entraîner à recadrer et aux différents outils pour s’affirmer, se mettre dans l’action pour dépasser ses peurs et changer ses comportements.",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "- Apprendre à mieux travailler en équipe\n\n- Evaluer ses forces et faiblesses pour s’affirmer\n\n- Comprendre les mécanismes et les enjeux de l’Affirmation de soi\n\n- S’entraîner à recadrer et aux différents outils pour s’Affirmer\n\n- Se mettre dans l’action pour pour dépasser ses peurs et changer ses comportements",
								"sit": "Quizz"
							}
						]
					},
					{
						"nom": "Anglais et TOIEC",
						"semestre": 2,
						"coeff": 3,
						"nb_heures": 21,
						"repartition": [0, 0, 21, 0, 0, 0],
						"supports": ["doc_papier", "powerpoint", "audio", "video", "web", "ordinateur"],
						"resume": "In this module, students will analyze information about ESIEA's mission abroad program to better develop their own goals for international work and study. Notions of cultural identity, fighting stereotypes and accepting difference will be introduced. Students will begin acquiring skills for effective presentations.",
						"contenu": "In this module, students will analyze information about ESIEA's mission abroad program to better develop their own goals for international work and study. Notions of cultural identity, fighting stereotypes and accepting difference will be introduced. Students will begin acquiring skills for effective presentations.\n\n\nThis module will include work on preparing the mission abroad in the following notional areas:\n\n-Introducing the notion of cultural identity\n\n-Raising awareness of how France and the French are viewed by others\n\n-Completing intercultural questionnaires and comparing data coming from different countries\n\n-Gaining knowledge about the opportunities ESIEA offers and discussing the pros and cons of the various opportunities in English;\n\n\nStudents will learn to\n\n-Email and telephone effectively in English to prepare a stay abroad\n\n\nStudents will also begin acquiring the skills for effective presentations\n\n-Body language\n\n-Signposting language\n\n-Use of visuals, etc.",
						"objectifs/situations": [
							{
								"obj": "Able to understand and use the language of trends and change.",
								"sit": "Lesson on language of trends and change; incorporation of this language in oral presentations"
							},
							{
								"obj": "Able to speak clear, understandable and structured\n\nEnglish on a clearly defined topic using appropriate vocabulary and signposting",
								"sit": "Presentation, telephoning to meet an objective"
							},
							{
								"obj": "Able to write a simple email giving and requesting information for the purpose of doing a mission abroad",
								"sit": "Lessons on emailing, followed by in-class and at home writing activities"
							},
							{
								"obj": "Able to name the major international academic programs offered by ESIEA and explain application procedures: Erasmus, BCI, dual degrees\n\nAssume a self-reflexive attitude toward notions of identity, cultural context",
								"sit": ""
							},
							{
								"obj": "Assume a self-reflexive attitude toward notions of identity, cultural context",
								"sit": ""
							}
						]
					},
					{
						"nom": "LV2, FLE, anglais renforcé",
						"semestre": 2,
						"coeff": 0,
						"nb_heures": 15,
						"repartition": [0, 0, 15, 0, 0, 0],
						"supports": ["doc_papier", "powerpoint", "audio", "video", "web", "ordinateur"],
						"resume": "- Acquérir les compétences communicatives et interculturelles dans la langue choisie\n\n- Préparer des tests de niveau certifiants (TOEIC, Goethe Zertifikat, Cervantes, …)\n\n- Acquérir un niveau de maîtrise des structures grammaticales de la langue choisie permettant une communication simple mais non ambiguë",
						"contenu": "A la discrétion de l’enseignant. Peut inclure...\n\n- Etude de textes d’actualité\n\n- Ecoute d’enregistrements audiovisuels\n\n- Expression orale sur des sujets personnels ou professionnels\n\n- Expression écrite sur des sujets personnels ou professionnels\n\n- Exercices de grammaire\n\n- Apprentissage de vocabulaire\n\n- Présentation d’exposés\n\n- Expression interactive/ débats",
						"objectifs/situations": [
							{
								"obj": "Etre capable, à l’aide d’un dictionnaire, de comprendre des textes dans la langue cible.",
								"sit": "Lecture de textes authentiques dans la langue cible, que cela soit en classe ou à la maison. Des textes peuvent également être publiés sur le Moodle ou envoyés par une plateforme d'apprentissage en ligne. A la discrétion de l'enseignant, certaines de ces lectures peuvent être accompagnées d'une évaluation de compréhension donnant lieu à une note."
							},
							{
								"obj": "Etre capable, à l’aide d’un dictionnaire, d’écrire des textes compréhensibles dans la langue cible (email, CV, lettre de motivation...)",
								"sit": "Rédaction de textes dans la langue cible, dans la langue cible, que cela soit en classe ou à la maison. A la discrétion de l'enseignant, certaines de ces rédactions peuvent donner lieu à une note."
							},
							{
								"obj": "Etre capable de suivre une conversation ou un document audio-visuel bref, dans la langue cible.",
								"sit": "Ecoute de documents authentiques dans la langue cible, que cela soit en classe ou à la maison. Des textes peuvent également être publiés sur le Moodle ou envoyés par une plateforme d'apprentissage en ligne. A la discrétion de l'enseignant, certaines de ces documents audio ou audio-visuel peuvent être accompagnés d'une évaluation de compréhension donnant lieu à une note."
							},
							{
								"obj": "Etre capable de se faire comprendre dans la langue cible de façon non ambiguë",
								"sit": ""
							}
						]
					},
					{
						"nom": "Activité information-communication : APIC",
						"semestre": 2,
						"coeff": 0.5,
						"nb_heures": 4.5,
						"repartition": [0, 4.5, 0, 0, 0, 0],
						"supports": [],
						"resume": "L'APIC (Actions de Promotion Information et Communication) est un des modules vous permettant de mieux communiquer. Il se fixe un triple objectif.\n\n1. Donner une vision d’ensemble, à la fois théorique et fonctionnelle des aspects liés à la communication persuasive, interpersonnelle et stratégique : construire un message et le délivrer au bon moment, renforcer son argumentation et savoir l’adapter à ses interlocuteurs pour un démultiplier l’impact.\n\n2. Mettre en pratique les connaissances acquises afin de contribuer à la notoriété et à la réputation de l’école lors des manifestations organisées par le service communication.\n\n3. Aider par des conseils pratiques, à la valorisation des actions des différentes associations de l’école et des projets pédagogiques réalisés par les étudiants (scientifiques ou de formation humaine).",
						"contenu": "Suite ou approfondissement des notions abordées au premier semestre\n\n\nNotions abordées :\n\n- Approche théorique des techniques de communication.\n- Principes de base de la Programmation Neurolinguistique.\n- Modèle de la probabilité d’élaboration, pyramide de Maslow, théorie cognitiviste, les voies de la perception (émotionnelle et rationnelle).\n- Principes fondamentaux, méthodes et procédés de la rhétorique et de la communication persuasive : construction du discours rhétorique, facteurs qui augmentent la crédibilité, principes de formulation, lois de l’influence, etc.\n- La dimension non verbale de la communication : attitude, langage corporel et synchronisation.\n- Conseils pratiques et facteurs généraux intervenant dans les situations de communication d’un « esiearque ».\n\nEvaluation semestrielle :\n\nL’évaluation sera à la fois quantitative et qualitative (bonus/malus).\n- Assiduité et participation en cours (20%)\n- Actions de communication (80%)\n\nChaque étudiant devra réaliser au moins une action de communication par semestre au service de son école lui permettant de mettre en pratique les techniques et conseils donnés:\n\n- Présence au forum d’orientation de son lycée ou d’un lycée proche de son établissement ;\n- Intervention en classe dans un établissement scolaire pour présenter le métier d’ingénieur;\n- Participation aux journées portes ouvertes ou journées de concours ;\n- Participation active à l’un des salons ou l’école sera présente ;\n- Rédaction d’articles (correspondant communication), reportage photo ou vidéo, participation à la web team de l’école ;\n- Aide à l’organisation de tout événement engageant l’image de l’école organisé par la Direction de la Communication.",
						"objectifs/situations": []
					},
					{
						"nom": "Management de projet",
						"semestre": 2,
						"coeff": 1,
						"nb_heures": 15,
						"repartition": [0, 0, 15, 0, 0, 0],
						"supports": ["doc_papier", "ms_project"],
						"resume": "Ce module est suivi du module MAN 4302 .A eux deux ils assurent une connaissance pratique et approfondie des invariants principaux qui caractérisent les métiers de Chefs de projet ou de Chargés d'affaire.",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "Prévoir un projet en termes de délais de charges et de coûts pour aller de l'appel d'offres à la signature du contrat avec le Client.",
								"sit": "Prévisions réalisées sur 3 projets industriels."
							},
							{
								"obj": "Conduire et suivre un projet de la signature du contrat jusqu'à le réception définitive par le Client",
								"sit": "Conduite et suivi sur 3 projets industriels"
							},
							{
								"obj": "Se familiariser avec les mathématiques et les outils appliqués dans le domaine du management des projets.",
								"sit": "Utilisation des logiciels de 'Project Management' en particulier MSProject 2012 sur 2 projets industriels."
							},
							{
								"obj": "Apprendre à rédiger un rapport et à le présenter à un Client.",
								"sit": ""
							},
							{
								"obj": "Apprendre à travailler en équipe.",
								"sit": "Travailler en équipe."
							}
						]
					}
				]
			}
		]
	},
	{
		"année": 4,
		"blocs": [
			{
				"nom": "Tronc commun technique",
				"ratio": 0,
				"matières": [
					{
						"nom": "Estimation et analyse de données",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Optimisation numérique et combinatoire",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Réseaux IP",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Programmation système",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Réalité virtuelle",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Imagerie numérique",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Réseaux de neurones",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Cryptologie",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Projet Scientifique et Technique",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			},
			{
				"nom": "Filière systèmes embarqués",
				"ratio": 0,
				"matières": [
					{
						"nom": "Robotique",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "OS Temps réel",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Bus de terrain",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Communication sans fil",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Commande des systèmes",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Programmation VHDL et conception de composants programmables",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			},
			{
				"nom": "Filière systèmes d'information",
				"ratio": 0,
				"matières": [
					{
						"nom": "Programmation WEB avancée",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Programmation Mobile",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Système de Gestion de Bases de Données",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Datamining et applications",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Architecture logicielle",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Programmation distribuée",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Réseaux de neurones",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Introduction au reverse engineering",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			},
			{
				"nom": "Formation humaine et culture de l'entreprise",
				"ratio": 0,
				"matières": [
					{
						"nom": "Connaissance des entreprises",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Management de projets",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Projet Professionnel : Colloque",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Dynamique des relations",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Anglais",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "LV2, FLE, anglais renforcé",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			}
		]
	},
	{
		"année": 5,
		"blocs": [
			{
				"nom": "Majeure au choix",
				"ratio": 0,
				"matières": [
					{
						"nom": "Parcours cybersécurité",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Data science for solutions engineering",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Data science for solutions management",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Systèmes embarqués",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Architecture et Ingénierie du logiciel",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Cloud computing",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Réalité virtuelle et augmentée",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Véhicules autonomes",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			},
			{
				"nom": "Mineure technique au choix",
				"ratio": 0,
				"matières": [
					{
						"nom": "Parcours cybersécurité",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Images numériques",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Architecture Big Data",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Objets connectés",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Robotique & Systèmes autonomes",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Smart Cities - Maisons et villes intelligentes",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			},
			{
				"nom": "Mineure managériale au choix",
				"ratio": 0,
				"matières": [
					{
						"nom": "Parcours cybersécurité",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Systèmes d'information",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Digital consulting",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Techniques quantitatives de management",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Ingénieur d'affaires",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Création d'entreprise",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Management des systèmes d'informations bancaires",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					},
					{
						"nom": "Véhicules autonomes",
						"semestre": 0,
						"coeff": 0,
						"nb_heures": 0,
						"repartition": [0, 0, 0, 0, 0, 0],
						"supports": [],
						"resume": "",
						"contenu": "",
						"objectifs/situations": [
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							},
							{
								"obj": "",
								"sit": ""
							}
						]
					}
				]
			}
		]
	}
]
